<abi-corpus version='2.0' path='data/test-read-dwarf/test-libandroid.so' soname='libandroid.so'>
  <elf-needed>
    <dependency name='liblog.so'/>
    <dependency name='libhidlbase.so'/>
    <dependency name='libcutils.so'/>
    <dependency name='libandroidfw.so'/>
    <dependency name='libinput.so'/>
    <dependency name='libutils.so'/>
    <dependency name='libbinder.so'/>
    <dependency name='libui.so'/>
    <dependency name='libgui.so'/>
    <dependency name='libharfbuzz_ng.so'/>
    <dependency name='libsensor.so'/>
    <dependency name='libandroid_runtime.so'/>
    <dependency name='libminikin.so'/>
    <dependency name='libnetd_client.so'/>
    <dependency name='libhwui.so'/>
    <dependency name='libxml2.so'/>
    <dependency name='android.hardware.configstore@1.0.so'/>
    <dependency name='android.hardware.configstore-utils.so'/>
    <dependency name='libc++.so'/>
    <dependency name='libc.so'/>
    <dependency name='libm.so'/>
    <dependency name='libdl.so'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='AAssetDir_close' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AAssetDir_getNextFileName' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='ASurfaceTransaction_setZOrder' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ASystemFontIterator_close' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ASystemFontIterator_next' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ASystemFontIterator_open' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ATrace_beginAsyncSection' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ATrace_beginSection' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ATrace_endAsyncSection' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ATrace_endSection' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ATrace_isEnabled' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ATrace_setCounter' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_getaddrinfofornetwork' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_res_cancel' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_res_nquery' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_res_nresult' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_res_nsend' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_setprocnetwork' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='android_setsocknetwork' version='LIBANDROID' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='32' path='frameworks/base/libs/storage/IMountService.cpp' language='LANG_C_plus_plus_14'>
    <array-type-def dimensions='1' type-id='801a266d' size-in-bits='560' id='5da7196d'>
      <subrange length='35' type-id='7ff19f0f' id='6e6845b5'/>
    </array-type-def>
    <pointer-type-def type-id='22d61b29' size-in-bits='32' id='9892ee61'/>
    <pointer-type-def type-id='7807f886' size-in-bits='32' id='27ec51bc'/>
    <qualified-type-def type-id='9cb9149f' const='yes' id='dee60e2c'/>
    <reference-type-def kind='lvalue' type-id='dee60e2c' size-in-bits='32' id='ee2819be'/>
    <reference-type-def kind='lvalue' type-id='9cb9149f' size-in-bits='32' id='705b9f3b'/>
    <reference-type-def kind='lvalue' type-id='748cb1b7' size-in-bits='32' id='d7c9afdb'/>
    <pointer-type-def type-id='748cb1b7' size-in-bits='32' id='d3c9a98f'/>
    <reference-type-def kind='lvalue' type-id='60976dc0' size-in-bits='32' id='bb0cd27a'/>
    <pointer-type-def type-id='60976dc0' size-in-bits='32' id='af0cbf96'/>
    <reference-type-def kind='lvalue' type-id='26924198' size-in-bits='32' id='763d7e1a'/>
    <pointer-type-def type-id='6807f016' size-in-bits='32' id='ba5970bc'/>
    <reference-type-def kind='lvalue' type-id='a2aa88e3' size-in-bits='32' id='cab8cdd7'/>
    <reference-type-def kind='rvalue' type-id='a2aa88e3' size-in-bits='32' id='11ec3263'/>
    <pointer-type-def type-id='a2aa88e3' size-in-bits='32' id='beb8baf3'/>
    <reference-type-def kind='lvalue' type-id='3f075162' size-in-bits='32' id='4cb59d14'/>
    <reference-type-def kind='rvalue' type-id='3f075162' size-in-bits='32' id='f3e675b6'/>
    <pointer-type-def type-id='3f075162' size-in-bits='32' id='40b58a30'/>
    <qualified-type-def type-id='bf075117' const='yes' id='d11f779a'/>
    <pointer-type-def type-id='d11f779a' size-in-bits='32' id='e4896a10'/>
    <qualified-type-def type-id='6807f016' const='yes' id='6cf1e15d'/>
    <reference-type-def kind='lvalue' type-id='6cf1e15d' size-in-bits='32' id='fbc5f4a1'/>
    <qualified-type-def type-id='a2aa88e3' const='yes' id='e2905de8'/>
    <reference-type-def kind='lvalue' type-id='e2905de8' size-in-bits='32' id='7743ab4a'/>
    <pointer-type-def type-id='e2905de8' size-in-bits='32' id='6b439866'/>
    <qualified-type-def type-id='3f075162' const='yes' id='1a6371f3'/>
    <reference-type-def kind='lvalue' type-id='1a6371f3' size-in-bits='32' id='5f8c324f'/>
    <pointer-type-def type-id='1a6371f3' size-in-bits='32' id='638c389b'/>
    <qualified-type-def type-id='452328e6' const='yes' id='08f75d23'/>
    <pointer-type-def type-id='08f75d23' size-in-bits='32' id='2667752b'/>
    <qualified-type-def type-id='5ddaf272' const='yes' id='0cbf5aab'/>
    <pointer-type-def type-id='0cbf5aab' size-in-bits='32' id='923b7913'/>
    <qualified-type-def type-id='a1aaab37' const='yes' id='5649c4ec'/>
    <pointer-type-def type-id='5649c4ec' size-in-bits='32' id='9c20c3b2'/>
    <qualified-type-def type-id='e4c905b6' const='yes' id='0f556883'/>
    <reference-type-def kind='lvalue' type-id='0f556883' size-in-bits='32' id='c873bbbf'/>
    <pointer-type-def type-id='0f556883' size-in-bits='32' id='cc73c20b'/>
    <qualified-type-def type-id='34e3553c' const='yes' id='9d0984bf'/>
    <reference-type-def kind='lvalue' type-id='9d0984bf' size-in-bits='32' id='cefbbcdb'/>
    <pointer-type-def type-id='9d0984bf' size-in-bits='32' id='cafbb68f'/>
    <qualified-type-def type-id='1bb55f07' const='yes' id='f7e60357'/>
    <reference-type-def kind='lvalue' type-id='f7e60357' size-in-bits='32' id='b0176ae3'/>
    <pointer-type-def type-id='4aafb922' size-in-bits='32' id='9aa04798'/>
    <reference-type-def kind='lvalue' type-id='452328e6' size-in-bits='32' id='84e43118'/>
    <pointer-type-def type-id='452328e6' size-in-bits='32' id='80e42acc'/>
    <pointer-type-def type-id='5ddaf272' size-in-bits='32' id='606e1a50'/>
    <pointer-type-def type-id='a1aaab37' size-in-bits='32' id='97e1a22f'/>
    <reference-type-def kind='lvalue' type-id='e4c905b6' size-in-bits='32' id='55daf9c8'/>
    <pointer-type-def type-id='e4c905b6' size-in-bits='32' id='51daf37c'/>
    <reference-type-def kind='lvalue' type-id='34e3553c' size-in-bits='32' id='ef24a0d6'/>
    <reference-type-def kind='rvalue' type-id='34e3553c' size-in-bits='32' id='66a959d0'/>
    <pointer-type-def type-id='34e3553c' size-in-bits='32' id='fb24b3ba'/>
    <reference-type-def kind='lvalue' type-id='1bb55f07' size-in-bits='32' id='561154e6'/>
    <namespace-decl name='android'>
      <class-decl name='BpMountService' size-in-bits='224' visibility='default' filepath='frameworks/base/libs/storage/IMountService.cpp' line='55' column='1' id='7807f886'>
        <base-class access='public' layout-offset-in-bits='0' type-id='22d61b29'/>
        <member-function access='public' constructor='yes'>
          <function-decl name='BpMountService' mangled-name='_ZN7android14BpMountServiceC1ERKNS_2spINS_7IBinderEEE' filepath='frameworks/base/libs/storage/IMountService.cpp' line='58' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='83dafb9a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='4'>
          <function-decl name='registerListener' mangled-name='_ZN7android14BpMountService16registerListenerERKNS_2spINS_21IMountServiceListenerEEE' filepath='frameworks/base/libs/storage/IMountService.cpp' line='63' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='7743ab4a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='5'>
          <function-decl name='unregisterListener' mangled-name='_ZN7android14BpMountService18unregisterListenerERKNS_2spINS_21IMountServiceListenerEEE' filepath='frameworks/base/libs/storage/IMountService.cpp' line='79' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='7743ab4a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='6'>
          <function-decl name='isUsbMassStorageConnected' mangled-name='_ZN7android14BpMountService25isUsbMassStorageConnectedEv' filepath='frameworks/base/libs/storage/IMountService.cpp' line='95' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='7'>
          <function-decl name='setUsbMassStorageEnabled' mangled-name='_ZN7android14BpMountService24setUsbMassStorageEnabledEb' filepath='frameworks/base/libs/storage/IMountService.cpp' line='111' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='4ab96a04'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='8'>
          <function-decl name='isUsbMassStorageEnabled' mangled-name='_ZN7android14BpMountService23isUsbMassStorageEnabledEv' filepath='frameworks/base/libs/storage/IMountService.cpp' line='127' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='9'>
          <function-decl name='mountVolume' mangled-name='_ZN7android14BpMountService11mountVolumeERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='143' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='10'>
          <function-decl name='unmountVolume' mangled-name='_ZN7android14BpMountService13unmountVolumeERKNS_8String16Ebb' filepath='frameworks/base/libs/storage/IMountService.cpp' line='160' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='4ab96a04'/>
            <parameter type-id='4ab96a04'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='11'>
          <function-decl name='formatVolume' mangled-name='_ZN7android14BpMountService12formatVolumeERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='179' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='12'>
          <function-decl name='getStorageUsers' mangled-name='_ZN7android14BpMountService15getStorageUsersERKNS_8String16EPPi' filepath='frameworks/base/libs/storage/IMountService.cpp' line='196' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='9aa04798'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='13'>
          <function-decl name='getVolumeState' mangled-name='_ZN7android14BpMountService14getVolumeStateERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='225' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='14'>
          <function-decl name='createSecureContainer' mangled-name='_ZN7android14BpMountService21createSecureContainerERKNS_8String16EiS3_S3_i' filepath='frameworks/base/libs/storage/IMountService.cpp' line='242' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='15'>
          <function-decl name='finalizeSecureContainer' mangled-name='_ZN7android14BpMountService23finalizeSecureContainerERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='264' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='16'>
          <function-decl name='destroySecureContainer' mangled-name='_ZN7android14BpMountService22destroySecureContainerERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='281' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='17'>
          <function-decl name='mountSecureContainer' mangled-name='_ZN7android14BpMountService20mountSecureContainerERKNS_8String16ES3_i' filepath='frameworks/base/libs/storage/IMountService.cpp' line='298' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='18'>
          <function-decl name='unmountSecureContainer' mangled-name='_ZN7android14BpMountService22unmountSecureContainerERKNS_8String16Eb' filepath='frameworks/base/libs/storage/IMountService.cpp' line='319' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='4ab96a04'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='19'>
          <function-decl name='isSecureContainerMounted' mangled-name='_ZN7android14BpMountService24isSecureContainerMountedERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='337' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='20'>
          <function-decl name='renameSecureContainer' mangled-name='_ZN7android14BpMountService21renameSecureContainerERKNS_8String16ES3_' filepath='frameworks/base/libs/storage/IMountService.cpp' line='354' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='21'>
          <function-decl name='getSecureContainerPath' mangled-name='_ZN7android14BpMountService22getSecureContainerPathERKNS_8String16ERS1_' filepath='frameworks/base/libs/storage/IMountService.cpp' line='372' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='22923b4c'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='22'>
          <function-decl name='getSecureContainerList' mangled-name='_ZN7android14BpMountService22getSecureContainerListERKNS_8String16ERPS1_' filepath='frameworks/base/libs/storage/IMountService.cpp' line='390' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='763d7e1a'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='23'>
          <function-decl name='shutdown' mangled-name='_ZN7android14BpMountService8shutdownERKNS_2spINS_22IMountShutdownObserverEEE' filepath='frameworks/base/libs/storage/IMountService.cpp' line='412' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='5f8c324f'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='24'>
          <function-decl name='finishMediaUpdate' mangled-name='_ZN7android14BpMountService17finishMediaUpdateEv' filepath='frameworks/base/libs/storage/IMountService.cpp' line='429' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='25'>
          <function-decl name='mountObb' mangled-name='_ZN7android14BpMountService8mountObbERKNS_8String16ES3_S3_RKNS_2spINS_18IObbActionListenerEEEiRKNS4_INS_7ObbInfoEEE' filepath='frameworks/base/libs/storage/IMountService.cpp' line='445' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='990ef79d'/>
            <parameter type-id='3ff5601b'/>
            <parameter type-id='0c3db078'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='26'>
          <function-decl name='unmountObb' mangled-name='_ZN7android14BpMountService10unmountObbERKNS_8String16EbRKNS_2spINS_18IObbActionListenerEEEi' filepath='frameworks/base/libs/storage/IMountService.cpp' line='467' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='4ab96a04'/>
            <parameter type-id='990ef79d'/>
            <parameter type-id='922df12b'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='27'>
          <function-decl name='isObbMounted' mangled-name='_ZN7android14BpMountService12isObbMountedERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='487' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='28'>
          <function-decl name='getMountedObbPath' mangled-name='_ZN7android14BpMountService17getMountedObbPathERKNS_8String16ERS1_' filepath='frameworks/base/libs/storage/IMountService.cpp' line='504' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='22923b4c'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='29'>
          <function-decl name='decryptStorage' mangled-name='_ZN7android14BpMountService14decryptStorageERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='522' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='30'>
          <function-decl name='encryptStorage' mangled-name='_ZN7android14BpMountService14encryptStorageERKNS_8String16E' filepath='frameworks/base/libs/storage/IMountService.cpp' line='539' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='27ec51bc' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='BpInterface&lt;android::IMountService&gt;' size-in-bits='224' visibility='default' filepath='frameworks/native/libs/binder/include/binder/IInterface.h' line='86' column='1' id='22d61b29'>
        <base-class access='public' layout-offset-in-bits='0' type-id='bf075117'/>
        <base-class access='public' layout-offset-in-bits='32' type-id='df458ae6'/>
        <member-function access='public'>
          <function-decl name='BpInterface' mangled-name='_ZN7android11BpInterfaceINS_13IMountServiceEEC2ERKNS_2spINS_7IBinderEEE' filepath='frameworks/native/libs/binder/include/binder/IInterface.h' line='89' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9892ee61' is-artificial='yes'/>
            <parameter type-id='83dafb9a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='protected' vtable-offset='2'>
          <function-decl name='onAsBinder' mangled-name='_ZN7android11BpInterfaceINS_13IMountServiceEE10onAsBinderEv' filepath='frameworks/native/libs/binder/include/binder/IInterface.h' line='93' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9892ee61' is-artificial='yes'/>
            <return type-id='b5a5bc13'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::IMountServiceListener&gt;' size-in-bits='32' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='31' column='1' id='a2aa88e3'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='d3c9a98f' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='90' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='33' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='beb8baf3' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='41' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='beb8baf3' is-artificial='yes'/>
            <parameter type-id='d3c9a98f'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='42' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='beb8baf3' is-artificial='yes'/>
            <parameter type-id='7743ab4a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='43' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='beb8baf3' is-artificial='yes'/>
            <parameter type-id='11ec3263'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='48' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='beb8baf3' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='sp&lt;android::IMountShutdownObserver&gt;' size-in-bits='32' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='31' column='1' id='3f075162'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='af0cbf96' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='90' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='33' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='40b58a30' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='41' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='40b58a30' is-artificial='yes'/>
            <parameter type-id='af0cbf96'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='42' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='40b58a30' is-artificial='yes'/>
            <parameter type-id='5f8c324f'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='43' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='40b58a30' is-artificial='yes'/>
            <parameter type-id='f3e675b6'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='48' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='40b58a30' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='IMountServiceListener' visibility='default' is-declaration-only='yes' id='748cb1b7'/>
      <class-decl name='IMountShutdownObserver' visibility='default' is-declaration-only='yes' id='60976dc0'/>
    </namespace-decl>
    <namespace-decl name='std'>
      <namespace-decl name='__1'>
        <class-decl name='unique_ptr&lt;android::IMountService, std::__1::default_delete&lt;android::IMountService&gt; &gt;' size-in-bits='32' visibility='default' filepath='external/libcxx/include/memory' line='2401' column='1' id='34e3553c'>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='91be3de9' filepath='external/libcxx/include/memory' line='2405' column='1' id='e9157ebc'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='deleter_type' type-id='e4c905b6' filepath='external/libcxx/include/memory' line='2404' column='1' id='1bb55f07'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='__ptr_' type-id='452328e6' visibility='default' filepath='external/libcxx/include/memory' line='2411' column='1'/>
          </data-member>
          <member-function access='public'>
            <function-decl name='unique_ptr' filepath='external/libcxx/include/memory' line='2494' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='fb24b3ba' is-artificial='yes'/>
              <parameter type-id='66a959d0'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes'>
            <function-decl name='~unique_ptr' mangled-name='_ZNSt3__110unique_ptrIN7android13IMountServiceENS_14default_deleteIS2_EEED2Ev' filepath='external/libcxx/include/memory' line='2606' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='fb24b3ba' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='__compressed_pair&lt;android::IMountService *, std::__1::default_delete&lt;android::IMountService&gt; &gt;' size-in-bits='32' visibility='default' filepath='external/libcxx/include/memory' line='2211' column='1' id='452328e6'>
          <base-class access='private' layout-offset-in-bits='0' type-id='5ddaf272'/>
          <base-class access='private' layout-offset-in-bits='0' type-id='a1aaab37'/>
        </class-decl>
        <class-decl name='__compressed_pair_elem&lt;android::IMountService *, 0, false&gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='2134' column='1' id='5ddaf272'>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='705b9f3b' filepath='external/libcxx/include/memory' line='2136' column='1' id='935477b0'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='ee2819be' filepath='external/libcxx/include/memory' line='2137' column='1' id='552e1b00'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='__value_' type-id='9cb9149f' visibility='default' filepath='external/libcxx/include/memory' line='2168' column='1'/>
          </data-member>
          <member-function access='public'>
            <function-decl name='__compressed_pair_elem' filepath='external/libcxx/include/memory' line='2140' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='606e1a50' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='__compressed_pair_elem&lt;std::__1::default_delete&lt;android::IMountService&gt;, 1, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='2172' column='1' id='a1aaab37'>
          <base-class access='private' layout-offset-in-bits='0' type-id='e4c905b6'/>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='55daf9c8' filepath='external/libcxx/include/memory' line='2174' column='1' id='01ed4df5'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='c873bbbf' filepath='external/libcxx/include/memory' line='2175' column='1' id='71d0c941'/>
          </member-type>
          <member-function access='public'>
            <function-decl name='__compressed_pair_elem' filepath='external/libcxx/include/memory' line='2179' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='97e1a22f' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='default_delete&lt;android::IMountService&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='2320' column='1' id='e4c905b6'>
          <member-function access='public'>
            <function-decl name='default_delete' filepath='external/libcxx/include/memory' line='2324' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='51daf37c' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='add_lvalue_reference&lt;android::IMountService&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/type_traits' line='1127' column='1' id='12435004'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='bb677b9a' filepath='external/libcxx/include/type_traits' line='1128' column='1' id='0f9f0681'/>
          </member-type>
        </class-decl>
        <class-decl name='__add_lvalue_reference_impl&lt;android::IMountService, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/type_traits' line='1125' column='1' id='0503b309'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='a0b91aeb' filepath='external/libcxx/include/type_traits' line='1125' column='1' id='bb677b9a'/>
          </member-type>
        </class-decl>
        <class-decl name='__pointer_type&lt;android::IMountService, std::__1::default_delete&lt;android::IMountService&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='1029' column='1' id='5c33a3c6'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='782ab327' filepath='external/libcxx/include/memory' line='1031' column='1' id='91be3de9'/>
          </member-type>
        </class-decl>
        <namespace-decl name='__pointer_type_imp'>
          <class-decl name='__pointer_type&lt;android::IMountService, std::__1::default_delete&lt;android::IMountService&gt;, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='1021' column='1' id='a5b82b2c'>
            <member-type access='public'>
              <typedef-decl name='type' type-id='9cb9149f' filepath='external/libcxx/include/memory' line='1023' column='1' id='782ab327'/>
            </member-type>
          </class-decl>
        </namespace-decl>
      </namespace-decl>
    </namespace-decl>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='7ff19f0f'/>
    <pointer-type-def type-id='edff7cb3' size-in-bits='32' id='b5a5bc13'/>
    <reference-type-def kind='lvalue' type-id='bf075117' size-in-bits='32' id='a0b91aeb'/>
    <pointer-type-def type-id='bf075117' size-in-bits='32' id='9cb9149f'/>
    <reference-type-def kind='lvalue' type-id='c73fabea' size-in-bits='32' id='22923b4c'/>
    <pointer-type-def type-id='c73fabea' size-in-bits='32' id='26924198'/>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char16_t' size-in-bits='16' id='801a266d'/>
    <namespace-decl name='android'>
      <class-decl name='BpRefBase' visibility='default' is-declaration-only='yes' id='df458ae6'/>
    </namespace-decl>
    <namespace-decl name='android'>
      <class-decl name='IMountService' size-in-bits='96' visibility='default' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='32' column='1' id='bf075117'>
        <base-class access='public' layout-offset-in-bits='0' type-id='40b6343a'/>
        <data-member access='public' static='yes'>
          <var-decl name='descriptor' type-id='a3cec311' visibility='default' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='34' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='default_impl' type-id='34e3553c' visibility='default' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='34' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='IMountService' mangled-name='_ZN7android13IMountServiceC2Ev' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='34' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='IMountService' mangled-name='_ZN7android13IMountServiceC2Ev' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='34' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~IMountService' mangled-name='_ZN7android13IMountServiceD0Ev' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='34' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~IMountService' mangled-name='_ZN7android13IMountServiceD0Ev' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='34' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~IMountService' mangled-name='_ZN7android13IMountServiceD1Ev' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='34' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~IMountService' mangled-name='_ZN7android13IMountServiceD2Ev' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='34' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='3'>
          <function-decl name='getInterfaceDescriptor' mangled-name='_ZNK7android13IMountService22getInterfaceDescriptorEv' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='34' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e4896a10' is-artificial='yes'/>
            <return type-id='157d4f95'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='4'>
          <function-decl name='registerListener' mangled-name='_ZN7android13IMountService16registerListenerERKNS_2spINS_21IMountServiceListenerEEE' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='36' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='7743ab4a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='5'>
          <function-decl name='unregisterListener' mangled-name='_ZN7android13IMountService18unregisterListenerERKNS_2spINS_21IMountServiceListenerEEE' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='38' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='7743ab4a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='6'>
          <function-decl name='isUsbMassStorageConnected' mangled-name='_ZN7android13IMountService25isUsbMassStorageConnectedEv' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='39' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='7'>
          <function-decl name='setUsbMassStorageEnabled' mangled-name='_ZN7android13IMountService24setUsbMassStorageEnabledEb' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='40' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='4ab96a04'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='8'>
          <function-decl name='isUsbMassStorageEnabled' mangled-name='_ZN7android13IMountService23isUsbMassStorageEnabledEv' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='41' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='9'>
          <function-decl name='mountVolume' mangled-name='_ZN7android13IMountService11mountVolumeERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='42' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='10'>
          <function-decl name='unmountVolume' mangled-name='_ZN7android13IMountService13unmountVolumeERKNS_8String16Ebb' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='43' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='4ab96a04'/>
            <parameter type-id='4ab96a04'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='11'>
          <function-decl name='formatVolume' mangled-name='_ZN7android13IMountService12formatVolumeERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='45' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='12'>
          <function-decl name='getStorageUsers' mangled-name='_ZN7android13IMountService15getStorageUsersERKNS_8String16EPPi' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='47' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='9aa04798'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='13'>
          <function-decl name='getVolumeState' mangled-name='_ZN7android13IMountService14getVolumeStateERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='48' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='14'>
          <function-decl name='createSecureContainer' mangled-name='_ZN7android13IMountService21createSecureContainerERKNS_8String16EiS3_S3_i' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='49' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='15'>
          <function-decl name='finalizeSecureContainer' mangled-name='_ZN7android13IMountService23finalizeSecureContainerERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='52' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='16'>
          <function-decl name='destroySecureContainer' mangled-name='_ZN7android13IMountService22destroySecureContainerERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='53' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='17'>
          <function-decl name='mountSecureContainer' mangled-name='_ZN7android13IMountService20mountSecureContainerERKNS_8String16ES3_i' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='54' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='18'>
          <function-decl name='unmountSecureContainer' mangled-name='_ZN7android13IMountService22unmountSecureContainerERKNS_8String16Eb' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='57' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='4ab96a04'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='19'>
          <function-decl name='isSecureContainerMounted' mangled-name='_ZN7android13IMountService24isSecureContainerMountedERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='58' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='20'>
          <function-decl name='renameSecureContainer' mangled-name='_ZN7android13IMountService21renameSecureContainerERKNS_8String16ES3_' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='59' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='21'>
          <function-decl name='getSecureContainerPath' mangled-name='_ZN7android13IMountService22getSecureContainerPathERKNS_8String16ERS1_' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='61' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='22923b4c'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='22'>
          <function-decl name='getSecureContainerList' mangled-name='_ZN7android13IMountService22getSecureContainerListERKNS_8String16ERPS1_' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='62' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='763d7e1a'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='23'>
          <function-decl name='shutdown' mangled-name='_ZN7android13IMountService8shutdownERKNS_2spINS_22IMountShutdownObserverEEE' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='64' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='5f8c324f'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='24'>
          <function-decl name='finishMediaUpdate' mangled-name='_ZN7android13IMountService17finishMediaUpdateEv' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='65' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='25'>
          <function-decl name='mountObb' mangled-name='_ZN7android13IMountService8mountObbERKNS_8String16ES3_S3_RKNS_2spINS_18IObbActionListenerEEEiRKNS4_INS_7ObbInfoEEE' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='66' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='990ef79d'/>
            <parameter type-id='922df12b'/>
            <parameter type-id='0c3db078'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='26'>
          <function-decl name='unmountObb' mangled-name='_ZN7android13IMountService10unmountObbERKNS_8String16EbRKNS_2spINS_18IObbActionListenerEEEi' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='69' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='4ab96a04'/>
            <parameter type-id='990ef79d'/>
            <parameter type-id='922df12b'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='27'>
          <function-decl name='isObbMounted' mangled-name='_ZN7android13IMountService12isObbMountedERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='71' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='28'>
          <function-decl name='getMountedObbPath' mangled-name='_ZN7android13IMountService17getMountedObbPathERKNS_8String16ERS1_' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='72' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='22923b4c'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='29'>
          <function-decl name='decryptStorage' mangled-name='_ZN7android13IMountService14decryptStorageERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='73' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='30'>
          <function-decl name='encryptStorage' mangled-name='_ZN7android13IMountService14encryptStorageERKNS_8String16E' filepath='frameworks/base/libs/storage/include/storage/IMountService.h' line='74' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='9cb9149f' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='3ff5601b'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='android'>
      <class-decl name='String16' size-in-bits='32' visibility='default' filepath='system/core/libutils/include/utils/String16.h' line='39' column='1' id='c73fabea'>
        <member-type access='private'>
          <class-decl name='StaticData&lt;35&gt;' size-in-bits='608' is-struct='yes' visibility='default' filepath='system/core/libutils/include/utils/String16.h' line='154' column='1' id='6807f016'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='size' type-id='b9930aae' visibility='default' filepath='system/core/libutils/include/utils/String16.h' line='158' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='32'>
              <var-decl name='data' type-id='5da7196d' visibility='default' filepath='system/core/libutils/include/utils/String16.h' line='159' column='1'/>
            </data-member>
            <member-function access='public'>
              <function-decl name='StaticData' filepath='system/core/libutils/include/utils/String16.h' line='157' column='1' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='ba5970bc' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='StaticData' filepath='system/core/libutils/include/utils/String16.h' line='161' column='1' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='ba5970bc' is-artificial='yes'/>
                <parameter type-id='fbc5f4a1'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
      </class-decl>
    </namespace-decl>
    <reference-type-def kind='lvalue' type-id='a3cec311' size-in-bits='32' id='157d4f95'/>
    <reference-type-def kind='lvalue' type-id='34433e18' size-in-bits='32' id='83dafb9a'/>
    <reference-type-def kind='lvalue' type-id='0a81a029' size-in-bits='32' id='990ef79d'/>
    <reference-type-def kind='lvalue' type-id='2d59b88e' size-in-bits='32' id='0c3db078'/>
    <qualified-type-def type-id='c894953d' const='yes' id='4ab96a04'/>
    <qualified-type-def type-id='3ff5601b' const='yes' id='922df12b'/>
    <pointer-type-def type-id='3ff5601b' size-in-bits='32' id='4aafb922'/>
    <typedef-decl name='int32_t' type-id='33f57a65' filepath='bionic/libc/include/stdint.h' line='64' column='1' id='3ff5601b'/>
    <type-decl name='void' id='48b5725f'/>
    <namespace-decl name='android'>
      <class-decl name='IBinder' visibility='default' is-declaration-only='yes' id='edff7cb3'/>
    </namespace-decl>
    <namespace-decl name='android'>
      <class-decl name='IInterface' visibility='default' is-declaration-only='yes' id='40b6343a'/>
    </namespace-decl>
    <namespace-decl name='android'>
      <class-decl name='String16' size-in-bits='32' visibility='default' filepath='system/core/libutils/include/utils/String16.h' line='39' column='1' id='c73fabea'>
        <member-type access='private'>
          <class-decl name='StaticData&lt;35&gt;' size-in-bits='608' is-struct='yes' visibility='default' filepath='system/core/libutils/include/utils/String16.h' line='154' column='1' id='6807f016'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='size' type-id='b9930aae' visibility='default' filepath='system/core/libutils/include/utils/String16.h' line='158' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='32'>
              <var-decl name='data' type-id='5da7196d' visibility='default' filepath='system/core/libutils/include/utils/String16.h' line='159' column='1'/>
            </data-member>
            <member-function access='public'>
              <function-decl name='StaticData' filepath='system/core/libutils/include/utils/String16.h' line='157' column='1' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='ba5970bc' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='StaticData' filepath='system/core/libutils/include/utils/String16.h' line='161' column='1' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='ba5970bc' is-artificial='yes'/>
                <parameter type-id='fbc5f4a1'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='StaticData&lt;38&gt;' size-in-bits='640' is-struct='yes' visibility='default' filepath='system/core/libutils/include/utils/String16.h' line='154' column='1' id='6a14bf2f'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='size' type-id='b9930aae' visibility='default' filepath='system/core/libutils/include/utils/String16.h' line='158' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='32'>
              <var-decl name='data' type-id='19b37a54' visibility='default' filepath='system/core/libutils/include/utils/String16.h' line='159' column='1'/>
            </data-member>
            <member-function access='public'>
              <function-decl name='StaticData' filepath='system/core/libutils/include/utils/String16.h' line='157' column='1' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='6ec90c77' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public'>
              <function-decl name='StaticData' filepath='system/core/libutils/include/utils/String16.h' line='161' column='1' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='6ec90c77' is-artificial='yes'/>
                <parameter type-id='a9d924c6'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <data-member access='private' static='yes'>
          <var-decl name='kIsSharedBufferAllocated' type-id='b9930aae' visibility='default' filepath='system/core/libutils/include/utils/String16.h' line='121' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='mString' type-id='161c039a' visibility='default' filepath='system/core/libutils/include/utils/String16.h' line='142' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='String16' filepath='system/core/libutils/include/utils/String16.h' line='42' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26924198' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='String16' filepath='system/core/libutils/include/utils/String16.h' line='43' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26924198' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='String16' filepath='system/core/libutils/include/utils/String16.h' line='44' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26924198' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='b59d7dce'/>
            <parameter type-id='b59d7dce'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='String16' filepath='system/core/libutils/include/utils/String16.h' line='47' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26924198' is-artificial='yes'/>
            <parameter type-id='161c039a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='String16' filepath='system/core/libutils/include/utils/String16.h' line='48' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26924198' is-artificial='yes'/>
            <parameter type-id='161c039a'/>
            <parameter type-id='b59d7dce'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='String16' filepath='system/core/libutils/include/utils/String16.h' line='49' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26924198' is-artificial='yes'/>
            <parameter type-id='a1b8f99c'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='String16' filepath='system/core/libutils/include/utils/String16.h' line='50' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26924198' is-artificial='yes'/>
            <parameter type-id='80f4b756'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='String16' filepath='system/core/libutils/include/utils/String16.h' line='51' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26924198' is-artificial='yes'/>
            <parameter type-id='80f4b756'/>
            <parameter type-id='b59d7dce'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~String16' filepath='system/core/libutils/include/utils/String16.h' line='53' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26924198' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <qualified-type-def type-id='c73fabea' const='yes' id='a3cec311'/>
    <qualified-type-def type-id='bb7689ff' const='yes' id='34433e18'/>
    <qualified-type-def type-id='92343ec8' const='yes' id='0a81a029'/>
    <qualified-type-def type-id='a107f0d1' const='yes' id='2d59b88e'/>
    <qualified-type-def type-id='8f92235e' const='yes' id='b9930aae'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' filepath='bionic/libc/include/stdint.h' line='40' column='1' id='33f57a65'/>
    <pointer-type-def type-id='6a14bf2f' size-in-bits='32' id='6ec90c77'/>
    <array-type-def dimensions='1' type-id='801a266d' size-in-bits='608' id='19b37a54'>
      <subrange length='38' type-id='7ff19f0f' id='aa4ccdac'/>
    </array-type-def>
    <namespace-decl name='android'>
      <class-decl name='sp&lt;android::IBinder&gt;' size-in-bits='32' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='31' column='1' id='bb7689ff'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='b5a5bc13' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='90' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='33' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26839bc7' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' mangled-name='_ZN7android2spINS_7IBinderEEC2EPS1_' filepath='system/core/libutils/include/utils/StrongPointer.h' line='41' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26839bc7' is-artificial='yes'/>
            <parameter type-id='b5a5bc13'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' mangled-name='_ZN7android2spINS_7IBinderEEC2ERKS2_' filepath='system/core/libutils/include/utils/StrongPointer.h' line='42' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26839bc7' is-artificial='yes'/>
            <parameter type-id='83dafb9a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='43' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26839bc7' is-artificial='yes'/>
            <parameter type-id='82104e1f'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' mangled-name='_ZN7android2spINS_7IBinderEED2Ev' filepath='system/core/libutils/include/utils/StrongPointer.h' line='48' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='26839bc7' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='android'>
      <class-decl name='sp&lt;android::IObbActionListener&gt;' size-in-bits='32' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='31' column='1' id='92343ec8'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='c70198d4' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='90' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' mangled-name='_ZN7android2spINS_18IObbActionListenerEEC2Ev' filepath='system/core/libutils/include/utils/StrongPointer.h' line='33' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='7566205e' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='41' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='7566205e' is-artificial='yes'/>
            <parameter type-id='c70198d4'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='42' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='7566205e' is-artificial='yes'/>
            <parameter type-id='990ef79d'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='43' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='7566205e' is-artificial='yes'/>
            <parameter type-id='b7bb3fdc'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' mangled-name='_ZN7android2spINS_18IObbActionListenerEED2Ev' filepath='system/core/libutils/include/utils/StrongPointer.h' line='48' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='7566205e' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp&lt;ObbActionListener&gt;' mangled-name='_ZN7android2spINS_18IObbActionListenerEEC2I17ObbActionListenerEERKNS0_IT_EE' filepath='system/core/libutils/include/utils/StrongPointer.h' line='45' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='7566205e' is-artificial='yes'/>
            <parameter type-id='ad5493d3'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='android'>
      <class-decl name='sp&lt;android::ObbInfo&gt;' size-in-bits='32' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='31' column='1' id='a107f0d1'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='5a61729d' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='90' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='33' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b5cb4749' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' mangled-name='_ZN7android2spINS_7ObbInfoEEC2EPS1_' filepath='system/core/libutils/include/utils/StrongPointer.h' line='41' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b5cb4749' is-artificial='yes'/>
            <parameter type-id='5a61729d'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='42' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b5cb4749' is-artificial='yes'/>
            <parameter type-id='0c3db078'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='43' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b5cb4749' is-artificial='yes'/>
            <parameter type-id='1e1ebf51'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' mangled-name='_ZN7android2spINS_7ObbInfoEED2Ev' filepath='system/core/libutils/include/utils/StrongPointer.h' line='48' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b5cb4749' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <reference-type-def kind='lvalue' type-id='eae5dbc4' size-in-bits='32' id='a9d924c6'/>
    <reference-type-def kind='lvalue' type-id='745c9152' size-in-bits='32' id='a1b8f99c'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='32' id='80f4b756'/>
    <pointer-type-def type-id='e7c31614' size-in-bits='32' id='161c039a'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <typedef-decl name='size_t' type-id='f0981eeb' filepath='prebuilts/clang/host/linux-x86/clang-r383902b/lib64/clang/11.0.2/include/stddef.h' line='46' column='1' id='b59d7dce'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' filepath='bionic/libc/include/stdint.h' line='65' column='1' id='8f92235e'/>
    <pointer-type-def type-id='f7c5ae1e' size-in-bits='32' id='c70198d4'/>
    <pointer-type-def type-id='65c10d3d' size-in-bits='32' id='5a61729d'/>
    <reference-type-def kind='rvalue' type-id='bb7689ff' size-in-bits='32' id='82104e1f'/>
    <pointer-type-def type-id='bb7689ff' size-in-bits='32' id='26839bc7'/>
    <reference-type-def kind='rvalue' type-id='92343ec8' size-in-bits='32' id='b7bb3fdc'/>
    <pointer-type-def type-id='92343ec8' size-in-bits='32' id='7566205e'/>
    <reference-type-def kind='rvalue' type-id='a107f0d1' size-in-bits='32' id='1e1ebf51'/>
    <pointer-type-def type-id='a107f0d1' size-in-bits='32' id='b5cb4749'/>
    <qualified-type-def type-id='6a14bf2f' const='yes' id='eae5dbc4'/>
    <qualified-type-def type-id='bacf3393' const='yes' id='745c9152'/>
    <reference-type-def kind='lvalue' type-id='2d0d8ce7' size-in-bits='32' id='ad5493d3'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <qualified-type-def type-id='801a266d' const='yes' id='e7c31614'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' filepath='bionic/libc/include/stdint.h' line='41' column='1' id='62f1140c'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <namespace-decl name='android'>
      <class-decl name='IObbActionListener' size-in-bits='96' visibility='default' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='27' column='1' id='f7c5ae1e'>
        <base-class access='public' layout-offset-in-bits='0' type-id='40b6343a'/>
        <data-member access='public' static='yes'>
          <var-decl name='descriptor' type-id='a3cec311' visibility='default' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='default_impl' type-id='c722890a' visibility='default' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='IObbActionListener' mangled-name='_ZN7android18IObbActionListenerC2Ev' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c70198d4' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='IObbActionListener' mangled-name='_ZN7android18IObbActionListenerC2Ev' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c70198d4' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~IObbActionListener' mangled-name='_ZN7android18IObbActionListenerD0Ev' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c70198d4' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~IObbActionListener' mangled-name='_ZN7android18IObbActionListenerD0Ev' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c70198d4' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~IObbActionListener' mangled-name='_ZN7android18IObbActionListenerD1Ev' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c70198d4' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~IObbActionListener' mangled-name='_ZN7android18IObbActionListenerD2Ev' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c70198d4' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='3'>
          <function-decl name='getInterfaceDescriptor' mangled-name='_ZNK7android18IObbActionListener22getInterfaceDescriptorEv' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='32d2f295' is-artificial='yes'/>
            <return type-id='157d4f95'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='4'>
          <function-decl name='onObbResult' mangled-name='_ZN7android18IObbActionListener11onObbResultERKNS_8String16Eii' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='32' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='c70198d4' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <parameter type-id='922df12b'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='android'>
      <class-decl name='ObbInfo' size-in-bits='288' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='27' column='1' id='65c10d3d'>
        <base-class access='public' layout-offset-in-bits='0' type-id='f8f7e309'/>
        <base-class access='public' layout-offset-in-bits='96' is-virtual='yes' type-id='12f619c0'/>
        <data-member access='private' layout-offset-in-bits='32'>
          <var-decl name='mFileName' type-id='a3cec311' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='38' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='mPackageName' type-id='a3cec311' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='39' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='96'>
          <var-decl name='mVersion' type-id='3ff5601b' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='40' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='mFlags' type-id='3ff5601b' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='41' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='160'>
          <var-decl name='mSaltSize' type-id='b59d7dce' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='42' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='mSalt' type-id='9f7200cf' visibility='default' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='43' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='ObbInfo' mangled-name='_ZN7android7ObbInfoC1ENS_8String16ES1_iijPKh' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='30' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a61729d' is-artificial='yes'/>
            <parameter type-id='a3cec311'/>
            <parameter type-id='a3cec311'/>
            <parameter type-id='3ff5601b'/>
            <parameter type-id='3ff5601b'/>
            <parameter type-id='b59d7dce'/>
            <parameter type-id='9f7200cf'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~ObbInfo' mangled-name='_ZN7android7ObbInfoD0Ev' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='32' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a61729d' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~ObbInfo' mangled-name='_ZN7android7ObbInfoD0Ev' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='32' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a61729d' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~ObbInfo' mangled-name='_ZN7android7ObbInfoD1Ev' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='32' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a61729d' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~ObbInfo' mangled-name='_ZN7android7ObbInfoD2Ev' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='32' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a61729d' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='2'>
          <function-decl name='writeToParcel' mangled-name='_ZNK7android7ObbInfo13writeToParcelEPNS_6ParcelE' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='34' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='a5f3e61a' is-artificial='yes'/>
            <parameter type-id='1a1ddb91'/>
            <return type-id='6e9756f6'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='3'>
          <function-decl name='readFromParcel' mangled-name='_ZN7android7ObbInfo14readFromParcelEPKNS_6ParcelE' filepath='frameworks/base/libs/storage/include/storage/ObbInfo.h' line='35' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a61729d' is-artificial='yes'/>
            <parameter type-id='79927164'/>
            <return type-id='6e9756f6'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='android'>
      <class-decl name='String8' size-in-bits='32' visibility='default' filepath='system/core/libutils/include/utils/String8.h' line='40' column='1' id='bacf3393'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='mString' type-id='80f4b756' visibility='default' filepath='system/core/libutils/include/utils/String8.h' line='229' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='String8' filepath='system/core/libutils/include/utils/String8.h' line='43' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1ab09733' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='String8' filepath='system/core/libutils/include/utils/String8.h' line='44' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1ab09733' is-artificial='yes'/>
            <parameter type-id='a1b8f99c'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='String8' filepath='system/core/libutils/include/utils/String8.h' line='45' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1ab09733' is-artificial='yes'/>
            <parameter type-id='80f4b756'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='String8' filepath='system/core/libutils/include/utils/String8.h' line='46' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1ab09733' is-artificial='yes'/>
            <parameter type-id='80f4b756'/>
            <parameter type-id='b59d7dce'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='String8' filepath='system/core/libutils/include/utils/String8.h' line='48' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1ab09733' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='String8' filepath='system/core/libutils/include/utils/String8.h' line='49' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1ab09733' is-artificial='yes'/>
            <parameter type-id='161c039a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='String8' filepath='system/core/libutils/include/utils/String8.h' line='50' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1ab09733' is-artificial='yes'/>
            <parameter type-id='161c039a'/>
            <parameter type-id='b59d7dce'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='String8' filepath='system/core/libutils/include/utils/String8.h' line='51' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1ab09733' is-artificial='yes'/>
            <parameter type-id='58d7e108'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='String8' filepath='system/core/libutils/include/utils/String8.h' line='52' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1ab09733' is-artificial='yes'/>
            <parameter type-id='58d7e108'/>
            <parameter type-id='b59d7dce'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~String8' filepath='system/core/libutils/include/utils/String8.h' line='53' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1ab09733' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <qualified-type-def type-id='788ba3f2' const='yes' id='2d0d8ce7'/>
    <pointer-type-def type-id='cb49a619' size-in-bits='32' id='1a1ddb91'/>
    <pointer-type-def type-id='bacf3393' size-in-bits='32' id='1ab09733'/>
    <namespace-decl name='android'>
      <class-decl name='Parcelable' size-in-bits='32' visibility='default' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='35' column='1' id='f8f7e309'>
        <member-function access='public' constructor='yes'>
          <function-decl name='Parcelable' mangled-name='_ZN7android10ParcelableC2Ev' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='39' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='f7891b51' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='Parcelable' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='40' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='f7891b51' is-artificial='yes'/>
            <parameter type-id='769dcc84'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~Parcelable' mangled-name='_ZN7android10ParcelableD0Ev' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='37' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='f7891b51' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='2'>
          <function-decl name='writeToParcel' mangled-name='_ZNK7android10Parcelable13writeToParcelEPNS_6ParcelE' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='47' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='6a9db9a0' is-artificial='yes'/>
            <parameter type-id='1a1ddb91'/>
            <return type-id='6e9756f6'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='3'>
          <function-decl name='readFromParcel' mangled-name='_ZN7android10Parcelable14readFromParcelEPKNS_6ParcelE' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='54' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='f7891b51' is-artificial='yes'/>
            <parameter type-id='79927164'/>
            <return type-id='6e9756f6'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='4'>
          <function-decl name='isStable' mangled-name='_ZNK7android10Parcelable8isStableEv' filepath='frameworks/native/libs/binder/include/binder/Parcelable.h' line='60' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='6a9db9a0' is-artificial='yes'/>
            <return type-id='c894953d'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='android'>
      <class-decl name='RefBase' visibility='default' is-declaration-only='yes' id='12f619c0'>
        <member-type access='private'>
          <class-decl name='weakref_type' size-in-bits='8' visibility='default' filepath='system/core/libutils/include/utils/RefBase.h' line='254' column='1' id='114d3ce2'/>
        </member-type>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='android'>
      <class-decl name='sp&lt;ObbActionListener&gt;' size-in-bits='32' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='31' column='1' id='788ba3f2'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='7376f3a6' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='90' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' mangled-name='_ZN7android2spI17ObbActionListenerEC2Ev' filepath='system/core/libutils/include/utils/StrongPointer.h' line='33' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='37fc04a0' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='41' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='37fc04a0' is-artificial='yes'/>
            <parameter type-id='7376f3a6'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='42' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='37fc04a0' is-artificial='yes'/>
            <parameter type-id='ad5493d3'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='43' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='37fc04a0' is-artificial='yes'/>
            <parameter type-id='a7d93406'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' mangled-name='_ZN7android2spI17ObbActionListenerED2Ev' filepath='system/core/libutils/include/utils/StrongPointer.h' line='48' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='37fc04a0' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='std'>
      <namespace-decl name='__1'>
        <class-decl name='unique_ptr&lt;android::IObbActionListener, std::__1::default_delete&lt;android::IObbActionListener&gt; &gt;' size-in-bits='32' visibility='default' filepath='external/libcxx/include/memory' line='2401' column='1' id='c722890a'>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='3ac420f3' filepath='external/libcxx/include/memory' line='2405' column='1' id='670db6be'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='deleter_type' type-id='0de0b2fb' filepath='external/libcxx/include/memory' line='2404' column='1' id='4337a511'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='__ptr_' type-id='9a8c82c0' visibility='default' filepath='external/libcxx/include/memory' line='2411' column='1'/>
          </data-member>
          <member-function access='public'>
            <function-decl name='unique_ptr' filepath='external/libcxx/include/memory' line='2494' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='d3ba3bb8' is-artificial='yes'/>
              <parameter type-id='4c21e37e'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes'>
            <function-decl name='~unique_ptr' mangled-name='_ZNSt3__110unique_ptrIN7android18IObbActionListenerENS_14default_deleteIS2_EEED2Ev' filepath='external/libcxx/include/memory' line='2606' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='d3ba3bb8' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
      </namespace-decl>
    </namespace-decl>
    <pointer-type-def type-id='79f4741d' size-in-bits='32' id='32d2f295'/>
    <pointer-type-def type-id='dda33994' size-in-bits='32' id='a5f3e61a'/>
    <pointer-type-def type-id='4eb937a6' size-in-bits='32' id='79927164'/>
    <pointer-type-def type-id='eb5b5ff2' size-in-bits='32' id='58d7e108'/>
    <pointer-type-def type-id='2b61797f' size-in-bits='32' id='9f7200cf'/>
    <namespace-decl name='android'>
      <typedef-decl name='status_t' type-id='3ff5601b' filepath='system/core/libutils/include/utils/Errors.h' line='30' column='1' id='6e9756f6'/>
    </namespace-decl>
    <pointer-type-def type-id='38e516d0' size-in-bits='32' id='7376f3a6'/>
    <pointer-type-def type-id='f8f7e309' size-in-bits='32' id='f7891b51'/>
    <reference-type-def kind='rvalue' type-id='788ba3f2' size-in-bits='32' id='a7d93406'/>
    <pointer-type-def type-id='788ba3f2' size-in-bits='32' id='37fc04a0'/>
    <namespace-decl name='android'>
      <class-decl name='Parcel' size-in-bits='480' visibility='default' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='55' column='1' id='cb49a619'>
        <member-type access='private'>
          <typedef-decl name='release_func' type-id='edf1b28e' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='482' column='1' id='154ab60a'/>
        </member-type>
        <member-type access='private'>
          <class-decl name='WritableBlob' visibility='default' is-declaration-only='yes' id='259563fa'/>
        </member-type>
        <member-type access='private'>
          <class-decl name='ReadableBlob' visibility='default' is-declaration-only='yes' id='a87dbeee'/>
        </member-type>
        <member-type access='private'>
          <class-decl name='FlattenableHelperInterface' visibility='default' is-declaration-only='yes' id='783cc678'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='mError' type-id='6e9756f6' visibility='default' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='582' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='32'>
          <var-decl name='mData' type-id='ae3e8ca6' visibility='default' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='583' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='mDataSize' type-id='b59d7dce' visibility='default' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='584' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='96'>
          <var-decl name='mDataCapacity' type-id='b59d7dce' visibility='default' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='585' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='mDataPos' type-id='b59d7dce' visibility='default' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='586' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='160'>
          <var-decl name='mObjects' type-id='ed491f06' visibility='default' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='587' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='mObjectsSize' type-id='b59d7dce' visibility='default' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='588' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='224'>
          <var-decl name='mObjectsCapacity' type-id='b59d7dce' visibility='default' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='589' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='256'>
          <var-decl name='mNextObjectHint' type-id='b59d7dce' visibility='default' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='590' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='288'>
          <var-decl name='mObjectsSorted' type-id='c894953d' visibility='default' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='591' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='296'>
          <var-decl name='mRequestHeaderPresent' type-id='c894953d' visibility='default' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='593' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='320'>
          <var-decl name='mWorkSourceRequestHeaderPosition' type-id='b59d7dce' visibility='default' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='594' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='352'>
          <var-decl name='mFdsKnown' type-id='c894953d' visibility='default' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='596' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='360'>
          <var-decl name='mHasFds' type-id='c894953d' visibility='default' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='597' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='368'>
          <var-decl name='mAllowFds' type-id='c894953d' visibility='default' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='598' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='384'>
          <var-decl name='mOwner' type-id='154ab60a' visibility='default' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='600' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='416'>
          <var-decl name='mOwnerCookie' type-id='eaa32e2f' visibility='default' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='601' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='448'>
          <var-decl name='mOpenAshmemSize' type-id='b59d7dce' visibility='default' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='687' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='Parcel' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='61' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1a1ddb91' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~Parcel' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='62' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1a1ddb91' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='Parcel' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='499' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='1a1ddb91' is-artificial='yes'/>
            <parameter type-id='6d925e80'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='std'>
      <namespace-decl name='__1'>
        <class-decl name='__compressed_pair&lt;android::IObbActionListener *, std::__1::default_delete&lt;android::IObbActionListener&gt; &gt;' size-in-bits='32' visibility='default' filepath='external/libcxx/include/memory' line='2211' column='1' id='9a8c82c0'>
          <base-class access='private' layout-offset-in-bits='0' type-id='15f35f71'/>
          <base-class access='private' layout-offset-in-bits='0' type-id='17e76a52'/>
        </class-decl>
      </namespace-decl>
    </namespace-decl>
    <namespace-decl name='std'>
      <namespace-decl name='__1'>
        <class-decl name='default_delete&lt;android::IObbActionListener&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='2320' column='1' id='0de0b2fb'>
          <member-function access='public'>
            <function-decl name='default_delete' filepath='external/libcxx/include/memory' line='2324' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='b83a824b' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
      </namespace-decl>
    </namespace-decl>
    <qualified-type-def type-id='f7c5ae1e' const='yes' id='79f4741d'/>
    <qualified-type-def type-id='65c10d3d' const='yes' id='dda33994'/>
    <qualified-type-def type-id='cb49a619' const='yes' id='4eb937a6'/>
    <reference-type-def kind='lvalue' type-id='b04de3ca' size-in-bits='32' id='769dcc84'/>
    <pointer-type-def type-id='b04de3ca' size-in-bits='32' id='6a9db9a0'/>
    <qualified-type-def type-id='a846fc93' const='yes' id='eb5b5ff2'/>
    <qualified-type-def type-id='b96825af' const='yes' id='2b61797f'/>
    <reference-type-def kind='rvalue' type-id='c722890a' size-in-bits='32' id='4c21e37e'/>
    <pointer-type-def type-id='c722890a' size-in-bits='32' id='d3ba3bb8'/>
    <namespace-decl name='std'>
      <namespace-decl name='__1'>
        <class-decl name='__pointer_type&lt;android::IObbActionListener, std::__1::default_delete&lt;android::IObbActionListener&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='1029' column='1' id='4ef6f3a4'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='1e232805' filepath='external/libcxx/include/memory' line='1031' column='1' id='3ac420f3'/>
          </member-type>
        </class-decl>
      </namespace-decl>
    </namespace-decl>
    <pointer-type-def type-id='9af0438f' size-in-bits='32' id='ed491f06'/>
    <type-decl name='char32_t' size-in-bits='32' id='a846fc93'/>
    <class-decl name='ObbActionListener' size-in-bits='224' is-struct='yes' visibility='default' filepath='frameworks/base/native/android/storage_manager.cpp' line='36' column='1' id='38e516d0'>
      <base-class access='public' layout-offset-in-bits='0' type-id='b4c0d64f'/>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='mStorageManager' type-id='4c8890e6' visibility='default' filepath='frameworks/base/native/android/storage_manager.cpp' line='38' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='ObbActionListener' mangled-name='_ZN17ObbActionListenerC1EP15AStorageManager' filepath='frameworks/base/native/android/storage_manager.cpp' line='41' column='1' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='7376f3a6' is-artificial='yes'/>
          <parameter type-id='df7f8372'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='4'>
        <function-decl name='onObbResult' mangled-name='_ZN17ObbActionListener11onObbResultERKN7android8String16Eii' filepath='frameworks/base/native/android/storage_manager.cpp' line='45' column='1' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='7376f3a6' is-artificial='yes'/>
          <parameter type-id='157d4f95'/>
          <parameter type-id='922df12b'/>
          <parameter type-id='922df12b'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <namespace-decl name='std'>
      <namespace-decl name='__1'>
        <class-decl name='__compressed_pair_elem&lt;android::IObbActionListener *, 0, false&gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='2134' column='1' id='15f35f71'>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='3983c4f6' filepath='external/libcxx/include/memory' line='2136' column='1' id='43aaeec3'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='c165233b' filepath='external/libcxx/include/memory' line='2137' column='1' id='6df490d3'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='__value_' type-id='c70198d4' visibility='default' filepath='external/libcxx/include/memory' line='2168' column='1'/>
          </data-member>
          <member-function access='public'>
            <function-decl name='__compressed_pair_elem' filepath='external/libcxx/include/memory' line='2140' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='10cb6749' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
      </namespace-decl>
    </namespace-decl>
    <namespace-decl name='std'>
      <namespace-decl name='__1'>
        <class-decl name='__compressed_pair_elem&lt;std::__1::default_delete&lt;android::IObbActionListener&gt;, 1, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='2172' column='1' id='17e76a52'>
          <base-class access='private' layout-offset-in-bits='0' type-id='0de0b2fb'/>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='b43a7bff' filepath='external/libcxx/include/memory' line='2174' column='1' id='f7172ed8'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='6f047a5a' filepath='external/libcxx/include/memory' line='2175' column='1' id='d750daf8'/>
          </member-type>
          <member-function access='public'>
            <function-decl name='__compressed_pair_elem' filepath='external/libcxx/include/memory' line='2179' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='1e283db0' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
      </namespace-decl>
    </namespace-decl>
    <reference-type-def kind='lvalue' type-id='4eb937a6' size-in-bits='32' id='6d925e80'/>
    <qualified-type-def type-id='f8f7e309' const='yes' id='b04de3ca'/>
    <pointer-type-def type-id='0de0b2fb' size-in-bits='32' id='b83a824b'/>
    <namespace-decl name='std'>
      <namespace-decl name='__1'>
        <namespace-decl name='__pointer_type_imp'>
          <class-decl name='__pointer_type&lt;android::IObbActionListener, std::__1::default_delete&lt;android::IObbActionListener&gt;, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='1021' column='1' id='123fea2e'>
            <member-type access='public'>
              <typedef-decl name='type' type-id='c70198d4' filepath='external/libcxx/include/memory' line='1023' column='1' id='1e232805'/>
            </member-type>
          </class-decl>
        </namespace-decl>
      </namespace-decl>
    </namespace-decl>
    <typedef-decl name='uint8_t' type-id='c51d6389' filepath='bionic/libc/include/stdint.h' line='59' column='1' id='b96825af'/>
    <pointer-type-def type-id='b96825af' size-in-bits='32' id='ae3e8ca6'/>
    <pointer-type-def type-id='f1e1c37c' size-in-bits='32' id='edf1b28e'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='32' id='eaa32e2f'/>
    <pointer-type-def type-id='6fc023b3' size-in-bits='32' id='df7f8372'/>
    <reference-type-def kind='lvalue' type-id='a48c009f' size-in-bits='32' id='c165233b'/>
    <reference-type-def kind='lvalue' type-id='c70198d4' size-in-bits='32' id='3983c4f6'/>
    <namespace-decl name='android'>
      <class-decl name='BnObbActionListener' size-in-bits='192' visibility='default' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='37' column='1' id='b4c0d64f'>
        <base-class access='public' layout-offset-in-bits='0' type-id='2144ef38'/>
        <member-function access='public' vtable-offset='6'>
          <function-decl name='onTransact' mangled-name='_ZN7android19BnObbActionListener10onTransactEjRKNS_6ParcelEPS1_j' filepath='frameworks/base/libs/storage/include/storage/IObbActionListener.h' line='40' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='36e31287' is-artificial='yes'/>
            <parameter type-id='8f92235e'/>
            <parameter type-id='6d925e80'/>
            <parameter type-id='1a1ddb91'/>
            <parameter type-id='8f92235e'/>
            <return type-id='6e9756f6'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='android'>
      <class-decl name='sp&lt;AStorageManager&gt;' size-in-bits='32' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='31' column='1' id='4c8890e6'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='df7f8372' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='90' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='33' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b795223c' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' mangled-name='_ZN7android2spI15AStorageManagerEC2EPS1_' filepath='system/core/libutils/include/utils/StrongPointer.h' line='41' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b795223c' is-artificial='yes'/>
            <parameter type-id='df7f8372'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='42' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b795223c' is-artificial='yes'/>
            <parameter type-id='35bbd563'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='43' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b795223c' is-artificial='yes'/>
            <parameter type-id='f9cf09ea'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' mangled-name='_ZN7android2spI15AStorageManagerED2Ev' filepath='system/core/libutils/include/utils/StrongPointer.h' line='48' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='b795223c' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <reference-type-def kind='lvalue' type-id='990dfc58' size-in-bits='32' id='6f047a5a'/>
    <pointer-type-def type-id='15f35f71' size-in-bits='32' id='10cb6749'/>
    <pointer-type-def type-id='17e76a52' size-in-bits='32' id='1e283db0'/>
    <reference-type-def kind='lvalue' type-id='0de0b2fb' size-in-bits='32' id='b43a7bff'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' filepath='bionic/libc/include/stdint.h' line='37' column='1' id='c51d6389'/>
    <typedef-decl name='binder_size_t' type-id='3a47d82b' filepath='frameworks/native/libs/binder/include/binder/Parcel.h' line='39' column='1' id='9af0438f'/>
    <pointer-type-def type-id='b4c0d64f' size-in-bits='32' id='36e31287'/>
    <qualified-type-def type-id='c70198d4' const='yes' id='a48c009f'/>
    <reference-type-def kind='rvalue' type-id='4c8890e6' size-in-bits='32' id='f9cf09ea'/>
    <pointer-type-def type-id='4c8890e6' size-in-bits='32' id='b795223c'/>
    <namespace-decl name='android'>
      <class-decl name='BnInterface&lt;android::IObbActionListener&gt;' size-in-bits='192' visibility='default' filepath='frameworks/native/libs/binder/include/binder/IInterface.h' line='72' column='1' id='2144ef38'>
        <base-class access='public' layout-offset-in-bits='0' type-id='f7c5ae1e'/>
        <base-class access='public' layout-offset-in-bits='32' type-id='a4d376c6'/>
        <member-function access='protected' vtable-offset='2'>
          <function-decl name='onAsBinder' mangled-name='_ZN7android11BnInterfaceINS_18IObbActionListenerEE10onAsBinderEv' filepath='frameworks/native/libs/binder/include/binder/IInterface.h' line='80' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='3ab04eee' is-artificial='yes'/>
            <return type-id='b5a5bc13'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='3'>
          <function-decl name='getInterfaceDescriptor' mangled-name='_ZNK7android11BnInterfaceINS_18IObbActionListenerEE22getInterfaceDescriptorEv' filepath='frameworks/native/libs/binder/include/binder/IInterface.h' line='76' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='eac80e0f' is-artificial='yes'/>
            <return type-id='157d4f95'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='5'>
          <function-decl name='queryLocalInterface' mangled-name='_ZN7android11BnInterfaceINS_18IObbActionListenerEE19queryLocalInterfaceERKNS_8String16E' filepath='frameworks/native/libs/binder/include/binder/IInterface.h' line='75' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='3ab04eee' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <return type-id='12dbd264'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <reference-type-def kind='lvalue' type-id='f4bc7ed7' size-in-bits='32' id='35bbd563'/>
    <qualified-type-def type-id='0de0b2fb' const='yes' id='990dfc58'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='3a47d82b'/>
    <typedef-decl name='AStorageManager' type-id='56516754' filepath='frameworks/native/include/android/storage_manager.h' line='40' column='1' id='6fc023b3'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <pointer-type-def type-id='2144ef38' size-in-bits='32' id='3ab04eee'/>
    <class-decl name='AStorageManager' size-in-bits='352' is-struct='yes' visibility='default' filepath='frameworks/base/native/android/storage_manager.cpp' line='62' column='1' id='56516754'>
      <base-class access='public' layout-offset-in-bits='0' type-id='12f619c0'/>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='mCallbackLock' type-id='406f4753' visibility='default' filepath='frameworks/base/native/android/storage_manager.cpp' line='64' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='96'>
        <var-decl name='mCallbacks' type-id='3847ab67' visibility='default' filepath='frameworks/base/native/android/storage_manager.cpp' line='65' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='256'>
        <var-decl name='mNextNonce' type-id='fda05812' visibility='default' filepath='frameworks/base/native/android/storage_manager.cpp' line='66' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='288'>
        <var-decl name='mObbActionListener' type-id='788ba3f2' visibility='default' filepath='frameworks/base/native/android/storage_manager.cpp' line='67' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='320'>
        <var-decl name='mMountService' type-id='f331f373' visibility='default' filepath='frameworks/base/native/android/storage_manager.cpp' line='68' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='AStorageManager' mangled-name='_ZN15AStorageManagerC2Ev' filepath='frameworks/base/native/android/storage_manager.cpp' line='98' column='1' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='df7f8372' is-artificial='yes'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <namespace-decl name='android'>
      <class-decl name='BBinder' visibility='default' is-declaration-only='yes' id='a4d376c6'/>
    </namespace-decl>
    <namespace-decl name='android'>
      <class-decl name='sp&lt;android::IInterface&gt;' size-in-bits='32' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='31' column='1' id='12dbd264'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='6d5a3b78' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='90' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='33' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='eed59172' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' mangled-name='_ZN7android2spINS_10IInterfaceEEC2EPS1_' filepath='system/core/libutils/include/utils/StrongPointer.h' line='41' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='eed59172' is-artificial='yes'/>
            <parameter type-id='6d5a3b78'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='42' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='eed59172' is-artificial='yes'/>
            <parameter type-id='c0f30c7d'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='43' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='eed59172' is-artificial='yes'/>
            <parameter type-id='de3da448'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' mangled-name='_ZN7android2spINS_10IInterfaceEED2Ev' filepath='system/core/libutils/include/utils/StrongPointer.h' line='48' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='eed59172' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp&lt;android::BnInterface&lt;android::IObbActionListener&gt; &gt;' mangled-name='_ZN7android2spINS_10IInterfaceEEC2INS_11BnInterfaceINS_18IObbActionListenerEEEEEPT_' filepath='system/core/libutils/include/utils/StrongPointer.h' line='44' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='eed59172' is-artificial='yes'/>
            <parameter type-id='3ab04eee'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp&lt;android::IMountServiceListener&gt;' mangled-name='_ZN7android2spINS_10IInterfaceEEC2INS_21IMountServiceListenerEEERKNS0_IT_EE' filepath='system/core/libutils/include/utils/StrongPointer.h' line='45' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='eed59172' is-artificial='yes'/>
            <parameter type-id='7743ab4a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp&lt;android::IMountShutdownObserver&gt;' mangled-name='_ZN7android2spINS_10IInterfaceEEC2INS_22IMountShutdownObserverEEERKNS0_IT_EE' filepath='system/core/libutils/include/utils/StrongPointer.h' line='45' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='eed59172' is-artificial='yes'/>
            <parameter type-id='5f8c324f'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp&lt;android::IObbActionListener&gt;' mangled-name='_ZN7android2spINS_10IInterfaceEEC2INS_18IObbActionListenerEEERKNS0_IT_EE' filepath='system/core/libutils/include/utils/StrongPointer.h' line='45' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='eed59172' is-artificial='yes'/>
            <parameter type-id='990ef79d'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <pointer-type-def type-id='f7007f3f' size-in-bits='32' id='eac80e0f'/>
    <qualified-type-def type-id='4c8890e6' const='yes' id='f4bc7ed7'/>
    <pointer-type-def type-id='40b6343a' size-in-bits='32' id='6d5a3b78'/>
    <reference-type-def kind='rvalue' type-id='12dbd264' size-in-bits='32' id='de3da448'/>
    <pointer-type-def type-id='12dbd264' size-in-bits='32' id='eed59172'/>
    <namespace-decl name='android'>
      <class-decl name='Mutex' size-in-bits='32' visibility='default' filepath='system/core/libutils/include/utils/Mutex.h' line='94' column='1' id='406f4753'>
        <member-type access='private'>
          <class-decl name='Autolock' size-in-bits='32' visibility='default' filepath='system/core/libutils/include/utils/Mutex.h' line='130' column='1' id='fd376fcf'>
            <data-member access='private' layout-offset-in-bits='0'>
              <var-decl name='mLock' type-id='665e3247' visibility='default' filepath='system/core/libutils/include/utils/Mutex.h' line='137' column='1'/>
            </data-member>
            <member-function access='public' constructor='yes'>
              <function-decl name='Autolock' mangled-name='_ZN7android5Mutex8AutolockC2ERS0_' filepath='system/core/libutils/include/utils/Mutex.h' line='132' column='1' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='40a3d947' is-artificial='yes'/>
                <parameter type-id='665e3247'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' constructor='yes'>
              <function-decl name='Autolock' filepath='system/core/libutils/include/utils/Mutex.h' line='133' column='1' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='40a3d947' is-artificial='yes'/>
                <parameter type-id='5a5e1f63'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='public' destructor='yes'>
              <function-decl name='~Autolock' mangled-name='_ZN7android5Mutex8AutolockD2Ev' filepath='system/core/libutils/include/utils/Mutex.h' line='134' column='1' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='40a3d947' is-artificial='yes'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
            <member-function access='private' constructor='yes'>
              <function-decl name='Autolock' filepath='system/core/libutils/include/utils/Mutex.h' line='139' column='1' visibility='default' binding='global' size-in-bits='32'>
                <parameter type-id='40a3d947' is-artificial='yes'/>
                <parameter type-id='e38b5b64'/>
                <return type-id='48b5725f'/>
              </function-decl>
            </member-function>
          </class-decl>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='mMutex' type-id='7a6844eb' visibility='default' filepath='system/core/libutils/include/utils/Mutex.h' line='151' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='Mutex' mangled-name='_ZN7android5MutexC2Ev' filepath='system/core/libutils/include/utils/Mutex.h' line='101' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='Mutex' filepath='system/core/libutils/include/utils/Mutex.h' line='102' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <parameter type-id='80f4b756'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='Mutex' filepath='system/core/libutils/include/utils/Mutex.h' line='103' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <parameter type-id='95e97e5e'/>
            <parameter type-id='80f4b756'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~Mutex' mangled-name='_ZN7android5MutexD2Ev' filepath='system/core/libutils/include/utils/Mutex.h' line='104' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='Mutex' filepath='system/core/libutils/include/utils/Mutex.h' line='147' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='5a5e1f63' is-artificial='yes'/>
            <parameter type-id='43c128f8'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='android'>
      <class-decl name='Vector&lt;ObbCallback *&gt;' size-in-bits='160' visibility='default' filepath='system/core/libutils/include/utils/Vector.h' line='57' column='1' id='3847ab67'>
        <base-class access='private' layout-offset-in-bits='0' type-id='86634f01'/>
        <member-type access='private'>
          <typedef-decl name='compar_t' type-id='cb44d457' filepath='system/core/libutils/include/utils/Vector.h' line='185' column='1' id='2dd55475'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='compar_r_t' type-id='2841c17b' filepath='system/core/libutils/include/utils/Vector.h' line='186' column='1' id='071d6ee0'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='iterator' type-id='83445a85' filepath='system/core/libutils/include/utils/Vector.h' line='199' column='1' id='764c9ed0'/>
        </member-type>
        <member-type access='private'>
          <typedef-decl name='const_iterator' type-id='b5e7b678' filepath='system/core/libutils/include/utils/Vector.h' line='200' column='1' id='0dc1dca0'/>
        </member-type>
        <member-function access='public'>
          <function-decl name='Vector' mangled-name='_ZN7android6VectorIP11ObbCallbackEC2Ev' filepath='system/core/libutils/include/utils/Vector.h' line='66' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='3b89821f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='Vector' filepath='system/core/libutils/include/utils/Vector.h' line='67' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='3b89821f' is-artificial='yes'/>
            <parameter type-id='d649c690'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='Vector' filepath='system/core/libutils/include/utils/Vector.h' line='68' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='3b89821f' is-artificial='yes'/>
            <parameter type-id='2965d00d'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~Vector' mangled-name='_ZN7android6VectorIP11ObbCallbackED0Ev' filepath='system/core/libutils/include/utils/Vector.h' line='69' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='3b89821f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes' vtable-offset='0'>
          <function-decl name='~Vector' mangled-name='_ZN7android6VectorIP11ObbCallbackED2Ev' filepath='system/core/libutils/include/utils/Vector.h' line='69' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='3b89821f' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='protected' vtable-offset='2'>
          <function-decl name='do_construct' mangled-name='_ZNK7android6VectorIP11ObbCallbackE12do_constructEPvj' filepath='system/core/libutils/include/utils/Vector.h' line='216' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e249d974' is-artificial='yes'/>
            <parameter type-id='eaa32e2f'/>
            <parameter type-id='b59d7dce'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='protected' vtable-offset='3'>
          <function-decl name='do_destroy' mangled-name='_ZNK7android6VectorIP11ObbCallbackE10do_destroyEPvj' filepath='system/core/libutils/include/utils/Vector.h' line='217' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e249d974' is-artificial='yes'/>
            <parameter type-id='eaa32e2f'/>
            <parameter type-id='b59d7dce'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='protected' vtable-offset='4'>
          <function-decl name='do_copy' mangled-name='_ZNK7android6VectorIP11ObbCallbackE7do_copyEPvPKvj' filepath='system/core/libutils/include/utils/Vector.h' line='218' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e249d974' is-artificial='yes'/>
            <parameter type-id='eaa32e2f'/>
            <parameter type-id='eaa32e2f'/>
            <parameter type-id='b59d7dce'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='protected' vtable-offset='5'>
          <function-decl name='do_splat' mangled-name='_ZNK7android6VectorIP11ObbCallbackE8do_splatEPvPKvj' filepath='system/core/libutils/include/utils/Vector.h' line='219' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e249d974' is-artificial='yes'/>
            <parameter type-id='eaa32e2f'/>
            <parameter type-id='eaa32e2f'/>
            <parameter type-id='b59d7dce'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='protected' vtable-offset='6'>
          <function-decl name='do_move_forward' mangled-name='_ZNK7android6VectorIP11ObbCallbackE15do_move_forwardEPvPKvj' filepath='system/core/libutils/include/utils/Vector.h' line='220' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e249d974' is-artificial='yes'/>
            <parameter type-id='eaa32e2f'/>
            <parameter type-id='eaa32e2f'/>
            <parameter type-id='b59d7dce'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='protected' vtable-offset='7'>
          <function-decl name='do_move_backward' mangled-name='_ZNK7android6VectorIP11ObbCallbackE16do_move_backwardEPvPKvj' filepath='system/core/libutils/include/utils/Vector.h' line='221' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e249d974' is-artificial='yes'/>
            <parameter type-id='eaa32e2f'/>
            <parameter type-id='eaa32e2f'/>
            <parameter type-id='b59d7dce'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='android'>
      <class-decl name='sp&lt;android::IMountService&gt;' size-in-bits='32' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='31' column='1' id='f331f373'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='m_ptr' type-id='9cb9149f' visibility='default' filepath='system/core/libutils/include/utils/StrongPointer.h' line='90' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='sp' mangled-name='_ZN7android2spINS_13IMountServiceEEC2Ev' filepath='system/core/libutils/include/utils/StrongPointer.h' line='33' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='de638c93' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='41' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='de638c93' is-artificial='yes'/>
            <parameter type-id='9cb9149f'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='42' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='de638c93' is-artificial='yes'/>
            <parameter type-id='6100d52e'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public'>
          <function-decl name='sp' filepath='system/core/libutils/include/utils/StrongPointer.h' line='43' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='de638c93' is-artificial='yes'/>
            <parameter type-id='4bd3cc83'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~sp' mangled-name='_ZN7android2spINS_13IMountServiceEED2Ev' filepath='system/core/libutils/include/utils/StrongPointer.h' line='48' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='de638c93' is-artificial='yes'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <qualified-type-def type-id='2144ef38' const='yes' id='f7007f3f'/>
    <reference-type-def kind='lvalue' type-id='dfa5c389' size-in-bits='32' id='c0f30c7d'/>
    <qualified-type-def type-id='3ff5601b' volatile='yes' id='fda05812'/>
    <pointer-type-def type-id='b8e35a82' size-in-bits='32' id='b5e7b678'/>
    <pointer-type-def type-id='547a22ad' size-in-bits='32' id='83445a85'/>
    <reference-type-def kind='lvalue' type-id='406f4753' size-in-bits='32' id='665e3247'/>
    <pointer-type-def type-id='406f4753' size-in-bits='32' id='5a5e1f63'/>
    <pointer-type-def type-id='fd376fcf' size-in-bits='32' id='40a3d947'/>
    <pointer-type-def type-id='3847ab67' size-in-bits='32' id='3b89821f'/>
    <reference-type-def kind='rvalue' type-id='f331f373' size-in-bits='32' id='4bd3cc83'/>
    <pointer-type-def type-id='f331f373' size-in-bits='32' id='de638c93'/>
    <namespace-decl name='android'>
      <class-decl name='VectorImpl' visibility='default' is-declaration-only='yes' id='86634f01'>
        <member-type access='private'>
          <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='system/core/libutils/include/utils/VectorImpl.h' line='43' column='1' id='b6969489'>
            <underlying-type type-id='9cac1fee'/>
            <enumerator name='HAS_TRIVIAL_CTOR' value='1'/>
            <enumerator name='HAS_TRIVIAL_DTOR' value='2'/>
            <enumerator name='HAS_TRIVIAL_COPY' value='4'/>
          </enum-decl>
        </member-type>
      </class-decl>
    </namespace-decl>
    <reference-type-def kind='lvalue' type-id='a3f5ae0e' size-in-bits='32' id='43c128f8'/>
    <reference-type-def kind='lvalue' type-id='2e96e5aa' size-in-bits='32' id='e38b5b64'/>
    <reference-type-def kind='lvalue' type-id='94d46bf9' size-in-bits='32' id='2965d00d'/>
    <reference-type-def kind='lvalue' type-id='27297916' size-in-bits='32' id='d649c690'/>
    <pointer-type-def type-id='27297916' size-in-bits='32' id='e249d974'/>
    <qualified-type-def type-id='12dbd264' const='yes' id='dfa5c389'/>
    <reference-type-def kind='lvalue' type-id='62294afc' size-in-bits='32' id='6100d52e'/>
    <pointer-type-def type-id='735b63b3' size-in-bits='32' id='cb44d457'/>
    <pointer-type-def type-id='32a29f07' size-in-bits='32' id='2841c17b'/>
    <typedef-decl name='pthread_mutex_t' type-id='cc3d65c7' filepath='bionic/libc/include/bits/pthread_types.h' line='78' column='1' id='7a6844eb'/>
    <pointer-type-def type-id='f0b1600d' size-in-bits='32' id='547a22ad'/>
    <qualified-type-def type-id='547a22ad' const='yes' id='b8e35a82'/>
    <class-decl name='__anonymous_struct__4' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='7a6844eb' visibility='default' filepath='bionic/libc/include/bits/pthread_types.h' line='72' column='1' id='cc3d65c7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__private' type-id='e4652d73' visibility='default' filepath='bionic/libc/include/bits/pthread_types.h' line='76' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='406f4753' const='yes' id='a3f5ae0e'/>
    <qualified-type-def type-id='fd376fcf' const='yes' id='2e96e5aa'/>
    <qualified-type-def type-id='5d81b3b0' const='yes' id='94d46bf9'/>
    <qualified-type-def type-id='3847ab67' const='yes' id='27297916'/>
    <qualified-type-def type-id='f331f373' const='yes' id='62294afc'/>
    <class-decl name='ObbCallback' size-in-bits='96' visibility='default' filepath='frameworks/base/native/android/storage_manager.cpp' line='49' column='1' id='f0b1600d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nonce' type-id='3ff5601b' visibility='default' filepath='frameworks/base/native/android/storage_manager.cpp' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cb' type-id='9299e4b4' visibility='default' filepath='frameworks/base/native/android/storage_manager.cpp' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='eaa32e2f' visibility='default' filepath='frameworks/base/native/android/storage_manager.cpp' line='59' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='ObbCallback' mangled-name='_ZN11ObbCallbackC2EiPFvPKciPvES2_' filepath='frameworks/base/native/android/storage_manager.cpp' line='51' column='1' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='547a22ad' is-artificial='yes'/>
          <parameter type-id='3ff5601b'/>
          <parameter type-id='9299e4b4'/>
          <parameter type-id='eaa32e2f'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <namespace-decl name='android'>
      <class-decl name='SortedVector&lt;ObbCallback *&gt;' visibility='default' is-declaration-only='yes' id='5d81b3b0'/>
    </namespace-decl>
    <array-type-def dimensions='1' type-id='3ff5601b' size-in-bits='32' id='e4652d73'>
      <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
    </array-type-def>
    <typedef-decl name='AStorageManager_obbCallbackFunc' type-id='238ccd13' filepath='frameworks/native/include/android/storage_manager.h' line='123' column='1' id='9299e4b4'/>
    <pointer-type-def type-id='f521429f' size-in-bits='32' id='238ccd13'/>
  </abi-instr>
  <abi-instr address-size='32' path='frameworks/base/libs/storage/IObbActionListener.cpp' language='LANG_C_plus_plus_14'>
    <array-type-def dimensions='1' type-id='801a266d' size-in-bits='608' id='19b37a54'>
      <subrange length='38' type-id='7ff19f0f' id='aa4ccdac'/>
    </array-type-def>
    <pointer-type-def type-id='b4c0d64f' size-in-bits='32' id='36e31287'/>
    <pointer-type-def type-id='3224f91e' size-in-bits='32' id='e09894a4'/>
    <pointer-type-def type-id='af342359' size-in-bits='32' id='e1c45961'/>
    <pointer-type-def type-id='df458ae6' size-in-bits='32' id='621ed18c'/>
    <qualified-type-def type-id='c70198d4' const='yes' id='a48c009f'/>
    <reference-type-def kind='lvalue' type-id='a48c009f' size-in-bits='32' id='c165233b'/>
    <reference-type-def kind='lvalue' type-id='c70198d4' size-in-bits='32' id='3983c4f6'/>
    <pointer-type-def type-id='6a14bf2f' size-in-bits='32' id='6ec90c77'/>
    <qualified-type-def type-id='f7c5ae1e' const='yes' id='79f4741d'/>
    <pointer-type-def type-id='79f4741d' size-in-bits='32' id='32d2f295'/>
    <qualified-type-def type-id='6a14bf2f' const='yes' id='eae5dbc4'/>
    <reference-type-def kind='lvalue' type-id='eae5dbc4' size-in-bits='32' id='a9d924c6'/>
    <qualified-type-def type-id='9a8c82c0' const='yes' id='589f2895'/>
    <pointer-type-def type-id='589f2895' size-in-bits='32' id='418d24ad'/>
    <qualified-type-def type-id='15f35f71' const='yes' id='5d62d332'/>
    <pointer-type-def type-id='5d62d332' size-in-bits='32' id='1a924ec8'/>
    <qualified-type-def type-id='17e76a52' const='yes' id='91a7fe13'/>
    <pointer-type-def type-id='91a7fe13' size-in-bits='32' id='847533bb'/>
    <qualified-type-def type-id='0de0b2fb' const='yes' id='990dfc58'/>
    <reference-type-def kind='lvalue' type-id='990dfc58' size-in-bits='32' id='6f047a5a'/>
    <pointer-type-def type-id='990dfc58' size-in-bits='32' id='63046776'/>
    <qualified-type-def type-id='c722890a' const='yes' id='3e775081'/>
    <reference-type-def kind='lvalue' type-id='3e775081' size-in-bits='32' id='fcd3f6e5'/>
    <pointer-type-def type-id='3e775081' size-in-bits='32' id='00d3fd31'/>
    <qualified-type-def type-id='4337a511' const='yes' id='96d92c21'/>
    <reference-type-def kind='lvalue' type-id='96d92c21' size-in-bits='32' id='7ee04f05'/>
    <reference-type-def kind='lvalue' type-id='9a8c82c0' size-in-bits='32' id='83c15dea'/>
    <pointer-type-def type-id='9a8c82c0' size-in-bits='32' id='77c14b06'/>
    <pointer-type-def type-id='15f35f71' size-in-bits='32' id='10cb6749'/>
    <pointer-type-def type-id='17e76a52' size-in-bits='32' id='1e283db0'/>
    <reference-type-def kind='lvalue' type-id='0de0b2fb' size-in-bits='32' id='b43a7bff'/>
    <pointer-type-def type-id='0de0b2fb' size-in-bits='32' id='b83a824b'/>
    <reference-type-def kind='lvalue' type-id='c722890a' size-in-bits='32' id='cfba356c'/>
    <reference-type-def kind='rvalue' type-id='c722890a' size-in-bits='32' id='4c21e37e'/>
    <pointer-type-def type-id='c722890a' size-in-bits='32' id='d3ba3bb8'/>
    <reference-type-def kind='lvalue' type-id='4337a511' size-in-bits='32' id='ecd1342c'/>
    <namespace-decl name='android'>
      <class-decl name='BpObbActionListener' size-in-bits='224' visibility='default' filepath='frameworks/base/libs/storage/IObbActionListener.cpp' line='27' column='1' id='af342359'>
        <base-class access='public' layout-offset-in-bits='0' type-id='3224f91e'/>
        <member-function access='public' constructor='yes'>
          <function-decl name='BpObbActionListener' mangled-name='_ZN7android19BpObbActionListenerC1ERKNS_2spINS_7IBinderEEE' filepath='frameworks/base/libs/storage/IObbActionListener.cpp' line='29' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e1c45961' is-artificial='yes'/>
            <parameter type-id='83dafb9a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='public' vtable-offset='4'>
          <function-decl name='onObbResult' mangled-name='_ZN7android19BpObbActionListener11onObbResultERKNS_8String16Eii' filepath='frameworks/base/libs/storage/IObbActionListener.cpp' line='33' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e1c45961' is-artificial='yes'/>
            <parameter type-id='157d4f95'/>
            <parameter type-id='922df12b'/>
            <parameter type-id='922df12b'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='BpInterface&lt;android::IObbActionListener&gt;' size-in-bits='224' visibility='default' filepath='frameworks/native/libs/binder/include/binder/IInterface.h' line='86' column='1' id='3224f91e'>
        <base-class access='public' layout-offset-in-bits='0' type-id='f7c5ae1e'/>
        <base-class access='public' layout-offset-in-bits='32' type-id='df458ae6'/>
        <member-function access='public'>
          <function-decl name='BpInterface' mangled-name='_ZN7android11BpInterfaceINS_18IObbActionListenerEEC2ERKNS_2spINS_7IBinderEEE' filepath='frameworks/native/libs/binder/include/binder/IInterface.h' line='89' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e09894a4' is-artificial='yes'/>
            <parameter type-id='83dafb9a'/>
            <return type-id='48b5725f'/>
          </function-decl>
        </member-function>
        <member-function access='protected' vtable-offset='2'>
          <function-decl name='onAsBinder' mangled-name='_ZN7android11BpInterfaceINS_18IObbActionListenerEE10onAsBinderEv' filepath='frameworks/native/libs/binder/include/binder/IInterface.h' line='93' column='1' visibility='default' binding='global' size-in-bits='32'>
            <parameter type-id='e09894a4' is-artificial='yes'/>
            <return type-id='b5a5bc13'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='BpRefBase' visibility='default' is-declaration-only='yes' id='df458ae6'/>
    </namespace-decl>
    <namespace-decl name='std'>
      <namespace-decl name='__1'>
        <class-decl name='unique_ptr&lt;android::IObbActionListener, std::__1::default_delete&lt;android::IObbActionListener&gt; &gt;' size-in-bits='32' visibility='default' filepath='external/libcxx/include/memory' line='2401' column='1' id='c722890a'>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='3ac420f3' filepath='external/libcxx/include/memory' line='2405' column='1' id='670db6be'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='deleter_type' type-id='0de0b2fb' filepath='external/libcxx/include/memory' line='2404' column='1' id='4337a511'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='__ptr_' type-id='9a8c82c0' visibility='default' filepath='external/libcxx/include/memory' line='2411' column='1'/>
          </data-member>
          <member-function access='public'>
            <function-decl name='unique_ptr' filepath='external/libcxx/include/memory' line='2494' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='d3ba3bb8' is-artificial='yes'/>
              <parameter type-id='4c21e37e'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes'>
            <function-decl name='~unique_ptr' mangled-name='_ZNSt3__110unique_ptrIN7android18IObbActionListenerENS_14default_deleteIS2_EEED2Ev' filepath='external/libcxx/include/memory' line='2606' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='d3ba3bb8' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='__compressed_pair&lt;android::IObbActionListener *, std::__1::default_delete&lt;android::IObbActionListener&gt; &gt;' size-in-bits='32' visibility='default' filepath='external/libcxx/include/memory' line='2211' column='1' id='9a8c82c0'>
          <base-class access='private' layout-offset-in-bits='0' type-id='15f35f71'/>
          <base-class access='private' layout-offset-in-bits='0' type-id='17e76a52'/>
        </class-decl>
        <class-decl name='__compressed_pair_elem&lt;android::IObbActionListener *, 0, false&gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='2134' column='1' id='15f35f71'>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='3983c4f6' filepath='external/libcxx/include/memory' line='2136' column='1' id='43aaeec3'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='c165233b' filepath='external/libcxx/include/memory' line='2137' column='1' id='6df490d3'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='__value_' type-id='c70198d4' visibility='default' filepath='external/libcxx/include/memory' line='2168' column='1'/>
          </data-member>
          <member-function access='public'>
            <function-decl name='__compressed_pair_elem' filepath='external/libcxx/include/memory' line='2140' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='10cb6749' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='__compressed_pair_elem&lt;std::__1::default_delete&lt;android::IObbActionListener&gt;, 1, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='2172' column='1' id='17e76a52'>
          <base-class access='private' layout-offset-in-bits='0' type-id='0de0b2fb'/>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='b43a7bff' filepath='external/libcxx/include/memory' line='2174' column='1' id='f7172ed8'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='6f047a5a' filepath='external/libcxx/include/memory' line='2175' column='1' id='d750daf8'/>
          </member-type>
          <member-function access='public'>
            <function-decl name='__compressed_pair_elem' filepath='external/libcxx/include/memory' line='2179' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='1e283db0' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='default_delete&lt;android::IObbActionListener&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='2320' column='1' id='0de0b2fb'>
          <member-function access='public'>
            <function-decl name='default_delete' filepath='external/libcxx/include/memory' line='2324' column='1' visibility='default' binding='global' size-in-bits='32'>
              <parameter type-id='b83a824b' is-artificial='yes'/>
              <return type-id='48b5725f'/>
            </function-decl>
          </member-function>
        </class-decl>
        <class-decl name='add_lvalue_reference&lt;android::IObbActionListener&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/type_traits' line='1127' column='1' id='12c60191'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='608b97af' filepath='external/libcxx/include/type_traits' line='1128' column='1' id='6f181d72'/>
          </member-type>
        </class-decl>
        <class-decl name='__add_lvalue_reference_impl&lt;android::IObbActionListener, true&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/type_traits' line='1125' column='1' id='9ce38486'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='bb0185f0' filepath='external/libcxx/include/type_traits' line='1125' column='1' id='608b97af'/>
          </member-type>
        </class-decl>
        <class-decl name='__pointer_type&lt;android::IObbActionListener, std::__1::default_delete&lt;android::IObbActionListener&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='1029' column='1' id='4ef6f3a4'>
          <member-type access='public'>
            <typedef-decl name='type' type-id='1e232805' filepath='external/libcxx/include/memory' line='1031' column='1' id='3ac420f3'/>
          </member-type>
        </class-decl>
        <namespace-decl name='__pointer_type_imp'>
          <class-decl name='__pointer_type&lt;android::IObbActionListener, std::__1::default_delete&lt;android::IObbActionListener&gt;, false&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='external/libcxx/include/memory' line='1021' column='1' id='123fea2e'>
            <member-type access='public'>
              <typedef-decl name='type' type-id='c70198d4' filepath='external/libcxx/include/memory' line='1023' column='1' id='1e232805'/>
            </member-type>
          </class-decl>
        </namespace-decl>
      </namespace-decl>
    </namespace-decl>
    <reference-type-def kind='lvalue' type-id='f7c5ae1e' size-in-bits='32' id='bb0185f0'/>
  </abi-instr>
  <abi-instr address-size='32' path='frameworks/base/libs/storage/ObbInfo.cpp' language='LANG_C_plus_plus_14'>
    <qualified-type-def type-id='65c10d3d' const='yes' id='dda33994'/>
    <pointer-type-def type-id='dda33994' size-in-bits='32' id='a5f3e61a'/>
  </abi-instr>
  <abi-instr address-size='32' path='frameworks/base/native/android/asset_manager.cpp' language='LANG_C_plus_plus_14'>
    <type-decl name='__ARRAY_SIZE_TYPE__' size-in-bits='64' id='7ff19f0f'/>
    <array-type-def dimensions='1' type-id='1b3b87e1' size-in-bits='512' id='224e4514'>
      <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='71ad5e8a' size-in-bits='infinite' id='86626492'>
      <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='2d5c5fc5' size-in-bits='512' id='98ae5868'>
      <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
    </array-type-def>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <type-decl name='char16_t' size-in-bits='16' id='801a266d'/>
    <type-decl name='char32_t' size-in-bits='32' id='a846fc93'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='16' id='49f79167'>
      <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='32' id='8e0573fd'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='64' id='8e100159'>
      <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='bfebf634' size-in-bits='infinite' id='b51730a0'>
      <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' id='a0eb0f08'/>
    <type-decl name='float' size-in-bits='32' id='a6c45d85'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <array-type-def dimensions='1' type-id='3ff5601b' size-in-bits='32' id='e4652d73'>
      <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
    </array-type-def>
    <type-decl name='long double' size-in-bits='64' id='e095c704'/>
    <type-decl name='long int' size-in-bits='32' id='bd54fe1a'/>
    <type-decl name='long long int' size-in-bits='64' id='1eb56b1e'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='3a47d82b'/>
    <type-decl name='short int' size-in-bits='16' id='a2185560'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <array-type-def dimensions='1' type-id='0ad725ff' size-in-bits='96' id='5da85797'>
      <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='97219ec5' size-in-bits='88' id='8c04a868'>
      <subrange length='11' type-id='7ff19f0f' id='847bc017'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='06725de7' size-in-bits='96' id='048eea03'>
      <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='1a8dd50d' size-in-bits='80' id='72631341'>
      <subrange length='5' type-id='7ff19f0f' id='53010e10'/>
    </array-type-def>
    <typedef-decl name='__builtin_va_list' type-id='30357e0a' id='7f896fb4'/>
    <array-type-def dimensions='1' type-id='8f92235e' size-in-bits='infinite' id='1e7b9b2b'>
      <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='2048' id='62946659'>
      <subrange length='256' type-id='7ff19f0f' id='36e5b9fa'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='128' id='92a46553'>
      <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='2048' id='f411cbcf'>
      <subrange length='256' type-id='7ff19f0f' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='002ac4a6' size-in-bits='32' id='09001d3c'>
      <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
    </array-type-def>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <array-type-def dimensions='1' type-id='807869d3' size-in-bits='512' id='ba25cd2e'>
      <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
    </array-type-def>
    <type-decl name='unsigned long int' size-in-bits='32' id='7359adad'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <type-decl name='variadic parameter type' id='2c1145c5'/>
    <type-decl name='void' id='48b5725f'/>
    <type-decl name='wchar_t' size-in-bits='32' id='c523b9f1'/>
    <typedef-decl name='size_t' type-id='f0981eeb' filepath='prebuilts/clang/host/linux-x86/clang-r383902b/lib64/clang/11.0.2/include/stddef.h' line='46' column='1' id='b59d7dce'/>
    <typedef-decl name='lldiv_t' type-id='8aac8194' filepath='bionic/libc/include/stdlib.h' line='146' column='1' id='f5fa3b34'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='f5fa3b34' visibility='default' filepath='bionic/libc/include/stdlib.h' line='143' column='1' id='8aac8194'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='1eb56b1e' visibility='default' filepath='bionic/libc/include/stdlib.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='1eb56b1e' visibility='default' filepath='bionic/libc/include/stdlib.h' line='145' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ldiv_t' type-id='33a9d652' filepath='bionic/libc/include/stdlib.h' line='139' column='1' id='30397bf8'/>
    <class-decl name='__anonymous_struct__1' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='30397bf8' visibility='default' filepath='bionic/libc/include/stdlib.h' line='136' column='1' id='33a9d652'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='bd54fe1a' visibility='default' filepath='bionic/libc/include/stdlib.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rem' type-id='bd54fe1a' visibility='default' filepath='bionic/libc/include/stdlib.h' line='138' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='8d7b2c1e' filepath='bionic/libc/include/stdio.h' line='59' column='1' id='aa12d1ba'/>
    <class-decl name='_JNIEnv' size-in-bits='32' is-struct='yes' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='489' column='1' id='c9459134'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='functions' type-id='e48f1427' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='491' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='va_list' type-id='7f896fb4' filepath='prebuilts/clang/host/linux-x86/clang-r383902b/lib64/clang/11.0.2/include/stdarg.h' line='14' column='1' id='2aee9912'/>
    <typedef-decl name='fpos_t' type-id='ad707ada' filepath='bionic/libc/include/stdio.h' line='55' column='1' id='e322b6ef'/>
    <typedef-decl name='off_t' type-id='8dda407a' filepath='bionic/libc/include/sys/types.h' line='105' column='1' id='ad707ada'/>
    <typedef-decl name='__kernel_off_t' type-id='6a11bd61' filepath='bionic/libc/kernel/uapi/asm-generic/posix_types.h' line='75' column='1' id='8dda407a'/>
    <typedef-decl name='__kernel_long_t' type-id='bd54fe1a' filepath='bionic/libc/kernel/uapi/asm-generic/posix_types.h' line='23' column='1' id='6a11bd61'/>
    <typedef-decl name='wint_t' type-id='f0981eeb' filepath='bionic/libc/include/bits/wctype.h' line='36' column='1' id='6dd37369'/>
    <typedef-decl name='wctype_t' type-id='bd54fe1a' filepath='bionic/libc/include/bits/wctype.h' line='56' column='1' id='ba50424d'/>
    <typedef-decl name='wctrans_t' type-id='eaa32e2f' filepath='bionic/libc/include/bits/wctype.h' line='60' column='1' id='183c72c3'/>
    <class-decl name='tm' size-in-bits='352' is-struct='yes' visibility='default' filepath='bionic/libc/include/time.h' line='46' column='1' id='dddf6ca2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='95e97e5e' visibility='default' filepath='bionic/libc/include/time.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='tm_gmtoff' type-id='bd54fe1a' visibility='default' filepath='bionic/libc/include/time.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_zone' type-id='80f4b756' visibility='default' filepath='bionic/libc/include/time.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='mbstate_t' type-id='08dd5078' filepath='bionic/libc/include/bits/mbstate_t.h' line='47' column='1' id='3d7d8cbf'/>
    <class-decl name='__anonymous_struct__2' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='3d7d8cbf' visibility='default' filepath='bionic/libc/include/bits/mbstate_t.h' line='42' column='1' id='08dd5078'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__seq' type-id='09001d3c' visibility='default' filepath='bionic/libc/include/bits/mbstate_t.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='clock_t' type-id='880ebc01' filepath='bionic/libc/include/sys/types.h' line='54' column='1' id='4c3a2c61'/>
    <typedef-decl name='__kernel_clock_t' type-id='6a11bd61' filepath='bionic/libc/kernel/uapi/asm-generic/posix_types.h' line='80' column='1' id='880ebc01'/>
    <typedef-decl name='time_t' type-id='65eda9c0' filepath='bionic/libc/include/sys/types.h' line='96' column='1' id='c9d12d66'/>
    <typedef-decl name='__time_t' type-id='f7d92306' filepath='bionic/libc/include/sys/types.h' line='95' column='1' id='65eda9c0'/>
    <typedef-decl name='__kernel_time_t' type-id='6a11bd61' filepath='bionic/libc/kernel/uapi/asm-generic/posix_types.h' line='78' column='1' id='f7d92306'/>
    <class-decl name='JNINativeInterface' size-in-bits='7456' is-struct='yes' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='149' column='1' id='ad414f12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved0' type-id='eaa32e2f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved1' type-id='eaa32e2f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='reserved2' type-id='eaa32e2f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='reserved3' type-id='eaa32e2f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='GetVersion' type-id='4b15419a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='DefineClass' type-id='3358ddb3' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='FindClass' type-id='e905d0ac' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='FromReflectedMethod' type-id='09176273' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='FromReflectedField' type-id='04aa9df2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ToReflectedMethod' type-id='582ba311' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='GetSuperclass' type-id='93737cc2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='IsAssignableFrom' type-id='f39f8bbd' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ToReflectedField' type-id='58398eee' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='Throw' type-id='4a0b9bf1' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ThrowNew' type-id='0571aa74' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='ExceptionOccurred' type-id='7fdf58e1' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ExceptionDescribe' type-id='8bc971a6' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='ExceptionClear' type-id='8bc971a6' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='FatalError' type-id='2deb20e5' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='PushLocalFrame' type-id='9aeb7958' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='PopLocalFrame' type-id='a0ba6dc8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='NewGlobalRef' type-id='a0ba6dc8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='DeleteGlobalRef' type-id='8a1f7e9e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='DeleteLocalRef' type-id='8a1f7e9e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='IsSameObject' type-id='782c53f5' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='NewLocalRef' type-id='a0ba6dc8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='EnsureLocalCapacity' type-id='9aeb7958' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='AllocObject' type-id='151a1d63' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='NewObject' type-id='f8af7982' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='NewObjectV' type-id='a01a6e09' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='NewObjectA' type-id='f0a0ff54' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='GetObjectClass' type-id='b5f4f133' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='IsInstanceOf' type-id='bcee08ac' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='GetMethodID' type-id='30974818' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='CallObjectMethod' type-id='2dab161d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='CallObjectMethodV' type-id='0290ef52' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='CallObjectMethodA' type-id='4278623b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='CallBooleanMethod' type-id='461c5f2a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='CallBooleanMethodV' type-id='88d99751' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='CallBooleanMethodA' type-id='74823d0c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='CallByteMethod' type-id='17d955f8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='CallByteMethodV' type-id='44bea17b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='CallByteMethodA' type-id='ed0795aa' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='CallCharMethod' type-id='e747dee6' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='CallCharMethodV' type-id='d31f1c35' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='CallCharMethodA' type-id='b0061f70' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='CallShortMethod' type-id='bf87e894' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='CallShortMethodV' type-id='5da2c37f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='CallShortMethodA' type-id='5db5877e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='CallIntMethod' type-id='3271bf2f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='CallIntMethodV' type-id='66ebe6b0' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='CallIntMethodA' type-id='6c56e815' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='CallLongMethod' type-id='ea8867ec' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='CallLongMethodV' type-id='5f929ab7' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='CallLongMethodA' type-id='a55b35a6' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <var-decl name='CallFloatMethod' type-id='e8139a80' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='CallFloatMethodV' type-id='9ac8b1e3' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1824'>
        <var-decl name='CallFloatMethodA' type-id='413559e2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='CallDoubleMethod' type-id='a642a393' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1888'>
        <var-decl name='CallDoubleMethodV' type-id='95fba39c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='CallDoubleMethodA' type-id='a3ea0661' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1952'>
        <var-decl name='CallVoidMethod' type-id='d696f7b3' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='CallVoidMethodV' type-id='bbecc3fc' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='CallVoidMethodA' type-id='921cf101' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='CallNonvirtualObjectMethod' type-id='4f7677f6' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='CallNonvirtualObjectMethodV' type-id='15887ec5' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='CallNonvirtualObjectMethodA' type-id='34c67260' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='CallNonvirtualBooleanMethod' type-id='f1191df9' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='CallNonvirtualBooleanMethodV' type-id='ff535cb6' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='CallNonvirtualBooleanMethodA' type-id='fb38167f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='CallNonvirtualByteMethod' type-id='377b5e63' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <var-decl name='CallNonvirtualByteMethodV' type-id='1930d02c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='CallNonvirtualByteMethodA' type-id='1d2f8a91' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='CallNonvirtualCharMethod' type-id='63f7d65d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='CallNonvirtualCharMethodV' type-id='c32cfa12' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2400'>
        <var-decl name='CallNonvirtualCharMethodA' type-id='c2280e7b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='CallNonvirtualShortMethod' type-id='0de4af77' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2464'>
        <var-decl name='CallNonvirtualShortMethodV' type-id='255ff5d8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='CallNonvirtualShortMethodA' type-id='f4bbad8d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2528'>
        <var-decl name='CallNonvirtualIntMethod' type-id='ce1853bc' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='CallNonvirtualIntMethodV' type-id='d5b0b547' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='CallNonvirtualIntMethodA' type-id='3318dad6' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='CallNonvirtualLongMethod' type-id='3459b4cf' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='CallNonvirtualLongMethodV' type-id='a60dd490' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='CallNonvirtualLongMethodA' type-id='326df5b5' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='CallNonvirtualFloatMethod' type-id='eb164d0b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='CallNonvirtualFloatMethodV' type-id='8c4e1254' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='CallNonvirtualFloatMethodA' type-id='a0bc56e9' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='CallNonvirtualDoubleMethod' type-id='2dcc8b98' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2848'>
        <var-decl name='CallNonvirtualDoubleMethodV' type-id='0e5e0cdb' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='CallNonvirtualDoubleMethodA' type-id='a937264a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2912'>
        <var-decl name='CallNonvirtualVoidMethod' type-id='c14258b8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='CallNonvirtualVoidMethodV' type-id='1db4c5bb' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2976'>
        <var-decl name='CallNonvirtualVoidMethodA' type-id='41d61b6a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='GetFieldID' type-id='5d99509b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3040'>
        <var-decl name='GetObjectField' type-id='7139225a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='GetBooleanField' type-id='13196dfd' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3104'>
        <var-decl name='GetByteField' type-id='c8bc780f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='GetCharField' type-id='239d7ad9' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3168'>
        <var-decl name='GetShortField' type-id='476f48bb' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='GetIntField' type-id='f7e564c8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3232'>
        <var-decl name='GetLongField' type-id='ac4e6cb3' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='GetFloatField' type-id='06fbd437' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3296'>
        <var-decl name='GetDoubleField' type-id='47bc557c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='SetObjectField' type-id='e333ff60' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3360'>
        <var-decl name='SetBooleanField' type-id='b263848f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='SetByteField' type-id='a4a48a09' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3424'>
        <var-decl name='SetCharField' type-id='e4b27ecf' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='SetShortField' type-id='090a6901' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3488'>
        <var-decl name='SetIntField' type-id='d3651c96' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='SetLongField' type-id='09b49e9d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3552'>
        <var-decl name='SetFloatField' type-id='ac4ad749' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='SetDoubleField' type-id='195d3e42' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3616'>
        <var-decl name='GetStaticMethodID' type-id='30974818' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='CallStaticObjectMethod' type-id='f8af7982' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3680'>
        <var-decl name='CallStaticObjectMethodV' type-id='a01a6e09' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='CallStaticObjectMethodA' type-id='f0a0ff54' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3744'>
        <var-decl name='CallStaticBooleanMethod' type-id='916299d7' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='CallStaticBooleanMethodV' type-id='412650f8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3808'>
        <var-decl name='CallStaticBooleanMethodA' type-id='339f696d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='CallStaticByteMethod' type-id='ce9d67cd' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3872'>
        <var-decl name='CallStaticByteMethodV' type-id='478facc2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='CallStaticByteMethodA' type-id='db28fdcb' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3936'>
        <var-decl name='CallStaticCharMethod' type-id='3bd86cfb' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='CallStaticCharMethodV' type-id='dddcefc4' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4000'>
        <var-decl name='CallStaticCharMethodA' type-id='692552f9' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='CallStaticShortMethod' type-id='362e2831' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4064'>
        <var-decl name='CallStaticShortMethodV' type-id='d1173c4e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='CallStaticShortMethodA' type-id='097c7407' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4128'>
        <var-decl name='CallStaticIntMethod' type-id='64ca4b84' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='CallStaticIntMethodV' type-id='0323d66f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4192'>
        <var-decl name='CallStaticIntMethodA' type-id='30b9a8ce' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='CallStaticLongMethod' type-id='8c22ffe9' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4256'>
        <var-decl name='CallStaticLongMethodV' type-id='60306f66' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='CallStaticLongMethodA' type-id='1fda464f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4320'>
        <var-decl name='CallStaticFloatMethod' type-id='4ed90115' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='CallStaticFloatMethodV' type-id='87e0b5ea' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4384'>
        <var-decl name='CallStaticFloatMethodA' type-id='caa57963' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='CallStaticDoubleMethod' type-id='04b3e5a0' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='340' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4448'>
        <var-decl name='CallStaticDoubleMethodV' type-id='be0ed943' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='CallStaticDoubleMethodA' type-id='df8dc702' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4512'>
        <var-decl name='CallStaticVoidMethod' type-id='a86eb340' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='343' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='CallStaticVoidMethodV' type-id='cf05fa23' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='344' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4576'>
        <var-decl name='CallStaticVoidMethodA' type-id='6fc0eca2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='GetStaticFieldID' type-id='5d99509b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4640'>
        <var-decl name='GetStaticObjectField' type-id='d7560895' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='GetStaticBooleanField' type-id='4127a730' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4704'>
        <var-decl name='GetStaticByteField' type-id='c404650a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='352' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='GetStaticCharField' type-id='0736b484' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4768'>
        <var-decl name='GetStaticShortField' type-id='0d5970ee' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='GetStaticIntField' type-id='771014ab' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4832'>
        <var-decl name='GetStaticLongField' type-id='a4a6a786' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='GetStaticFloatField' type-id='337e1672' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4896'>
        <var-decl name='GetStaticDoubleField' type-id='bd4849d7' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='SetStaticObjectField' type-id='6c160b51' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='360' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4960'>
        <var-decl name='SetStaticBooleanField' type-id='0a7e4740' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='361' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='SetStaticByteField' type-id='0cb5bb00' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5024'>
        <var-decl name='SetStaticCharField' type-id='bbfff1aa' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='SetStaticShortField' type-id='187251e2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5088'>
        <var-decl name='SetStaticIntField' type-id='3a8fe115' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='SetStaticLongField' type-id='72f7c194' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='366' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5152'>
        <var-decl name='SetStaticFloatField' type-id='e0227512' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='367' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='SetStaticDoubleField' type-id='30411993' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='368' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5216'>
        <var-decl name='NewString' type-id='40f183ab' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='GetStringLength' type-id='a7d6acc8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5280'>
        <var-decl name='GetStringChars' type-id='e5a87447' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='ReleaseStringChars' type-id='61d681d5' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5344'>
        <var-decl name='NewStringUTF' type-id='691ba251' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5376'>
        <var-decl name='GetStringUTFLength' type-id='a7d6acc8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5408'>
        <var-decl name='GetStringUTFChars' type-id='08565ebd' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='ReleaseStringUTFChars' type-id='ac33476b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5472'>
        <var-decl name='GetArrayLength' type-id='a23a76e0' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='NewObjectArray' type-id='e4f2ab66' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5536'>
        <var-decl name='GetObjectArrayElement' type-id='0ae13aef' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='SetObjectArrayElement' type-id='99167093' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5600'>
        <var-decl name='NewBooleanArray' type-id='162473c8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='NewByteArray' type-id='be49c182' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5664'>
        <var-decl name='NewCharArray' type-id='ac74c0c4' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='NewShortArray' type-id='978c735e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5728'>
        <var-decl name='NewIntArray' type-id='2041a8d7' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='388' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='NewLongArray' type-id='d7ea3436' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5792'>
        <var-decl name='NewFloatArray' type-id='69b7386a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='NewDoubleArray' type-id='31ebf17b' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5856'>
        <var-decl name='GetBooleanArrayElements' type-id='9b3c0ac2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='GetByteArrayElements' type-id='33683384' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5920'>
        <var-decl name='GetCharArrayElements' type-id='be2cecec' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='395' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='GetShortArrayElements' type-id='5353c67e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5984'>
        <var-decl name='GetIntArrayElements' type-id='4f68d4b2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6016'>
        <var-decl name='GetLongArrayElements' type-id='b286ae14' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6048'>
        <var-decl name='GetFloatArrayElements' type-id='210c37a6' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6080'>
        <var-decl name='GetDoubleArrayElements' type-id='b181362a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='400' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6112'>
        <var-decl name='ReleaseBooleanArrayElements' type-id='666fc788' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='ReleaseByteArrayElements' type-id='59e7b6c6' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6176'>
        <var-decl name='ReleaseCharArrayElements' type-id='01eb6566' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6208'>
        <var-decl name='ReleaseShortArrayElements' type-id='075b7a00' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6240'>
        <var-decl name='ReleaseIntArrayElements' type-id='bc4a7a06' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6272'>
        <var-decl name='ReleaseLongArrayElements' type-id='0ba6a8b6' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6304'>
        <var-decl name='ReleaseFloatArrayElements' type-id='c503a924' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='ReleaseDoubleArrayElements' type-id='c8abb79e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6368'>
        <var-decl name='GetBooleanArrayRegion' type-id='67514b72' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
        <var-decl name='GetByteArrayRegion' type-id='c541e6a4' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='421' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6432'>
        <var-decl name='GetCharArrayRegion' type-id='af95e824' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6464'>
        <var-decl name='GetShortArrayRegion' type-id='1f57b15a' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='425' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6496'>
        <var-decl name='GetIntArrayRegion' type-id='7f0ac28c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='427' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6528'>
        <var-decl name='GetLongArrayRegion' type-id='747a49e4' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6560'>
        <var-decl name='GetFloatArrayRegion' type-id='060c7d5e' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='GetDoubleArrayRegion' type-id='fce8e074' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='433' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6624'>
        <var-decl name='SetBooleanArrayRegion' type-id='a617346d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='SetByteArrayRegion' type-id='5ee69201' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='439' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6688'>
        <var-decl name='SetCharArrayRegion' type-id='b049b821' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='441' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='SetShortArrayRegion' type-id='62d9dee9' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6752'>
        <var-decl name='SetIntArrayRegion' type-id='f569444f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='SetLongArrayRegion' type-id='10182119' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6816'>
        <var-decl name='SetFloatArrayRegion' type-id='a975aa19' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6848'>
        <var-decl name='SetDoubleArrayRegion' type-id='348c02e9' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6880'>
        <var-decl name='RegisterNatives' type-id='764ac7bf' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6912'>
        <var-decl name='UnregisterNatives' type-id='9447819d' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6944'>
        <var-decl name='MonitorEnter' type-id='67a46ff2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6976'>
        <var-decl name='MonitorExit' type-id='67a46ff2' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='458' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7008'>
        <var-decl name='GetJavaVM' type-id='5a4c25bf' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='459' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7040'>
        <var-decl name='GetStringRegion' type-id='fb79cfe8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7072'>
        <var-decl name='GetStringUTFRegion' type-id='629961b8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='462' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7104'>
        <var-decl name='GetPrimitiveArrayCritical' type-id='d82ed742' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7136'>
        <var-decl name='ReleasePrimitiveArrayCritical' type-id='601f438c' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7168'>
        <var-decl name='GetStringCritical' type-id='e5a87447' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='467' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7200'>
        <var-decl name='ReleaseStringCritical' type-id='61d681d5' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='468' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7232'>
        <var-decl name='NewWeakGlobalRef' type-id='03bcacf3' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7264'>
        <var-decl name='DeleteWeakGlobalRef' type-id='ccc141a1' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='471' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7296'>
        <var-decl name='ExceptionCheck' type-id='5796afad' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='473' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7328'>
        <var-decl name='NewDirectByteBuffer' type-id='2c684c9f' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='475' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7360'>
        <var-decl name='GetDirectBufferAddress' type-id='bd98ffce' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='476' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7392'>
        <var-decl name='GetDirectBufferCapacity' type-id='47653e05' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='477' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7424'>
        <var-decl name='GetObjectRefType' type-id='500eebf7' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='480' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='jint' type-id='3ff5601b' filepath='libnativehelper/include_jni/jni.h' line='34' column='1' id='0b9c02cb'/>
    <typedef-decl name='int32_t' type-id='33f57a65' filepath='bionic/libc/include/stdint.h' line='64' column='1' id='3ff5601b'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' filepath='bionic/libc/include/stdint.h' line='40' column='1' id='33f57a65'/>
    <typedef-decl name='JNIEnv' type-id='c9459134' filepath='libnativehelper/include_jni/jni.h' line='139' column='1' id='d357872a'/>
    <typedef-decl name='jclass' type-id='a5a1fc5a' filepath='libnativehelper/include_jni/jni.h' line='62' column='1' id='70de5c42'/>
    <typedef-decl name='jobject' type-id='478e3663' filepath='libnativehelper/include_jni/jni.h' line='61' column='1' id='96f3d089'/>
    <class-decl name='_jobject' size-in-bits='8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='46' column='1' id='baffb083'/>
    <typedef-decl name='jbyte' type-id='ee31ee44' filepath='libnativehelper/include_jni/jni.h' line='31' column='1' id='adf18958'/>
    <typedef-decl name='int8_t' type-id='2171a512' filepath='bionic/libc/include/stdint.h' line='58' column='1' id='ee31ee44'/>
    <typedef-decl name='__int8_t' type-id='28577a57' filepath='bionic/libc/include/stdint.h' line='36' column='1' id='2171a512'/>
    <typedef-decl name='jsize' type-id='0b9c02cb' filepath='libnativehelper/include_jni/jni.h' line='40' column='1' id='2c2f1adb'/>
    <typedef-decl name='jmethodID' type-id='b09bab5e' filepath='libnativehelper/include_jni/jni.h' line='105' column='1' id='38565182'/>
    <typedef-decl name='jfieldID' type-id='ee3187c5' filepath='libnativehelper/include_jni/jni.h' line='102' column='1' id='1f3810cb'/>
    <class-decl name='AAssetManager' size-in-bits='8' is-struct='yes' visibility='default' filepath='frameworks/base/libs/androidfw/include/androidfw/AssetManager.h' line='36' column='1' id='7907d453'/>
    <typedef-decl name='jboolean' type-id='b96825af' filepath='libnativehelper/include_jni/jni.h' line='30' column='1' id='cc6e09ca'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' filepath='bionic/libc/include/stdint.h' line='59' column='1' id='b96825af'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' filepath='bionic/libc/include/stdint.h' line='37' column='1' id='c51d6389'/>
    <typedef-decl name='jthrowable' type-id='a5fd6882' filepath='libnativehelper/include_jni/jni.h' line='74' column='1' id='5b89f496'/>
    <typedef-decl name='jvalue' type-id='2eab072b' filepath='libnativehelper/include_jni/jni.h' line='119' column='1' id='0994533b'/>
    <typedef-decl name='jchar' type-id='149c6638' filepath='libnativehelper/include_jni/jni.h' line='32' column='1' id='8dfe2e06'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' filepath='bionic/libc/include/stdint.h' line='62' column='1' id='149c6638'/>
    <typedef-decl name='__uint16_t' type-id='8efea9e5' filepath='bionic/libc/include/stdint.h' line='39' column='1' id='253c2d2a'/>
    <typedef-decl name='jshort' type-id='23bd8cb5' filepath='libnativehelper/include_jni/jni.h' line='33' column='1' id='9a10f134'/>
    <typedef-decl name='int16_t' type-id='03896e23' filepath='bionic/libc/include/stdint.h' line='61' column='1' id='23bd8cb5'/>
    <typedef-decl name='__int16_t' type-id='a2185560' filepath='bionic/libc/include/stdint.h' line='38' column='1' id='03896e23'/>
    <typedef-decl name='jlong' type-id='9da381c4' filepath='libnativehelper/include_jni/jni.h' line='35' column='1' id='c8745fdc'/>
    <typedef-decl name='int64_t' type-id='0c9942d2' filepath='bionic/libc/include/stdint.h' line='67' column='1' id='9da381c4'/>
    <typedef-decl name='__int64_t' type-id='1eb56b1e' filepath='bionic/libc/include/stdint.h' line='46' column='1' id='0c9942d2'/>
    <typedef-decl name='jfloat' type-id='a6c45d85' filepath='libnativehelper/include_jni/jni.h' line='36' column='1' id='1a7fe6b0'/>
    <typedef-decl name='jdouble' type-id='a0eb0f08' filepath='libnativehelper/include_jni/jni.h' line='37' column='1' id='973e3c3f'/>
    <typedef-decl name='jstring' type-id='e65fd0e5' filepath='libnativehelper/include_jni/jni.h' line='63' column='1' id='5b7c7bab'/>
    <typedef-decl name='jarray' type-id='85c463b1' filepath='libnativehelper/include_jni/jni.h' line='64' column='1' id='65b69bb3'/>
    <class-decl name='_jarray' size-in-bits='8' visibility='default' filepath='libnativehelper/include_jni/jni.h' line='49' column='1' id='440aaf49'>
      <base-class access='public' layout-offset-in-bits='0' type-id='baffb083'/>
    </class-decl>
    <typedef-decl name='jobjectArray' type-id='14c7458e' filepath='libnativehelper/include_jni/jni.h' line='65' column='1' id='2d5e6f72'/>
    <typedef-decl name='jbooleanArray' type-id='715a5bad' filepath='libnativehelper/include_jni/jni.h' line='66' column='1' id='e825b06b'/>
    <typedef-decl name='jbyteArray' type-id='047d4fff' filepath='libnativehelper/include_jni/jni.h' line='67' column='1' id='61dc2b35'/>
    <typedef-decl name='jcharArray' type-id='349a45dd' filepath='libnativehelper/include_jni/jni.h' line='68' column='1' id='088b642f'/>
    <typedef-decl name='jshortArray' type-id='3239e3af' filepath='libnativehelper/include_jni/jni.h' line='69' column='1' id='152bf3a9'/>
    <typedef-decl name='jintArray' type-id='0faa6e74' filepath='libnativehelper/include_jni/jni.h' line='70' column='1' id='181f4ac0'/>
    <typedef-decl name='jlongArray' type-id='15b6e673' filepath='libnativehelper/include_jni/jni.h' line='71' column='1' id='b43b1271'/>
    <typedef-decl name='jfloatArray' type-id='dda33667' filepath='libnativehelper/include_jni/jni.h' line='72' column='1' id='6e9854cd'/>
    <typedef-decl name='jdoubleArray' type-id='76b5a6a0' filepath='libnativehelper/include_jni/jni.h' line='73' column='1' id='feee141c'/>
    <typedef-decl name='JNINativeMethod' type-id='cdd897ad' filepath='libnativehelper/include_jni/jni.h' line='132' column='1' id='b7b5d51d'/>
    <typedef-decl name='JavaVM' type-id='d607eddf' filepath='libnativehelper/include_jni/jni.h' line='140' column='1' id='ebc81181'/>
    <typedef-decl name='jweak' type-id='478e3663' filepath='libnativehelper/include_jni/jni.h' line='75' column='1' id='6c9a8402'/>
    <typedef-decl name='jobjectRefType' type-id='4f771c8a' filepath='libnativehelper/include_jni/jni.h' line='126' column='1' id='c36bf49e'/>
    <enum-decl name='jobjectRefType' filepath='libnativehelper/include_jni/jni.h' line='121' column='1' id='4f771c8a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='JNIInvalidRefType' value='0'/>
      <enumerator name='JNILocalRefType' value='1'/>
      <enumerator name='JNIGlobalRefType' value='2'/>
      <enumerator name='JNIWeakGlobalRefType' value='3'/>
    </enum-decl>
    <typedef-decl name='AAssetManager' type-id='7907d453' filepath='frameworks/native/include/android/asset_manager.h' line='54' column='1' id='f41387f0'/>
    <typedef-decl name='pthread_mutex_t' type-id='cc3d65c7' filepath='bionic/libc/include/bits/pthread_types.h' line='78' column='1' id='7a6844eb'/>
    <class-decl name='__anonymous_struct__4' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='7a6844eb' visibility='default' filepath='bionic/libc/include/bits/pthread_types.h' line='72' column='1' id='cc3d65c7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__private' type-id='e4652d73' visibility='default' filepath='bionic/libc/include/bits/pthread_types.h' line='76' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='size_type' type-id='b59d7dce' filepath='external/libcxx/include/memory' line='1784' column='1' id='143a6b6e'/>
    <typedef-decl name='nsecs_t' type-id='9da381c4' filepath='system/core/libutils/include/utils/Timers.h' line='32' column='1' id='00f5ef57'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' filepath='bionic/libc/include/stdint.h' line='65' column='1' id='8f92235e'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' filepath='bionic/libc/include/stdint.h' line='41' column='1' id='62f1140c'/>
    <typedef-decl name='ssize_t' type-id='b6b3ebaf' filepath='bionic/libc/include/sys/types.h' line='128' column='1' id='79a0948f'/>
    <typedef-decl name='__kernel_ssize_t' type-id='95e97e5e' filepath='bionic/libc/kernel/uapi/asm-generic/posix_types.h' line='62' column='1' id='b6b3ebaf'/>
    <typedef-decl name='ptrdiff_t' type-id='95e97e5e' filepath='prebuilts/clang/host/linux-x86/clang-r383902b/lib64/clang/11.0.2/include/stddef.h' line='35' column='1' id='fc84bffe'/>
    <class-decl name='AAsset' size-in-bits='32' is-struct='yes' visibility='default' filepath='frameworks/base/native/android/asset_manager.cpp' line='50' column='1' id='1fc4034c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mAsset' type-id='ac070eda' visibility='default' filepath='frameworks/base/native/android/asset_manager.cpp' line='51' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='AAsset' mangled-name='_ZN6AAssetC2ENSt3__110unique_ptrIN7android5AssetENS0_14default_deleteIS3_EEEE' filepath='frameworks/base/native/android/asset_manager.cpp' line='53' column='1' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='57d98aaa' is-artificial='yes'/>
          <parameter type-id='ac070eda'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='AAsset' type-id='1fc4034c' filepath='frameworks/native/include/android/asset_manager.h' line='73' column='1' id='d27ea7e1'/>
    <class-decl name='AAssetDir' size-in-bits='96' is-struct='yes' visibility='default' filepath='frameworks/base/native/android/asset_manager.cpp' line='39' column='1' id='ea9788c3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mAssetDir' type-id='6a6c3f8a' visibility='default' filepath='frameworks/base/native/android/asset_manager.cpp' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mCurFileIndex' type-id='b59d7dce' visibility='default' filepath='frameworks/base/native/android/asset_manager.cpp' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mCachedFileName' type-id='bacf3393' visibility='default' filepath='frameworks/base/native/android/asset_manager.cpp' line='42' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='AAssetDir' mangled-name='_ZN9AAssetDirC2ENSt3__110unique_ptrIN7android8AssetDirENS0_14default_deleteIS3_EEEE' filepath='frameworks/base/native/android/asset_manager.cpp' line='44' column='1' visibility='default' binding='global' size-in-bits='32'>
          <parameter type-id='1cdc10c3' is-artificial='yes'/>
          <parameter type-id='6a6c3f8a'/>
          <return type-id='48b5725f'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='AAssetDir' type-id='ea9788c3' filepath='frameworks/native/include/android/asset_manager.h' line='64' column='1' id='e6c9fab0'/>
    <typedef-decl name='off64_t' type-id='69bf7bee' filepath='bionic/libc/include/sys/types.h' line='107' column='1' id='05d4c620'/>
    <typedef-decl name='loff_t' type-id='537a730e' filepath='bionic/libc/include/sys/types.h' line='106' column='1' id='69bf7bee'/>
    <typedef-decl name='__kernel_loff_t' type-id='1eb56b1e' filepath='bionic/libc/kernel/uapi/asm-generic/posix_types.h' line='76' column='1' id='537a730e'/>
    <pointer-type-def type-id='1fc4034c' size-in-bits='32' id='57d98aaa'/>
    <pointer-type-def type-id='ea9788c3' size-in-bits='32' id='1cdc10c3'/>
    <pointer-type-def type-id='f41387f0' size-in-bits='32' id='081c2b23'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='32' id='822cd80b'/>
    <pointer-type-def type-id='d357872a' size-in-bits='32' id='fae49a1f'/>
    <pointer-type-def type-id='ebc81181' size-in-bits='32' id='c3a70532'/>
    <pointer-type-def type-id='c3a70532' size-in-bits='32' id='17ed04c8'/>
    <pointer-type-def type-id='c9459134' size-in-bits='32' id='71bed232'/>
    <pointer-type-def type-id='440aaf49' size-in-bits='32' id='85c463b1'/>
    <pointer-type-def type-id='2ca86b0d' size-in-bits='32' id='715a5bad'/>
    <pointer-type-def type-id='1e7918a7' size-in-bits='32' id='047d4fff'/>
    <pointer-type-def type-id='eeed1f5d' size-in-bits='32' id='349a45dd'/>
    <pointer-type-def type-id='e53ab91c' size-in-bits='32' id='a5a1fc5a'/>
    <pointer-type-def type-id='530c1a32' size-in-bits='32' id='76b5a6a0'/>
    <pointer-type-def type-id='2e67d715' size-in-bits='32' id='ee3187c5'/>
    <pointer-type-def type-id='a87003ef' size-in-bits='32' id='dda33667'/>
    <pointer-type-def type-id='b0749e8e' size-in-bits='32' id='0faa6e74'/>
    <pointer-type-def type-id='fb46a283' size-in-bits='32' id='15b6e673'/>
    <pointer-type-def type-id='d988e2e8' size-in-bits='32' id='b09bab5e'/>
    <pointer-type-def type-id='baffb083' size-in-bits='32' id='478e3663'/>
    <pointer-type-def type-id='fdf9f098' size-in-bits='32' id='14c7458e'/>
    <pointer-type-def type-id='30a4d497' size-in-bits='32' id='3239e3af'/>
    <pointer-type-def type-id='ae6a1c55' size-in-bits='32' id='e65fd0e5'/>
    <pointer-type-def type-id='07f10124' size-in-bits='32' id='a5fd6882'/>
    <pointer-type-def type-id='27450c90' size-in-bits='32' id='a39ba61d'/>
    <reference-type-def kind='lvalue' type-id='663ed4a0' size-in-bits='32' id='4b4fe04a'/>
    <pointer-type-def type-id='663ed4a0' size-in-bits='32' id='3f4fcd66'/>
    <qualified-type-def type-id='3f4fcd66' const='yes' id='a9c47199'/>
    <reference-type-def kind='lvalue' type-id='a9c47199' size-in-bits='32' id='ff3f0fad'/>
    <reference-type-def kind='lvalue' type-id='3f4fcd66' size-in-bits='32' id='eaa01bc0'/>
    <reference-type-def kind='rvalue' type-id='3f4fcd66' size-in-bits='32' id='400beb12'/>
    <reference-type-def kind='lvalue' type-id='e31c3bd7' size-in-bits='32' id='799fd35b'/>
    <pointer-type-def type-id='e31c3bd7' size-in-bits='32' id='759fcd0f'/>
    <qualified-type-def type-id='759fcd0f' const='yes' id='4c08731c'/>
    <reference-type-def kind='lvalue' type-id='4c08731c' size-in-bits='32' id='eb4d644e'/>
    <reference-type-def kind='lvalue' type-id='759fcd0f' size-in-bits='32' id='538ff78b'/>
    <reference-type-def kind='rvalue' type-id='759fcd0f' size-in-bits='32' id='38a2e557'/>
    <pointer-type-def type-id='32d026f1' size-in-bits='32' id='2ef969b9'/>
    <reference-type-def kind='lvalue' type-id='7c0ac937' size-in-bits='32' id='439855fb'/>
    <pointer-type-def type-id='7c0ac937' size-in-bits='32' id='3f984faf'/>
    <reference-type-def kind='lvalue' type-id='01b8bd0d' size-in-bits='32' id='b8660f99'/>
    <pointer-type-def type-id='01b8bd0d' size-in-bits='32' id='c466227d'/>
    <qualified-type-def type-id='c466227d' const='yes' id='4fda6452'/>
    <reference-type-def kind='lvalue' type-id='4fda6452' size-in-bits='32' id='28cc229c'/>
    <reference-type-def kind='lvalue' type-id='c466227d' size-in-bits='32' id='87c81541'/>
    <reference-type-def kind='lvalue' type-id='238d5c19' size-in-bits='32' id='173b8195'/>
    <pointer-type-def type-id='238d5c19' size-in-bits='32' id='1b3b87e1'/>
    <reference-type-def kind='lvalue' type-id='1bec9f14' size-in-bits='32' id='45e7ebae'/>
    <pointer-type-def type-id='1bec9f14' size-in-bits='32' id='41e7e562'/>
    <qualified-type-def type-id='41e7e562' const='yes' id='a6d138ed'/>
    <reference-type-def kind='lvalue' type-id='a6d138ed' size-in-bits='32' id='665c6791'/>
    <reference-type-def kind='lvalue' type-id='41e7e562' size-in-bits='32' id='040dea0c'/>
    <reference-type-def kind='lvalue' type-id='88bb28ef' size-in-bits='32' id='72c30cf3'/>
    <pointer-type-def type-id='88bb28ef' size-in-bits='32' id='7ec31fd7'/>
    <qualified-type-def type-id='7ec31fd7' const='yes' id='9a153d84'/>
    <reference-type-def kind='lvalue' type-id='9a153d84' size-in-bits='32' id='31700606'/>
    <reference-type-def kind='lvalue' type-id='7ec31fd7' size-in-bits='32' id='7e2b4863'/>
    <pointer-type-def type-id='eb3e39c8' size-in-bits='32' id='567e1fde'/>
    <pointer-type-def type-id='9337857f' size-in-bits='32' id='7ba678e7'/>
    <pointer-type-def type-id='0eedf0a9' size-in-bits='32' id='be739c71'/>
    <pointer-type-def type-id='0c7d43ed' size-in-bits='32' id='737dcd4d'/>
    <reference-type-def kind='lvalue' type-id='61a43bb9' size-in-bits='32' id='114a8bd5'/>
    <pointer-type-def type-id='61a43bb9' size-in-bits='32' id='154a9221'/>
    <qualified-type-def type-id='154a9221' const='yes' id='6f51437e'/>
    <reference-type-def kind='lvalue' type-id='6f51437e' size-in-bits='32' id='94ed0388'/>
    <reference-type-def kind='lvalue' type-id='154a9221' size-in-bits='32' id='8b63e105'/>
    <pointer-type-def type-id='aaa6ccca' size-in-bits='32' id='399793f8'/>
    <pointer-type-def type-id='9c9f3114' size-in-bits='32' id='d8b900b2'/>
    <reference-type-def kind='lvalue' type-id='1ae556e8' size-in-bits='32' id='80661af2'/>
    <pointer-type-def type-id='1ae556e8' size-in-bits='32' id='8466213e'/>
    <pointer-type-def type-id='a1e4e0c1' size-in-bits='32' id='f617f949'/>
    <pointer-type-def type-id='e5242f33' size-in-bits='32' id='cc64c693'/>
    <reference-type-def kind='lvalue' type-id='83ab4f39' size-in-bits='32' id='4ce6d775'/>
    <pointer-type-def type-id='83ab4f39' size-in-bits='32' id='50e6ddc1'/>
    <reference-type-def kind='lvalue' type-id='406f4753' size-in-bits='32' id='665e3247'/>
    <pointer-type-def type-id='406f4753' size-in-bits='32' id='5a5e1f63'/>
    <pointer-type-def type-id='081066a5' size-in-bits='32' id='fb5b9575'/>
    <reference-type-def kind='lvalue' type-id='f8926d95' size-in-bits='32' id='03ec3711'/>
    <pointer-type-def type-id='f8926d95' size-in-bits='32' id='ffec30c5'/>
    <qualified-type-def type-id='ffec30c5' const='yes' id='6e0d67ba'/>
    <reference-type-def kind='lvalue' type-id='6e0d67ba' size-in-bits='32' id='db1a1a94'/>
    <reference-type-def kind='lvalue' type-id='ffec30c5' size-in-bits='32' id='c3d0f559'/>
    <pointer-type-def type-id='28543e70' size-in-bits='32' id='a4a0d016'/>
    <pointer-type-def type-id='0bab9a0f' size-in-bits='32' id='1ecbd0c7'/>
    <reference-type-def kind='lvalue' type-id='c73fabea' size-in-bits='32' id='22923b4c'/>
    <pointer-type-def type-id='c73fabea' size-in-bits='32' id='26924198'/>
    <reference-type-def kind='lvalue' type-id='bacf3393' size-in-bits='32' id='26b0aa17'/>
    <pointer-type-def type-id='bacf3393' size-in-bits='32' id='1ab09733'/>
    <pointer-type-def type-id='90bf4c40' size-in-bits='32' id='23d76c96'/>
    <reference-type-def kind='lvalue' type-id='36a9bc13' size-in-bits='32' id='8cf76667'/>
    <reference-type-def kind='lvalue' type-id='3beaa405' size-in-bits='32' id='315c6611'/>
    <reference-type-def kind='rvalue' type-id='3beaa405' size-in-bits='32' id='eb74e895'/>
    <pointer-type-def type-id='3beaa405' size-in-bits='32' id='2d5c5fc5'/>
    <reference-type-def kind='lvalue' type-id='a84c031d' size-in-bits='32' id='2aa915e1'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='32' id='26a90f95'/>
    <pointer-type-def type-id='26a90f95' size-in-bits='32' id='9b23c9ad'/>
    <reference-type-def kind='lvalue' type-id='801a266d' size-in-bits='32' id='f42a4811'/>
    <pointer-type-def type-id='801a266d' size-in-bits='32' id='f02a41c5'/>
    <pointer-type-def type-id='f02a41c5' size-in-bits='32' id='0185cb3d'/>
    <qualified-type-def type-id='ad414f12' const='yes' id='bebf8fb7'/>
    <pointer-type-def type-id='bebf8fb7' size-in-bits='32' id='e48f1427'/>
    <qualified-type-def type-id='b7b5d51d' const='yes' id='f62c522d'/>
    <pointer-type-def type-id='f62c522d' size-in-bits='32' id='8ec52105'/>
    <qualified-type-def type-id='05502b73' const='yes' id='bc0ea392'/>
    <pointer-type-def type-id='bc0ea392' size-in-bits='32' id='c30bbaa8'/>
    <qualified-type-def type-id='c30bbaa8' const='yes' id='e941ec7b'/>
    <reference-type-def kind='lvalue' type-id='e941ec7b' size-in-bits='32' id='8fc71667'/>
    <pointer-type-def type-id='e941ec7b' size-in-bits='32' id='83c70383'/>
    <reference-type-def kind='lvalue' type-id='c30bbaa8' size-in-bits='32' id='9976ad8a'/>
    <pointer-type-def type-id='c30bbaa8' size-in-bits='32' id='8d769aa6'/>
    <qualified-type-def type-id='8d769aa6' const='yes' id='e7ebc359'/>
    <reference-type-def kind='lvalue' type-id='e7ebc359' size-in-bits='32' id='9724c0ed'/>
    <reference-type-def kind='lvalue' type-id='8d769aa6' size-in-bits='32' id='31b53780'/>
    <qualified-type-def type-id='32d026f1' const='yes' id='3478aa1e'/>
    <reference-type-def kind='lvalue' type-id='3478aa1e' size-in-bits='32' id='d1f3f628'/>
    <pointer-type-def type-id='3478aa1e' size-in-bits='32' id='cdf3efdc'/>
    <qualified-type-def type-id='7c0ac937' const='yes' id='8e56f572'/>
    <reference-type-def kind='lvalue' type-id='8e56f572' size-in-bits='32' id='66e4333c'/>
    <pointer-type-def type-id='8e56f572' size-in-bits='32' id='6ae43988'/>
    <qualified-type-def type-id='01b8bd0d' const='yes' id='da1ad926'/>
    <reference-type-def kind='lvalue' type-id='da1ad926' size-in-bits='32' id='58439b00'/>
    <pointer-type-def type-id='da1ad926' size-in-bits='32' id='6443ade4'/>
    <qualified-type-def type-id='238d5c19' const='yes' id='124b0ffa'/>
    <reference-type-def kind='lvalue' type-id='124b0ffa' size-in-bits='32' id='a829f754'/>
    <qualified-type-def type-id='1bec9f14' const='yes' id='f541dc79'/>
    <reference-type-def kind='lvalue' type-id='f541dc79' size-in-bits='32' id='75ade98d'/>
    <pointer-type-def type-id='f541dc79' size-in-bits='32' id='69add6a9'/>
    <qualified-type-def type-id='88bb28ef' const='yes' id='708139f2'/>
    <reference-type-def kind='lvalue' type-id='708139f2' size-in-bits='32' id='ef6e08bc'/>
    <pointer-type-def type-id='708139f2' size-in-bits='32' id='f36e0f08'/>
    <qualified-type-def type-id='9337857f' const='yes' id='e900403c'/>
    <pointer-type-def type-id='e900403c' size-in-bits='32' id='e164e2a2'/>
    <qualified-type-def type-id='0eedf0a9' const='yes' id='8875171c'/>
    <pointer-type-def type-id='8875171c' size-in-bits='32' id='06538a02'/>
    <qualified-type-def type-id='0c7d43ed' const='yes' id='ded9b194'/>
    <pointer-type-def type-id='ded9b194' size-in-bits='32' id='8eb2ce1a'/>
    <qualified-type-def type-id='2b69792d' const='yes' id='f737af48'/>
    <reference-type-def kind='lvalue' type-id='f737af48' size-in-bits='32' id='9aa92a2a'/>
    <qualified-type-def type-id='61a43bb9' const='yes' id='99894634'/>
    <reference-type-def kind='lvalue' type-id='99894634' size-in-bits='32' id='c5194e56'/>
    <pointer-type-def type-id='99894634' size-in-bits='32' id='d119613a'/>
    <qualified-type-def type-id='aaa6ccca' const='yes' id='3f8580c7'/>
    <reference-type-def kind='lvalue' type-id='3f8580c7' size-in-bits='32' id='e029e233'/>
    <pointer-type-def type-id='3f8580c7' size-in-bits='32' id='ec29f517'/>
    <qualified-type-def type-id='1ae556e8' const='yes' id='cd945871'/>
    <reference-type-def kind='lvalue' type-id='cd945871' size-in-bits='32' id='f78710f5'/>
    <qualified-type-def type-id='4a84961d' const='yes' id='e6f5b684'/>
    <pointer-type-def type-id='e6f5b684' size-in-bits='32' id='42ce93ea'/>
    <qualified-type-def type-id='a1e4e0c1' const='yes' id='cfec3230'/>
    <reference-type-def kind='lvalue' type-id='cfec3230' size-in-bits='32' id='66d2d8a2'/>
    <pointer-type-def type-id='cfec3230' size-in-bits='32' id='6ad2deee'/>
    <qualified-type-def type-id='d5288ede' const='yes' id='18c30a77'/>
    <pointer-type-def type-id='18c30a77' size-in-bits='32' id='58095067'/>
    <qualified-type-def type-id='e5242f33' const='yes' id='3ee779f2'/>
    <reference-type-def kind='lvalue' type-id='3ee779f2' size-in-bits='32' id='da64c8bc'/>
    <pointer-type-def type-id='3ee779f2' size-in-bits='32' id='de64cf08'/>
    <qualified-type-def type-id='83ab4f39' const='yes' id='ddef579c'/>
    <reference-type-def kind='lvalue' type-id='ddef579c' size-in-bits='32' id='19c719ce'/>
    <pointer-type-def type-id='ddef579c' size-in-bits='32' id='15c71382'/>
    <qualified-type-def type-id='406f4753' const='yes' id='a3f5ae0e'/>
    <reference-type-def kind='lvalue' type-id='a3f5ae0e' size-in-bits='32' id='43c128f8'/>
    <qualified-type-def type-id='5da8e894' const='yes' id='d7426f71'/>
    <pointer-type-def type-id='d7426f71' size-in-bits='32' id='38954c41'/>
    <qualified-type-def type-id='081066a5' const='yes' id='364e3bf4'/>
    <pointer-type-def type-id='364e3bf4' size-in-bits='32' id='5b283e7a'/>
    <qualified-type-def type-id='c1dbcc1f' const='yes' id='c76c9474'/>
    <pointer-type-def type-id='c76c9474' size-in-bits='32' id='4ded8ffa'/>
    <qualified-type-def type-id='1ccfdeff' const='yes' id='8897c276'/>
    <reference-type-def kind='lvalue' type-id='8897c276' size-in-bits='32' id='56e6e3f0'/>
    <qualified-type-def type-id='7fd3de76' const='yes' id='edda3635'/>
    <pointer-type-def type-id='edda3635' size-in-bits='32' id='8d8332cd'/>
    <qualified-type-def type-id='f8926d95' const='yes' id='d1018ac0'/>
    <reference-type-def kind='lvalue' type-id='d1018ac0' size-in-bits='32' id='eb6da812'/>
    <pointer-type-def type-id='d1018ac0' size-in-bits='32' id='ef6dae5e'/>
    <qualified-type-def type-id='24d11571' const='yes' id='c12c73fe'/>
    <pointer-type-def type-id='c12c73fe' size-in-bits='32' id='ecfa56bc'/>
    <qualified-type-def type-id='90ba7532' const='yes' id='8a82e18f'/>
    <pointer-type-def type-id='8a82e18f' size-in-bits='32' id='b10936bf'/>
    <qualified-type-def type-id='b10936bf' const='yes' id='81b89a4c'/>
    <qualified-type-def type-id='4504256f' const='yes' id='acf3e156'/>
    <pointer-type-def type-id='acf3e156' size-in-bits='32' id='bfebf634'/>
    <qualified-type-def type-id='bfebf634' const='yes' id='d3e0387f'/>
    <reference-type-def kind='lvalue' type-id='d3e0387f' size-in-bits='32' id='e2f8b41b'/>
    <pointer-type-def type-id='d3e0387f' size-in-bits='32' id='def8adcf'/>
    <reference-type-def kind='lvalue' type-id='bfebf634' size-in-bits='32' id='32745e56'/>
    <pointer-type-def type-id='bfebf634' size-in-bits='32' id='3e74713a'/>
    <qualified-type-def type-id='3e74713a' const='yes' id='ab189805'/>
    <reference-type-def kind='lvalue' type-id='ab189805' size-in-bits='32' id='7ab77f19'/>
    <reference-type-def kind='lvalue' type-id='3e74713a' size-in-bits='32' id='6d4e0f14'/>
    <qualified-type-def type-id='667ba238' const='yes' id='d6321531'/>
    <pointer-type-def type-id='d6321531' size-in-bits='32' id='4bd73981'/>
    <qualified-type-def type-id='28543e70' const='yes' id='c4bcb085'/>
    <reference-type-def kind='lvalue' type-id='c4bcb085' size-in-bits='32' id='580a1099'/>
    <qualified-type-def type-id='66278e1e' const='yes' id='7eb311c3'/>
    <pointer-type-def type-id='7eb311c3' size-in-bits='32' id='5ce531cb'/>
    <qualified-type-def type-id='0bab9a0f' const='yes' id='03c8f004'/>
    <reference-type-def kind='lvalue' type-id='03c8f004' size-in-bits='32' id='17520586'/>
    <qualified-type-def type-id='aa001fba' const='yes' id='1a672873'/>
    <pointer-type-def type-id='1a672873' size-in-bits='32' id='e964841b'/>
    <qualified-type-def type-id='c73fabea' const='yes' id='a3cec311'/>
    <reference-type-def kind='lvalue' type-id='a3cec311' size-in-bits='32' id='157d4f95'/>
    <pointer-type-def type-id='a3cec311' size-in-bits='32' id='197d55e1'/>
    <qualified-type-def type-id='bacf3393' const='yes' id='745c9152'/>
    <reference-type-def kind='lvalue' type-id='745c9152' size-in-bits='32' id='a1b8f99c'/>
    <pointer-type-def type-id='745c9152' size-in-bits='32' id='a5b8ffe8'/>
    <qualified-type-def type-id='90bf4c40' const='yes' id='f36454e9'/>
    <pointer-type-def type-id='f36454e9' size-in-bits='32' id='e9f16ef9'/>
    <qualified-type-def type-id='36a9bc13' const='yes' id='a231f7f4'/>
    <pointer-type-def type-id='a231f7f4' size-in-bits='32' id='32a9327a'/>
    <qualified-type-def type-id='86634f01' const='yes' id='5d1a6276'/>
    <pointer-type-def type-id='5d1a6276' size-in-bits='32' id='ec88d6d4'/>
    <qualified-type-def type-id='3beaa405' const='yes' id='36819e5e'/>
    <reference-type-def kind='lvalue' type-id='36819e5e' size-in-bits='32' id='460c76e8'/>
    <pointer-type-def type-id='36819e5e' size-in-bits='32' id='420c709c'/>
    <qualified-type-def type-id='c894953d' const='yes' id='4ab96a04'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <reference-type-def kind='lvalue' type-id='9b45d938' size-in-bits='32' id='8cf4ca3a'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='32' id='80f4b756'/>
    <pointer-type-def type-id='055a6f41' size-in-bits='32' id='08565ebd'/>
    <pointer-type-def type-id='80f4b756' size-in-bits='32' id='7d3cd834'/>
    <qualified-type-def type-id='801a266d' const='yes' id='e7c31614'/>
    <reference-type-def kind='lvalue' type-id='e7c31614' size-in-bits='32' id='0a1bf0b6'/>
    <pointer-type-def type-id='e7c31614' size-in-bits='32' id='161c039a'/>
    <qualified-type-def type-id='a846fc93' const='yes' id='eb5b5ff2'/>
    <pointer-type-def type-id='eb5b5ff2' size-in-bits='32' id='58d7e108'/>
    <qualified-type-def type-id='a6c45d85' const='yes' id='73f3791e'/>
    <reference-type-def kind='lvalue' type-id='73f3791e' size-in-bits='32' id='c047d328'/>
    <qualified-type-def type-id='e322b6ef' const='yes' id='59d28eff'/>
    <pointer-type-def type-id='59d28eff' size-in-bits='32' id='3b76d94f'/>
    <qualified-type-def type-id='95e97e5e' const='yes' id='2448a865'/>
    <reference-type-def kind='lvalue' type-id='2448a865' size-in-bits='32' id='6160e179'/>
    <pointer-type-def type-id='2448a865' size-in-bits='32' id='6d60f45d'/>
    <qualified-type-def type-id='cc6e09ca' const='yes' id='5fa8a65a'/>
    <pointer-type-def type-id='5fa8a65a' size-in-bits='32' id='067e0250'/>
    <qualified-type-def type-id='adf18958' const='yes' id='3ebf19c8'/>
    <pointer-type-def type-id='3ebf19c8' size-in-bits='32' id='a8d5bec6'/>
    <qualified-type-def type-id='8dfe2e06' const='yes' id='9bf2d596'/>
    <pointer-type-def type-id='9bf2d596' size-in-bits='32' id='3b4676f4'/>
    <pointer-type-def type-id='b3d5cbab' size-in-bits='32' id='e5a87447'/>
    <qualified-type-def type-id='973e3c3f' const='yes' id='8bac99cf'/>
    <pointer-type-def type-id='8bac99cf' size-in-bits='32' id='c5b6437f'/>
    <qualified-type-def type-id='1a7fe6b0' const='yes' id='af8c6a20'/>
    <pointer-type-def type-id='af8c6a20' size-in-bits='32' id='640aedbe'/>
    <qualified-type-def type-id='0b9c02cb' const='yes' id='897a51fb'/>
    <pointer-type-def type-id='897a51fb' size-in-bits='32' id='3c8ecc03'/>
    <qualified-type-def type-id='c8745fdc' const='yes' id='7c1d680c'/>
    <pointer-type-def type-id='7c1d680c' size-in-bits='32' id='884af3d2'/>
    <qualified-type-def type-id='9a10f134' const='yes' id='c17f92e4'/>
    <pointer-type-def type-id='c17f92e4' size-in-bits='32' id='69d41a4a'/>
    <qualified-type-def type-id='0994533b' const='yes' id='a981db8b'/>
    <pointer-type-def type-id='a981db8b' size-in-bits='32' id='786cbe73'/>
    <qualified-type-def type-id='3d7d8cbf' const='yes' id='7411c98f'/>
    <pointer-type-def type-id='7411c98f' size-in-bits='32' id='5d006ebf'/>
    <qualified-type-def type-id='b59d7dce' const='yes' id='d0fa5dde'/>
    <qualified-type-def type-id='143a6b6e' const='yes' id='5919835e'/>
    <qualified-type-def type-id='c3e90ce7' const='yes' id='f49e9570'/>
    <pointer-type-def type-id='f49e9570' size-in-bits='32' id='6fa51cae'/>
    <qualified-type-def type-id='60f5da7d' const='yes' id='69dda76c'/>
    <reference-type-def kind='lvalue' type-id='69dda76c' size-in-bits='32' id='f1ee597e'/>
    <pointer-type-def type-id='69dda76c' size-in-bits='32' id='edee5332'/>
    <qualified-type-def type-id='36028ca6' const='yes' id='2a263436'/>
    <reference-type-def kind='lvalue' type-id='2a263436' size-in-bits='32' id='6a23f530'/>
    <qualified-type-def type-id='97941460' const='yes' id='ef733b59'/>
    <reference-type-def kind='lvalue' type-id='ef733b59' size-in-bits='32' id='7166a8ed'/>
    <pointer-type-def type-id='ef733b59' size-in-bits='32' id='65669609'/>
    <qualified-type-def type-id='2b91c1c3' const='yes' id='c201d133'/>
    <reference-type-def kind='lvalue' type-id='c201d133' size-in-bits='32' id='7ddc240f'/>
    <qualified-type-def type-id='64fb4db3' const='yes' id='ac63f41a'/>
    <reference-type-def kind='lvalue' type-id='ac63f41a' size-in-bits='32' id='9d597a74'/>
    <pointer-type-def type-id='ac63f41a' size-in-bits='32' id='91596790'/>
    <qualified-type-def type-id='88715d90' const='yes' id='5d8ecf60'/>
    <reference-type-def kind='lvalue' type-id='5d8ecf60' size-in-bits='32' id='8dd04b32'/>
    <qualified-type-def type-id='c8491dd8' const='yes' id='cce517cd'/>
    <reference-type-def kind='lvalue' type-id='cce517cd' size-in-bits='32' id='77a4a6f1'/>
    <pointer-type-def type-id='cce517cd' size-in-bits='32' id='73a4a0a5'/>
    <qualified-type-def type-id='cb386317' const='yes' id='69496ea7'/>
    <reference-type-def kind='lvalue' type-id='69496ea7' size-in-bits='32' id='3f98f513'/>
    <qualified-type-def type-id='ba4fbcc4' const='yes' id='e5685f15'/>
    <pointer-type-def type-id='e5685f15' size-in-bits='32' id='624df02d'/>
    <qualified-type-def type-id='2ef4b79c' const='yes' id='015c2579'/>
    <pointer-type-def type-id='015c2579' size-in-bits='32' id='770ec1a9'/>
    <qualified-type-def type-id='37dd8aae' const='yes' id='67f2d1ad'/>
    <pointer-type-def type-id='67f2d1ad' size-in-bits='32' id='2a3fd785'/>
    <qualified-type-def type-id='e015e2ec' const='yes' id='c6f082e7'/>
    <pointer-type-def type-id='c6f082e7' size-in-bits='32' id='f99de8b7'/>
    <qualified-type-def type-id='f045688c' const='yes' id='d14d7547'/>
    <pointer-type-def type-id='d14d7547' size-in-bits='32' id='e9efda97'/>
    <qualified-type-def type-id='94df1ca8' const='yes' id='1afeb553'/>
    <pointer-type-def type-id='1afeb553' size-in-bits='32' id='f7f7ad7b'/>
    <qualified-type-def type-id='43b7c228' const='yes' id='8b04234b'/>
    <pointer-type-def type-id='8b04234b' size-in-bits='32' id='3883b1b3'/>
    <qualified-type-def type-id='1988293c' const='yes' id='f6040e8d'/>
    <pointer-type-def type-id='f6040e8d' size-in-bits='32' id='ef6310e5'/>
    <qualified-type-def type-id='c01a67f4' const='yes' id='09a4ff6d'/>
    <pointer-type-def type-id='09a4ff6d' size-in-bits='32' id='75bddcc5'/>
    <qualified-type-def type-id='ec22f6fc' const='yes' id='24105c05'/>
    <pointer-type-def type-id='24105c05' size-in-bits='32' id='f4c11dfd'/>
    <qualified-type-def type-id='58870df2' const='yes' id='75d6bfad'/>
    <pointer-type-def type-id='75d6bfad' size-in-bits='32' id='080f8185'/>
    <qualified-type-def type-id='d22df4cd' const='yes' id='22034760'/>
    <pointer-type-def type-id='22034760' size-in-bits='32' id='d529397e'/>
    <qualified-type-def type-id='2622dfea' const='yes' id='c65b3cdf'/>
    <pointer-type-def type-id='c65b3cdf' size-in-bits='32' id='36a0f5af'/>
    <qualified-type-def type-id='39b8e88f' const='yes' id='cf5e3b94'/>
    <pointer-type-def type-id='cf5e3b94' size-in-bits='32' id='2f580c1a'/>
    <qualified-type-def type-id='97d0af14' const='yes' id='b1012a03'/>
    <pointer-type-def type-id='b1012a03' size-in-bits='32' id='cdd55e8b'/>
    <qualified-type-def type-id='7d3bb31a' const='yes' id='a006bbcf'/>
    <pointer-type-def type-id='a006bbcf' size-in-bits='32' id='cf99c97f'/>
    <qualified-type-def type-id='5fea02b3' const='yes' id='c60b39d6'/>
    <pointer-type-def type-id='c60b39d6' size-in-bits='32' id='bfac47b4'/>
    <qualified-type-def type-id='063dbdb6' const='yes' id='b6f04613'/>
    <pointer-type-def type-id='b6f04613' size-in-bits='32' id='353e8bbb'/>
    <qualified-type-def type-id='45b74b57' const='yes' id='71926ae2'/>
    <pointer-type-def type-id='71926ae2' size-in-bits='32' id='917e18d8'/>
    <qualified-type-def type-id='ffcdd1b2' const='yes' id='6ac16f07'/>
    <pointer-type-def type-id='6ac16f07' size-in-bits='32' id='3b8203d7'/>
    <qualified-type-def type-id='cd354cef' const='yes' id='7496d49a'/>
    <pointer-type-def type-id='7496d49a' size-in-bits='32' id='3970d110'/>
    <qualified-type-def type-id='7dee695e' const='yes' id='3c3515cb'/>
    <pointer-type-def type-id='3c3515cb' size-in-bits='32' id='a8917133'/>
    <qualified-type-def type-id='f03ebc7b' const='yes' id='276c3586'/>
    <pointer-type-def type-id='276c3586' size-in-bits='32' id='bb587dc4'/>
    <qualified-type-def type-id='678452de' const='yes' id='977f3b95'/>
    <pointer-type-def type-id='977f3b95' size-in-bits='32' id='3c4b0dad'/>
    <qualified-type-def type-id='8d3c18f6' const='yes' id='87af503d'/>
    <pointer-type-def type-id='87af503d' size-in-bits='32' id='affb1435'/>
    <qualified-type-def type-id='c24f72a3' const='yes' id='8469f184'/>
    <pointer-type-def type-id='8469f184' size-in-bits='32' id='20c774ea'/>
    <qualified-type-def type-id='e8967c46' const='yes' id='2d9d9a2b'/>
    <pointer-type-def type-id='2d9d9a2b' size-in-bits='32' id='d0196f93'/>
    <qualified-type-def type-id='e83f8f8d' const='yes' id='da7f0da8'/>
    <pointer-type-def type-id='da7f0da8' size-in-bits='32' id='780243a6'/>
    <qualified-type-def type-id='057d9591' const='yes' id='fe8749ec'/>
    <pointer-type-def type-id='fe8749ec' size-in-bits='32' id='74f922b2'/>
    <qualified-type-def type-id='7312e504' const='yes' id='125981d9'/>
    <pointer-type-def type-id='125981d9' size-in-bits='32' id='d5e79189'/>
    <qualified-type-def type-id='49a21e67' const='yes' id='72ff7e9a'/>
    <pointer-type-def type-id='72ff7e9a' size-in-bits='32' id='b8346f10'/>
    <qualified-type-def type-id='8b54feb4' const='yes' id='1f0a3e4d'/>
    <pointer-type-def type-id='1f0a3e4d' size-in-bits='32' id='44203c25'/>
    <qualified-type-def type-id='227041e1' const='yes' id='6cd37428'/>
    <pointer-type-def type-id='6cd37428' size-in-bits='32' id='52df9f26'/>
    <qualified-type-def type-id='9c4a3aff' const='yes' id='12249962'/>
    <pointer-type-def type-id='12249962' size-in-bits='32' id='d79d4c58'/>
    <qualified-type-def type-id='22e56ec2' const='yes' id='f2757f09'/>
    <pointer-type-def type-id='f2757f09' size-in-bits='32' id='d1f72419'/>
    <qualified-type-def type-id='b5df5bdc' const='yes' id='345edb2f'/>
    <pointer-type-def type-id='345edb2f' size-in-bits='32' id='7652c8df'/>
    <qualified-type-def type-id='3b4d4373' const='yes' id='df0e4d26'/>
    <pointer-type-def type-id='df0e4d26' size-in-bits='32' id='2f8349e4'/>
    <qualified-type-def type-id='277bc372' const='yes' id='11f3caa3'/>
    <pointer-type-def type-id='11f3caa3' size-in-bits='32' id='cbc7d5ab'/>
    <qualified-type-def type-id='aa3451ec' const='yes' id='f3e176c1'/>
    <pointer-type-def type-id='f3e176c1' size-in-bits='32' id='d6ee33f1'/>
    <qualified-type-def type-id='e4d4d078' const='yes' id='8e013285'/>
    <pointer-type-def type-id='8e013285' size-in-bits='32' id='3ae2c97d'/>
    <qualified-type-def type-id='63c7c233' const='yes' id='76ba5c4c'/>
    <pointer-type-def type-id='76ba5c4c' size-in-bits='32' id='4d5f7492'/>
    <qualified-type-def type-id='7c4db7cf' const='yes' id='d319d718'/>
    <pointer-type-def type-id='d319d718' size-in-bits='32' id='83adc3b6'/>
    <qualified-type-def type-id='6932bb90' const='yes' id='087cb129'/>
    <pointer-type-def type-id='087cb129' size-in-bits='32' id='5f4aa7b9'/>
    <qualified-type-def type-id='9884ef0e' const='yes' id='2f73bc05'/>
    <pointer-type-def type-id='2f73bc05' size-in-bits='32' id='e2313dfd'/>
    <qualified-type-def type-id='cd94fd85' const='yes' id='58db0cca'/>
    <pointer-type-def type-id='58db0cca' size-in-bits='32' id='c0d544a0'/>
    <qualified-type-def type-id='77d669a5' const='yes' id='0ee51430'/>
    <pointer-type-def type-id='0ee51430' size-in-bits='32' id='8c9ea4ee'/>
    <qualified-type-def type-id='a885088e' const='yes' id='5be8d6e7'/>
    <pointer-type-def type-id='5be8d6e7' size-in-bits='32' id='7c8a24b7'/>
    <qualified-type-def type-id='7b346a3f' const='yes' id='0c18ac26'/>
    <pointer-type-def type-id='0c18ac26' size-in-bits='32' id='16d6d6e4'/>
    <qualified-type-def type-id='ff06e1a2' const='yes' id='0cdc9f13'/>
    <pointer-type-def type-id='0cdc9f13' size-in-bits='32' id='784ea6bb'/>
    <qualified-type-def type-id='c230c56f' const='yes' id='65c590da'/>
    <pointer-type-def type-id='65c590da' size-in-bits='32' id='260329d0'/>
    <qualified-type-def type-id='a3175723' const='yes' id='f98533c0'/>
    <pointer-type-def type-id='f98533c0' size-in-bits='32' id='b6b0b95e'/>
    <qualified-type-def type-id='c6d12234' const='yes' id='6ec1638d'/>
    <pointer-type-def type-id='6ec1638d' size-in-bits='32' id='016fdfe5'/>
    <qualified-type-def type-id='6fb577ee' const='yes' id='7ea2111d'/>
    <pointer-type-def type-id='7ea2111d' size-in-bits='32' id='90211995'/>
    <qualified-type-def type-id='7873fb6d' const='yes' id='7ea4faa4'/>
    <pointer-type-def type-id='7ea4faa4' size-in-bits='32' id='ebb66d8a'/>
    <qualified-type-def type-id='34bedffd' const='yes' id='1f86947e'/>
    <pointer-type-def type-id='1f86947e' size-in-bits='32' id='f4db803c'/>
    <qualified-type-def type-id='37ff4804' const='yes' id='35bcf4e5'/>
    <pointer-type-def type-id='35bcf4e5' size-in-bits='32' id='677561dd'/>
    <qualified-type-def type-id='225e915e' const='yes' id='b1eb09e5'/>
    <pointer-type-def type-id='b1eb09e5' size-in-bits='32' id='e40070dd'/>
    <qualified-type-def type-id='1d6097d7' const='yes' id='96975fe0'/>
    <pointer-type-def type-id='96975fe0' size-in-bits='32' id='da4bcafe'/>
    <qualified-type-def type-id='9e7f15b0' const='yes' id='6c45eba1'/>
    <pointer-type-def type-id='6c45eba1' size-in-bits='32' id='fd11cbd1'/>
    <qualified-type-def type-id='70ed5ac7' const='yes' id='30307126'/>
    <pointer-type-def type-id='30307126' size-in-bits='32' id='e841f5e4'/>
    <qualified-type-def type-id='7068a110' const='yes' id='ef66f589'/>
    <pointer-type-def type-id='ef66f589' size-in-bits='32' id='8214af99'/>
    <qualified-type-def type-id='e771cfad' const='yes' id='648520a6'/>
    <pointer-type-def type-id='648520a6' size-in-bits='32' id='c9923c64'/>
    <qualified-type-def type-id='3efb2c0e' const='yes' id='9b0b4955'/>
    <pointer-type-def type-id='9b0b4955' size-in-bits='32' id='91c4b2ed'/>
    <qualified-type-def type-id='8288923d' const='yes' id='059b4a0a'/>
    <pointer-type-def type-id='059b4a0a' size-in-bits='32' id='f375b060'/>
    <qualified-type-def type-id='5a2afa10' const='yes' id='ea081829'/>
    <pointer-type-def type-id='ea081829' size-in-bits='32' id='6dbdccb9'/>
    <qualified-type-def type-id='f9da37d1' const='yes' id='c4e41a24'/>
    <pointer-type-def type-id='c4e41a24' size-in-bits='32' id='0115040a'/>
    <qualified-type-def type-id='5e03174f' const='yes' id='54209a76'/>
    <pointer-type-def type-id='54209a76' size-in-bits='32' id='cb52fed4'/>
    <qualified-type-def type-id='56dccc53' const='yes' id='19234ae2'/>
    <pointer-type-def type-id='19234ae2' size-in-bits='32' id='5a8eb8d8'/>
    <qualified-type-def type-id='02c104af' const='yes' id='e025c302'/>
    <pointer-type-def type-id='e025c302' size-in-bits='32' id='037237f8'/>
    <qualified-type-def type-id='bae33ff3' const='yes' id='d3fde2a2'/>
    <pointer-type-def type-id='d3fde2a2' size-in-bits='32' id='40ab9c18'/>
    <qualified-type-def type-id='d9fbed1c' const='yes' id='21ccd5f1'/>
    <pointer-type-def type-id='21ccd5f1' size-in-bits='32' id='1074a7c1'/>
    <qualified-type-def type-id='ed8c4278' const='yes' id='ac6cb785'/>
    <pointer-type-def type-id='ac6cb785' size-in-bits='32' id='1e25287d'/>
    <qualified-type-def type-id='f2c63883' const='yes' id='6afdde7c'/>
    <pointer-type-def type-id='6afdde7c' size-in-bits='32' id='c3a50162'/>
    <qualified-type-def type-id='51ebade8' const='yes' id='1689900b'/>
    <pointer-type-def type-id='1689900b' size-in-bits='32' id='9b8de3f3'/>
    <qualified-type-def type-id='62ec4a33' const='yes' id='6d3d4e7e'/>
    <pointer-type-def type-id='6d3d4e7e' size-in-bits='32' id='4b824e3c'/>
    <qualified-type-def type-id='1adfd3e6' const='yes' id='eb12177b'/>
    <pointer-type-def type-id='eb12177b' size-in-bits='32' id='5e7ab483'/>
    <qualified-type-def type-id='95757501' const='yes' id='50003bd4'/>
    <pointer-type-def type-id='50003bd4' size-in-bits='32' id='ee5e70da'/>
    <qualified-type-def type-id='b284e6e2' const='yes' id='3ee218a3'/>
    <pointer-type-def type-id='3ee218a3' size-in-bits='32' id='86ec9fab'/>
    <qualified-type-def type-id='2a699f96' const='yes' id='c014b171'/>
    <pointer-type-def type-id='c014b171' size-in-bits='32' id='bb933241'/>
    <qualified-type-def type-id='579722ef' const='yes' id='0adb7b58'/>
    <pointer-type-def type-id='0adb7b58' size-in-bits='32' id='89835476'/>
    <qualified-type-def type-id='adb0d72c' const='yes' id='1b4f6e3b'/>
    <pointer-type-def type-id='1b4f6e3b' size-in-bits='32' id='0f0a44c3'/>
    <qualified-type-def type-id='6e3f46eb' const='yes' id='3e21fc54'/>
    <pointer-type-def type-id='3e21fc54' size-in-bits='32' id='4d807a5a'/>
    <qualified-type-def type-id='fcbd9376' const='yes' id='c9adb00b'/>
    <pointer-type-def type-id='c9adb00b' size-in-bits='32' id='9d6c43f3'/>
    <qualified-type-def type-id='dd0abe4a' const='yes' id='080132d3'/>
    <pointer-type-def type-id='080132d3' size-in-bits='32' id='92e33dfb'/>
    <qualified-type-def type-id='0713c6a2' const='yes' id='456e0be5'/>
    <pointer-type-def type-id='456e0be5' size-in-bits='32' id='1b3c96dd'/>
    <qualified-type-def type-id='8d9552b9' const='yes' id='b7cd56ac'/>
    <pointer-type-def type-id='b7cd56ac' size-in-bits='32' id='de3f34f2'/>
    <qualified-type-def type-id='20704346' const='yes' id='24afc245'/>
    <pointer-type-def type-id='24afc245' size-in-bits='32' id='2faf14bd'/>
    <qualified-type-def type-id='abfeb1fe' const='yes' id='6bf2fba5'/>
    <pointer-type-def type-id='6bf2fba5' size-in-bits='32' id='7e82021d'/>
    <qualified-type-def type-id='8051cbec' const='yes' id='9fae01b1'/>
    <pointer-type-def type-id='9fae01b1' size-in-bits='32' id='f9ec8701'/>
    <qualified-type-def type-id='488eea75' const='yes' id='bf476b8e'/>
    <reference-type-def kind='lvalue' type-id='bf476b8e' size-in-bits='32' id='c56e7978'/>
    <pointer-type-def type-id='bf476b8e' size-in-bits='32' id='c16e732c'/>
    <qualified-type-def type-id='1c507e8b' const='yes' id='e0629c3e'/>
    <pointer-type-def type-id='e0629c3e' size-in-bits='32' id='4f3bb37c'/>
    <qualified-type-def type-id='783dcbfa' const='yes' id='3d1f4bea'/>
    <reference-type-def kind='lvalue' type-id='3d1f4bea' size-in-bits='32' id='04445224'/>
    <qualified-type-def type-id='6e0a00e4' const='yes' id='472db454'/>
    <reference-type-def kind='lvalue' type-id='472db454' size-in-bits='32' id='7ef30f76'/>
    <qualified-type-def type-id='75cb783b' const='yes' id='1976b22b'/>
    <reference-type-def kind='lvalue' type-id='1976b22b' size-in-bits='32' id='22da4a77'/>
    <qualified-type-def type-id='080ca977' const='yes' id='f4e8e3e7'/>
    <reference-type-def kind='lvalue' type-id='f4e8e3e7' size-in-bits='32' id='4b9e88d3'/>
    <qualified-type-def type-id='dd7f74c0' const='yes' id='f7d6ffd0'/>
    <reference-type-def kind='lvalue' type-id='f7d6ffd0' size-in-bits='32' id='1d74f042'/>
    <qualified-type-def type-id='4ee99380' const='yes' id='99887a50'/>
    <reference-type-def kind='lvalue' type-id='99887a50' size-in-bits='32' id='27d8c7c2'/>
    <qualified-type-def type-id='8bef0de9' const='yes' id='ff7984d9'/>
    <reference-type-def kind='lvalue' type-id='ff7984d9' size-in-bits='32' id='2b4c5d6d'/>
    <qualified-type-def type-id='61dc8fcd' const='yes' id='0987ce3d'/>
    <reference-type-def kind='lvalue' type-id='0987ce3d' size-in-bits='32' id='1bc97481'/>
    <qualified-type-def type-id='a8372230' const='yes' id='76bdcf40'/>
    <reference-type-def kind='lvalue' type-id='76bdcf40' size-in-bits='32' id='52cd7d92'/>
    <qualified-type-def type-id='cd3d9869' const='yes' id='9279d319'/>
    <reference-type-def kind='lvalue' type-id='9279d319' size-in-bits='32' id='d4c78c2d'/>
    <qualified-type-def type-id='beafe2f0' const='yes' id='ea011200'/>
    <reference-type-def kind='lvalue' type-id='ea011200' size-in-bits='32' id='85af91d2'/>
    <qualified-type-def type-id='bc902aeb' const='yes' id='64016f24'/>
    <reference-type-def kind='lvalue' type-id='64016f24' size-in-bits='32' id='7041c026'/>
    <pointer-type-def type-id='64016f24' size-in-bits='32' id='7c41d30a'/>
    <qualified-type-def type-id='20a793a2' const='yes' id='d986cfad'/>
    <reference-type-def kind='lvalue' type-id='d986cfad' size-in-bits='32' id='fa38b7d1'/>
    <pointer-type-def type-id='d986cfad' size-in-bits='32' id='f638b185'/>
    <qualified-type-def type-id='4b7d2285' const='yes' id='f2ba7f4a'/>
    <reference-type-def kind='lvalue' type-id='f2ba7f4a' size-in-bits='32' id='87969704'/>
    <pointer-type-def type-id='f2ba7f4a' size-in-bits='32' id='7b968420'/>
    <qualified-type-def type-id='7194074a' const='yes' id='078f62bd'/>
    <reference-type-def kind='lvalue' type-id='078f62bd' size-in-bits='32' id='81b83a01'/>
    <pointer-type-def type-id='078f62bd' size-in-bits='32' id='7db833b5'/>
    <qualified-type-def type-id='568a771a' const='yes' id='a96f9975'/>
    <reference-type-def kind='lvalue' type-id='a96f9975' size-in-bits='32' id='0dae5da9'/>
    <pointer-type-def type-id='a96f9975' size-in-bits='32' id='19ae708d'/>
    <qualified-type-def type-id='602ad079' const='yes' id='ade0f876'/>
    <reference-type-def kind='lvalue' type-id='ade0f876' size-in-bits='32' id='0926e5f0'/>
    <pointer-type-def type-id='ade0f876' size-in-bits='32' id='1526f8d4'/>
    <qualified-type-def type-id='581cf3d8' const='yes' id='cec93afb'/>
    <reference-type-def kind='lvalue' type-id='cec93afb' size-in-bits='32' id='63c7a9e7'/>
    <pointer-type-def type-id='cec93afb' size-in-bits='32' id='57c79703'/>
    <qualified-type-def type-id='f76a9935' const='yes' id='93f1ab6e'/>
    <reference-type-def kind='lvalue' type-id='93f1ab6e' size-in-bits='32' id='2d70a258'/>
    <pointer-type-def type-id='93f1ab6e' size-in-bits='32' id='29709c0c'/>
    <qualified-type-def type-id='0b8a9bd4' const='yes' id='88613de9'/>
    <reference-type-def kind='lvalue' type-id='88613de9' size-in-bits='32' id='80144cdd'/>
    <pointer-type-def type-id='88613de9' size-in-bits='32' id='741439f9'/>
    <qualified-type-def type-id='62aa33b1' const='yes' id='f4d25f61'/>
    <reference-type-def kind='lvalue' type-id='f4d25f61' size-in-bits='32' id='ae2bfcc5'/>
    <qualified-type-def type-id='000c67ad' const='yes' id='3837acdd'/>
    <reference-type-def kind='lvalue' type-id='3837acdd' size-in-bits='32' id='7aa54f21'/>
    <qualified-type-def type-id='313519b3' const='yes' id='d89da583'/>
    <reference-type-def kind='lvalue' type-id='d89da583' size-in-bits='32' id='a52bc2bf'/>
    <qualified-type-def type-id='2bc53136' const='yes' id='118b8c86'/>
    <reference-type-def kind='lvalue' type-id='118b8c86' size-in-bits='32' id='3eae5fe0'/>
    <qualified-type-def type-id='b6dd31e7' const='yes' id='8a3233d7'/>
    <reference-type-def kind='lvalue' type-id='8a3233d7' size-in-bits='32' id='7e07c463'/>
    <qualified-type-def type-id='b069d066' const='yes' id='f4e4a967'/>
    <reference-type-def kind='lvalue' type-id='f4e4a967' size-in-bits='32' id='c4f67153'/>
    <pointer-type-def type-id='f4e4a967' size-in-bits='32' id='d0f68437'/>
    <qualified-type-def type-id='9a111c97' const='yes' id='3993a887'/>
    <reference-type-def kind='lvalue' type-id='3993a887' size-in-bits='32' id='44727573'/>
    <qualified-type-def type-id='ddf0159f' const='yes' id='8121830f'/>
    <reference-type-def kind='lvalue' type-id='8121830f' size-in-bits='32' id='70c1798b'/>
    <qualified-type-def type-id='60bf8975' const='yes' id='443e9945'/>
    <reference-type-def kind='lvalue' type-id='443e9945' size-in-bits='32' id='d18b76d9'/>
    <qualified-type-def type-id='a36ba8bc' const='yes' id='6e0d5e0c'/>
    <reference-type-def kind='lvalue' type-id='6e0d5e0c' size-in-bits='32' id='690b3c1e'/>
    <qualified-type-def type-id='1ccf4229' const='yes' id='348a6b59'/>
    <reference-type-def kind='lvalue' type-id='348a6b59' size-in-bits='32' id='34e738ed'/>
    <qualified-type-def type-id='16cfbc82' const='yes' id='83b16c13'/>
    <reference-type-def kind='lvalue' type-id='83b16c13' size-in-bits='32' id='854d576f'/>
    <pointer-type-def type-id='83b16c13' size-in-bits='32' id='894d5dbb'/>
    <qualified-type-def type-id='7c84f63b' const='yes' id='617ec4eb'/>
    <reference-type-def kind='lvalue' type-id='617ec4eb' size-in-bits='32' id='478fceb7'/>
    <qualified-type-def type-id='bbda45fb' const='yes' id='586f4fab'/>
    <reference-type-def kind='lvalue' type-id='586f4fab' size-in-bits='32' id='c43a3af7'/>
    <qualified-type-def type-id='59a35081' const='yes' id='7b92a5d1'/>
    <reference-type-def kind='lvalue' type-id='7b92a5d1' size-in-bits='32' id='7edb43d5'/>
    <qualified-type-def type-id='4d712c30' const='yes' id='6258b600'/>
    <reference-type-def kind='lvalue' type-id='6258b600' size-in-bits='32' id='f7a6bdd2'/>
    <qualified-type-def type-id='86683135' const='yes' id='c0f913e5'/>
    <reference-type-def kind='lvalue' type-id='c0f913e5' size-in-bits='32' id='8b1a1bf9'/>
    <qualified-type-def type-id='d6a92829' const='yes' id='c956a398'/>
    <reference-type-def kind='lvalue' type-id='c956a398' size-in-bits='32' id='b163c41a'/>
    <pointer-type-def type-id='c956a398' size-in-bits='32' id='a563b136'/>
    <qualified-type-def type-id='2e0a8ef4' const='yes' id='3e657124'/>
    <reference-type-def kind='lvalue' type-id='3e657124' size-in-bits='32' id='3bb0e626'/>
    <qualified-type-def type-id='47800e14' const='yes' id='7ed06cc4'/>
    <reference-type-def kind='lvalue' type-id='7ed06cc4' size-in-bits='32' id='841b67c6'/>
    <qualified-type-def type-id='07ec7282' const='yes' id='e54f5fd2'/>
    <reference-type-def kind='lvalue' type-id='e54f5fd2' size-in-bits='32' id='eff40d1c'/>
    <qualified-type-def type-id='52fb1fd3' const='yes' id='744d9a23'/>
    <reference-type-def kind='lvalue' type-id='744d9a23' size-in-bits='32' id='1b2975df'/>
    <qualified-type-def type-id='71b7128c' const='yes' id='bbc92c3c'/>
    <reference-type-def kind='lvalue' type-id='bbc92c3c' size-in-bits='32' id='b7b06cee'/>
    <qualified-type-def type-id='874fd690' const='yes' id='97b7164d'/>
    <reference-type-def kind='lvalue' type-id='97b7164d' size-in-bits='32' id='40384a71'/>
    <pointer-type-def type-id='97b7164d' size-in-bits='32' id='3c384425'/>
    <qualified-type-def type-id='ee02cccf' const='yes' id='ada16e66'/>
    <reference-type-def kind='lvalue' type-id='ada16e66' size-in-bits='32' id='95208ec0'/>
    <pointer-type-def type-id='ada16e66' size-in-bits='32' id='a120a1a4'/>
    <qualified-type-def type-id='c5316456' const='yes' id='b2500fff'/>
    <reference-type-def kind='lvalue' type-id='b2500fff' size-in-bits='32' id='8d08f29b'/>
    <pointer-type-def type-id='b2500fff' size-in-bits='32' id='8908ec4f'/>
    <qualified-type-def type-id='2c8660ce' const='yes' id='66c45ba7'/>
    <reference-type-def kind='lvalue' type-id='66c45ba7' size-in-bits='32' id='481c0c13'/>
    <pointer-type-def type-id='66c45ba7' size-in-bits='32' id='541c1ef7'/>
    <qualified-type-def type-id='92024495' const='yes' id='20ab0c9e'/>
    <reference-type-def kind='lvalue' type-id='20ab0c9e' size-in-bits='32' id='254505a8'/>
    <pointer-type-def type-id='20ab0c9e' size-in-bits='32' id='2144ff5c'/>
    <qualified-type-def type-id='16537306' const='yes' id='5cdd9e9d'/>
    <reference-type-def kind='lvalue' type-id='5cdd9e9d' size-in-bits='32' id='ebe0e061'/>
    <pointer-type-def type-id='5cdd9e9d' size-in-bits='32' id='e7e0da15'/>
    <qualified-type-def type-id='60e02119' const='yes' id='ac679f16'/>
    <reference-type-def kind='lvalue' type-id='ac679f16' size-in-bits='32' id='971f9890'/>
    <pointer-type-def type-id='ac679f16' size-in-bits='32' id='a31fab74'/>
    <qualified-type-def type-id='9a771f60' const='yes' id='c1918efd'/>
    <reference-type-def kind='lvalue' type-id='c1918efd' size-in-bits='32' id='9323e2c1'/>
    <pointer-type-def type-id='c1918efd' size-in-bits='32' id='8f23dc75'/>
    <qualified-type-def type-id='966331d7' const='yes' id='29a768f2'/>
    <reference-type-def kind='lvalue' type-id='29a768f2' size-in-bits='32' id='668a05bc'/>
    <pointer-type-def type-id='29a768f2' size-in-bits='32' id='6a8a0c08'/>
    <qualified-type-def type-id='6a81bf9f' const='yes' id='adeba43c'/>
    <reference-type-def kind='lvalue' type-id='adeba43c' size-in-bits='32' id='e3f354ee'/>
    <pointer-type-def type-id='adeba43c' size-in-bits='32' id='dff34ea2'/>
    <qualified-type-def type-id='9db4a8b6' const='yes' id='ad480a86'/>
    <reference-type-def kind='lvalue' type-id='ad480a86' size-in-bits='32' id='6868b9e0'/>
    <qualified-type-def type-id='10e7e929' const='yes' id='8f7416f9'/>
    <reference-type-def kind='lvalue' type-id='8f7416f9' size-in-bits='32' id='b2c0010d'/>
    <qualified-type-def type-id='b38d4802' const='yes' id='d74ffdd2'/>
    <reference-type-def kind='lvalue' type-id='d74ffdd2' size-in-bits='32' id='e6ecc71c'/>
    <qualified-type-def type-id='a104f5a1' const='yes' id='b482634e'/>
    <reference-type-def kind='lvalue' type-id='b482634e' size-in-bits='32' id='91427cb8'/>
    <pointer-type-def type-id='b482634e' size-in-bits='32' id='8d42766c'/>
    <qualified-type-def type-id='3b178084' const='yes' id='4dc5d494'/>
    <reference-type-def kind='lvalue' type-id='4dc5d494' size-in-bits='32' id='206dd436'/>
    <qualified-type-def type-id='1cdac963' const='yes' id='e079cbf3'/>
    <reference-type-def kind='lvalue' type-id='e079cbf3' size-in-bits='32' id='34bbe04f'/>
    <qualified-type-def type-id='bb1f0094' const='yes' id='956b7924'/>
    <reference-type-def kind='lvalue' type-id='956b7924' size-in-bits='32' id='3a2f7e26'/>
    <qualified-type-def type-id='97ba1631' const='yes' id='bada66f6'/>
    <reference-type-def kind='lvalue' type-id='bada66f6' size-in-bits='32' id='f5cfd970'/>
    <pointer-type-def type-id='bada66f6' size-in-bits='32' id='01cfec54'/>
    <qualified-type-def type-id='2d95a82c' const='yes' id='3c161b3c'/>
    <reference-type-def kind='lvalue' type-id='3c161b3c' size-in-bits='32' id='b0cca9ee'/>
    <qualified-type-def type-id='a89b660b' const='yes' id='f8b250db'/>
    <reference-type-def kind='lvalue' type-id='f8b250db' size-in-bits='32' id='7db57e47'/>
    <qualified-type-def type-id='d427336c' const='yes' id='5bdf47bc'/>
    <reference-type-def kind='lvalue' type-id='5bdf47bc' size-in-bits='32' id='3a7db76e'/>
    <qualified-type-def type-id='951e44e5' const='yes' id='3b165ce2'/>
    <reference-type-def kind='lvalue' type-id='3b165ce2' size-in-bits='32' id='c834088c'/>
    <pointer-type-def type-id='3b165ce2' size-in-bits='32' id='cc340ed8'/>
    <qualified-type-def type-id='36d323f8' const='yes' id='9fabf548'/>
    <reference-type-def kind='lvalue' type-id='9fabf548' size-in-bits='32' id='c9b35c2a'/>
    <qualified-type-def type-id='736afeaf' const='yes' id='91cc5fbf'/>
    <reference-type-def kind='lvalue' type-id='91cc5fbf' size-in-bits='32' id='1dba7ddb'/>
    <qualified-type-def type-id='ce0517a0' const='yes' id='bb167df0'/>
    <reference-type-def kind='lvalue' type-id='bb167df0' size-in-bits='32' id='5a6817e2'/>
    <qualified-type-def type-id='86513975' const='yes' id='fe79fb3a'/>
    <reference-type-def kind='lvalue' type-id='fe79fb3a' size-in-bits='32' id='b6064d14'/>
    <pointer-type-def type-id='fe79fb3a' size-in-bits='32' id='aa063a30'/>
    <qualified-type-def type-id='324852f0' const='yes' id='4f6420c0'/>
    <reference-type-def kind='lvalue' type-id='4f6420c0' size-in-bits='32' id='e09fca12'/>
    <qualified-type-def type-id='1a4295c7' const='yes' id='3bddb257'/>
    <reference-type-def kind='lvalue' type-id='3bddb257' size-in-bits='32' id='aeffe7e3'/>
    <qualified-type-def type-id='79281988' const='yes' id='d991e118'/>
    <reference-type-def kind='lvalue' type-id='d991e118' size-in-bits='32' id='bea5949a'/>
    <qualified-type-def type-id='cc5cd419' const='yes' id='9c8ba446'/>
    <reference-type-def kind='lvalue' type-id='9c8ba446' size-in-bits='32' id='cfd3c320'/>
    <pointer-type-def type-id='9c8ba446' size-in-bits='32' id='dbd3d604'/>
    <qualified-type-def type-id='c879823c' const='yes' id='e99073cc'/>
    <reference-type-def kind='lvalue' type-id='e99073cc' size-in-bits='32' id='9866795e'/>
    <qualified-type-def type-id='8be1d5db' const='yes' id='baff666b'/>
