<abi-corpus version='2.0' path='data/test-read-dwarf/test13-pr18894.so' soname='libdbus-1.so.3'>
  <elf-needed>
    <dependency name='librt.so.1'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='dbus_address_entries_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_address_entry_get_method' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_address_entry_get_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_address_escape_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_address_unescape_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_bus_add_match' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_bus_get' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_bus_get_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='dbus_set_error' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_set_error_const' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_set_error_from_message' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_setenv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_shutdown' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_signature_iter_get_current_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_signature_iter_get_element_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_signature_iter_get_signature' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_signature_iter_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_signature_iter_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_signature_iter_recurse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_signature_validate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_signature_validate_single' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_threads_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_threads_init_default' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_timeout_get_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_timeout_get_enabled' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_timeout_get_interval' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_timeout_handle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_timeout_set_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_type_is_basic' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_type_is_container' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_type_is_fixed' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_type_is_valid' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_validate_bus_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_validate_error_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_validate_interface' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_validate_member' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_validate_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_validate_utf8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_watch_get_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_watch_get_enabled' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_watch_get_fd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_watch_get_flags' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_watch_get_socket' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_watch_get_unix_fd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_watch_handle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='dbus_watch_set_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='dbus-address.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <type-decl name='int' size-in-bits='32' id='type-id-2'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-3'/>
    <type-decl name='void' id='type-id-4'/>
    <typedef-decl name='DBusAddressEntry' type-id='type-id-5' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.h' line='41' column='1' id='type-id-6'/>
    <class-decl name='DBusAddressEntry' size-in-bits='320' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='44' column='1' id='type-id-5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='method' type-id='type-id-7' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='keys' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='values' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='48' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DBusString' type-id='type-id-9' filepath='../dbus/dbus-string.h' line='40' column='1' id='type-id-7'/>
    <class-decl name='DBusString' size-in-bits='192' is-struct='yes' visibility='default' filepath='../dbus/dbus-string.h' line='43' column='1' id='type-id-9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dummy1' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-string.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dummy2' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-string.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dummy3' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-string.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dummy_bit1' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-string.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='dummy_bit2' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-string.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='dummy_bit3' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-string.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='dummy_bits' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-string.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='DBusList' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-list.h' line='35' column='1' id='type-id-11'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prev' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-list.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-list.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-list.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DBusList' type-id='type-id-11' filepath='../dbus/dbus-sysdeps.h' line='74' column='1' id='type-id-12'/>
    <typedef-decl name='DBusError' type-id='type-id-13' filepath='../dbus/dbus-errors.h' line='43' column='1' id='type-id-14'/>
    <class-decl name='DBusError' size-in-bits='256' is-struct='yes' visibility='default' filepath='../dbus/dbus-errors.h' line='49' column='1' id='type-id-13'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-15' visibility='default' filepath='../dbus/dbus-errors.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='message' type-id='type-id-15' visibility='default' filepath='../dbus/dbus-errors.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dummy1' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-errors.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='dummy2' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-errors.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='dummy3' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-errors.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='dummy4' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-errors.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='dummy5' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-errors.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='padding1' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-errors.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dbus_bool_t' type-id='type-id-16' filepath='../dbus/dbus-types.h' line='35' column='1' id='type-id-17'/>
    <typedef-decl name='dbus_uint32_t' type-id='type-id-3' filepath='../dbus/dbus-arch-deps.h' line='43' column='1' id='type-id-16'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-19'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-20'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-21'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-8'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-22'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-23'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-15'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-10'/>
    <function-decl name='dbus_address_entry_get_method' mangled-name='dbus_address_entry_get_method' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_address_entry_get_method'>
      <parameter type-id='type-id-18' name='entry' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='227' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='dbus_address_unescape_value' mangled-name='dbus_address_unescape_value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='617' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_address_unescape_value'>
      <parameter type-id='type-id-15' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='617' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='618' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_address_entries_free' mangled-name='dbus_address_entries_free' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_address_entries_free'>
      <parameter type-id='type-id-19' name='entries' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='189' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_parse_address' mangled-name='dbus_parse_address' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='363' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_parse_address'>
      <parameter type-id='type-id-15' name='address' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='363' column='1'/>
      <parameter type-id='type-id-20' name='entry' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='364' column='1'/>
      <parameter type-id='type-id-24' name='array_len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='365' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='366' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_address_entry_get_value' mangled-name='dbus_address_entry_get_value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='244' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_address_entry_get_value'>
      <parameter type-id='type-id-18' name='entry' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='244' column='1'/>
      <parameter type-id='type-id-15' name='key' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='245' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='dbus_address_escape_value' mangled-name='dbus_address_escape_value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='583' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_address_escape_value'>
      <parameter type-id='type-id-15' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-address.c' line='583' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-bus.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <class-decl name='DBusConnection' size-in-bits='2112' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='257' column='1' id='type-id-25'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='refcount' type-id='type-id-26' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mutex' type-id='type-id-27' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dispatch_mutex' type-id='type-id-28' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dispatch_cond' type-id='type-id-29' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='io_path_mutex' type-id='type-id-28' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='io_path_cond' type-id='type-id-29' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='outgoing_messages' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='incoming_messages' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='expired_messages' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='message_borrowed' type-id='type-id-30' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='n_outgoing' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='n_incoming' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='outgoing_counter' type-id='type-id-31' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='transport' type-id='type-id-32' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='watches' type-id='type-id-33' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='timeouts' type-id='type-id-34' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='filter_list' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='slot_mutex' type-id='type-id-27' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='slot_list' type-id='type-id-35' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='pending_replies' type-id='type-id-36' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='client_serial' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='disconnect_message_link' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='wakeup_main_function' type-id='type-id-37' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='wakeup_main_data' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='free_wakeup_main_data' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='dispatch_status_function' type-id='type-id-39' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='dispatch_status_data' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='free_dispatch_status_data' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='last_dispatch_status' type-id='type-id-40' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='objects' type-id='type-id-41' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='server_guid' type-id='type-id-22' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='dispatch_acquired' type-id='type-id-17' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='io_path_acquired' type-id='type-id-17' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='shareable' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='exit_on_disconnect' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='route_peer_messages' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='disconnected_message_arrived' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='disconnected_message_processed' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='have_connection_lock' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='generation' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='334' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-42'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-43'/>
    <typedef-decl name='DBusConnection' type-id='type-id-25' filepath='../dbus/dbus-connection.h' line='51' column='1' id='type-id-44'/>
    <typedef-decl name='DBusBusType' type-id='type-id-45' filepath='../dbus/dbus-shared.h' line='61' column='1' id='type-id-46'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../dbus/dbus-shared.h' line='57' column='1' id='type-id-45'>
      <underlying-type type-id='type-id-42'/>
      <enumerator name='DBUS_BUS_SESSION' value='0'/>
      <enumerator name='DBUS_BUS_SYSTEM' value='1'/>
      <enumerator name='DBUS_BUS_STARTER' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-47'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-48'/>
    <function-decl name='dbus_bus_remove_match' mangled-name='dbus_bus_remove_match' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_remove_match'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1576' column='1'/>
      <parameter type-id='type-id-15' name='rule' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1577' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1578' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_bus_add_match' mangled-name='dbus_bus_add_match' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1526' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_add_match'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1526' column='1'/>
      <parameter type-id='type-id-15' name='rule' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1527' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1528' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_bus_start_service_by_name' mangled-name='dbus_bus_start_service_by_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_start_service_by_name'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1356' column='1'/>
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1357' column='1'/>
      <parameter type-id='type-id-16' name='flags' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1358' column='1'/>
      <parameter type-id='type-id-48' name='result' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1359' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1360' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_bus_name_has_owner' mangled-name='dbus_bus_name_has_owner' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_name_has_owner'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1280' column='1'/>
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1281' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1282' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_bus_release_name' mangled-name='dbus_bus_release_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_release_name'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1198' column='1'/>
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1199' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1200' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='dbus_bus_request_name' mangled-name='dbus_bus_request_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_request_name'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1112' column='1'/>
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1113' column='1'/>
      <parameter type-id='type-id-3' name='flags' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1114' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='1115' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='dbus_bus_get_unix_user' mangled-name='dbus_bus_get_unix_user' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='865' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_get_unix_user'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='865' column='1'/>
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='866' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='867' column='1'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='dbus_bus_get_id' mangled-name='dbus_bus_get_id' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='948' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_get_id'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='948' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='949' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_bus_get_unique_name' mangled-name='dbus_bus_get_unique_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_get_unique_name'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='815' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='dbus_bus_set_unique_name' mangled-name='dbus_bus_set_unique_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='766' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_set_unique_name'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='766' column='1'/>
      <parameter type-id='type-id-15' name='unique_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='767' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_bus_register' mangled-name='dbus_bus_register' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='646' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_register'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='646' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='647' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_bus_get_private' mangled-name='dbus_bus_get_private' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='590' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_get_private'>
      <parameter type-id='type-id-46' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='590' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='591' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='dbus_bus_get' mangled-name='dbus_bus_get' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='558' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_get'>
      <parameter type-id='type-id-46' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='558' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='559' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-28'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-29'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-36'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-30'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-41'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-34'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-32'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-33'/>
    <typedef-decl name='DBusAtomic' type-id='type-id-59' filepath='../dbus/dbus-sysdeps.h' line='222' column='1' id='type-id-26'/>
    <typedef-decl name='DBusDataSlotList' type-id='type-id-60' filepath='../dbus/dbus-dataslot.h' line='31' column='1' id='type-id-35'/>
    <typedef-decl name='DBusDispatchStatus' type-id='type-id-61' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='84' column='1' id='type-id-40'/>
    <typedef-decl name='DBusDispatchStatusFunction' type-id='type-id-62' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='128' column='1' id='type-id-39'/>
    <typedef-decl name='DBusFreeFunction' type-id='type-id-63' filepath='../dbus/dbus-memory.h' line='64' column='1' id='type-id-38'/>
    <typedef-decl name='DBusWakeupMainFunction' type-id='type-id-63' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='135' column='1' id='type-id-37'/>
    <class-decl name='DBusAtomic' size-in-bits='32' is-struct='yes' visibility='default' filepath='../dbus/dbus-sysdeps.h' line='228' column='1' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-64' visibility='default' filepath='../dbus/dbus-sysdeps.h' line='232' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='DBusDataSlotList' size-in-bits='128' is-struct='yes' visibility='default' filepath='../dbus/dbus-dataslot.h' line='70' column='1' id='type-id-60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='slots' type-id='type-id-65' visibility='default' filepath='../dbus/dbus-dataslot.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='n_slots' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-dataslot.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='80' column='1' id='type-id-61'>
      <underlying-type type-id='type-id-42'/>
      <enumerator name='DBUS_DISPATCH_DATA_REMAINS' value='0'/>
      <enumerator name='DBUS_DISPATCH_COMPLETE' value='1'/>
      <enumerator name='DBUS_DISPATCH_NEED_MEMORY' value='2'/>
    </enum-decl>
    <typedef-decl name='DBusCMutex' type-id='type-id-66' filepath='../dbus/dbus-threads-internal.h' line='45' column='1' id='type-id-49'/>
    <typedef-decl name='DBusCondVar' type-id='type-id-67' filepath='../dbus/dbus-threads.h' line='43' column='1' id='type-id-50'/>
    <typedef-decl name='DBusCounter' type-id='type-id-68' filepath='../dbus/dbus-resources.h' line='32' column='1' id='type-id-51'/>
    <typedef-decl name='DBusHashTable' type-id='type-id-69' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-hash.h' line='59' column='1' id='type-id-52'/>
    <typedef-decl name='DBusMessage' type-id='type-id-70' filepath='../dbus/dbus-message.h' line='44' column='1' id='type-id-53'/>
    <typedef-decl name='DBusObjectTree' type-id='type-id-71' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-object-tree.h' line='30' column='1' id='type-id-54'/>
    <typedef-decl name='DBusRMutex' type-id='type-id-72' filepath='../dbus/dbus-threads-internal.h' line='39' column='1' id='type-id-55'/>
    <typedef-decl name='DBusTimeoutList' type-id='type-id-73' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.h' line='38' column='1' id='type-id-56'/>
    <typedef-decl name='DBusTransport' type-id='type-id-74' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-transport.h' line='33' column='1' id='type-id-57'/>
    <typedef-decl name='DBusWatchList' type-id='type-id-75' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.h' line='38' column='1' id='type-id-58'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-62'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-63'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-65'/>
    <class-decl name='DBusCMutex' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-66'/>
    <class-decl name='DBusCondVar' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-67'/>
    <class-decl name='DBusCounter' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-68'/>
    <class-decl name='DBusHashTable' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-69'/>
    <class-decl name='DBusMessage' size-in-bits='1472' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='100' column='1' id='type-id-70'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='refcount' type-id='type-id-26' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='header' type-id='type-id-79' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='body' type-id='type-id-7' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='locked' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='in_cache' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='counters' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='size_counter_delta' type-id='type-id-80' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='changed_stamp' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='slot_list' type-id='type-id-35' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='generation' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='unix_fds' type-id='type-id-24' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='n_unix_fds' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='n_unix_fds_allocated' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='unix_fd_counter_delta' type-id='type-id-80' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='132' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='DBusObjectTree' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-71'/>
    <class-decl name='DBusRMutex' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-72'/>
    <class-decl name='DBusTimeoutList' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-73'/>
    <class-decl name='DBusTransport' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-74'/>
    <class-decl name='DBusWatchList' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-75'/>
    <qualified-type-def type-id='type-id-81' volatile='yes' id='type-id-64'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-80'/>
    <typedef-decl name='DBusDataSlot' type-id='type-id-82' filepath='../dbus/dbus-dataslot.h' line='34' column='1' id='type-id-78'/>
    <typedef-decl name='DBusHeader' type-id='type-id-83' filepath='../dbus/dbus-marshal-header.h' line='30' column='1' id='type-id-79'/>
    <typedef-decl name='dbus_int32_t' type-id='type-id-2' filepath='../dbus/dbus-arch-deps.h' line='42' column='1' id='type-id-81'/>
    <class-decl name='DBusDataSlot' size-in-bits='128' is-struct='yes' visibility='default' filepath='../dbus/dbus-dataslot.h' line='37' column='1' id='type-id-82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-dataslot.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='free_data_func' type-id='type-id-38' visibility='default' filepath='../dbus/dbus-dataslot.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='DBusHeader' size-in-bits='576' is-struct='yes' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='48' column='1' id='type-id-83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-7' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fields' type-id='type-id-84' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='padding' type-id='type-id-16' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='byte_order' type-id='type-id-16' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-85' size-in-bits='320' id='type-id-84'>
      <subrange length='10' type-id='type-id-43' id='type-id-86'/>
    </array-type-def>
    <typedef-decl name='DBusHeaderField' type-id='type-id-87' filepath='../dbus/dbus-marshal-header.h' line='31' column='1' id='type-id-85'/>
    <class-decl name='DBusHeaderField' size-in-bits='32' is-struct='yes' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='40' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value_pos' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='41' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-connection.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-85' size-in-bits='320' id='type-id-84'>
      <subrange length='10' type-id='type-id-43' id='type-id-86'/>
    </array-type-def>
    <class-decl name='DBusCMutex' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-66'/>
    <class-decl name='DBusCondVar' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-67'/>
    <class-decl name='DBusCounter' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-68'/>
    <class-decl name='DBusHashTable' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-69'/>
    <class-decl name='DBusObjectTree' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-71'/>
    <class-decl name='DBusPendingCall' size-in-bits='576' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='63' column='1' id='type-id-88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='refcount' type-id='type-id-26' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='slot_list' type-id='type-id-35' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='function' type-id='type-id-89' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='connection' type-id='type-id-47' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='reply' type-id='type-id-30' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='timeout' type-id='type-id-90' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='timeout_link' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='reply_serial' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='completed' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='timeout_added' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='79' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='DBusRMutex' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-72'/>
    <class-decl name='DBusTimeout' size-in-bits='448' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='41' column='1' id='type-id-91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='refcount' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='interval' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='handler' type-id='type-id-92' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='handler_data' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='free_handler_data_function' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='data' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='free_data_function' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='enabled' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='51' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='DBusTimeoutList' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-73'/>
    <class-decl name='DBusTransport' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-74'/>
    <class-decl name='DBusWatch' size-in-bits='512' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='41' column='1' id='type-id-93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='refcount' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fd' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='handler' type-id='type-id-94' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='handler_data' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='free_handler_data_function' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='data' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='free_data_function' type-id='type-id-38' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='enabled' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='oom_last_time' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='53' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='DBusWatchList' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-75'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-80'/>
    <typedef-decl name='DBusAtomic' type-id='type-id-59' filepath='../dbus/dbus-sysdeps.h' line='222' column='1' id='type-id-26'/>
    <class-decl name='DBusAtomic' size-in-bits='32' is-struct='yes' visibility='default' filepath='../dbus/dbus-sysdeps.h' line='228' column='1' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-64' visibility='default' filepath='../dbus/dbus-sysdeps.h' line='232' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='dbus_int32_t' type-id='type-id-2' filepath='../dbus/dbus-arch-deps.h' line='42' column='1' id='type-id-81'/>
    <typedef-decl name='DBusRMutex' type-id='type-id-72' filepath='../dbus/dbus-threads-internal.h' line='39' column='1' id='type-id-55'/>
    <typedef-decl name='DBusCMutex' type-id='type-id-66' filepath='../dbus/dbus-threads-internal.h' line='45' column='1' id='type-id-49'/>
    <typedef-decl name='DBusCondVar' type-id='type-id-67' filepath='../dbus/dbus-threads.h' line='43' column='1' id='type-id-50'/>
    <typedef-decl name='DBusMessage' type-id='type-id-70' filepath='../dbus/dbus-message.h' line='44' column='1' id='type-id-53'/>
    <class-decl name='DBusMessage' size-in-bits='1472' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='100' column='1' id='type-id-70'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='refcount' type-id='type-id-26' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='header' type-id='type-id-79' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='body' type-id='type-id-7' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='locked' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='in_cache' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='counters' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='size_counter_delta' type-id='type-id-80' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='changed_stamp' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='slot_list' type-id='type-id-35' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='generation' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='unix_fds' type-id='type-id-24' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='n_unix_fds' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='n_unix_fds_allocated' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='unix_fd_counter_delta' type-id='type-id-80' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='132' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DBusHeader' type-id='type-id-83' filepath='../dbus/dbus-marshal-header.h' line='30' column='1' id='type-id-79'/>
    <class-decl name='DBusHeader' size-in-bits='576' is-struct='yes' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='48' column='1' id='type-id-83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-7' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fields' type-id='type-id-84' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='padding' type-id='type-id-16' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='byte_order' type-id='type-id-16' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DBusHeaderField' type-id='type-id-87' filepath='../dbus/dbus-marshal-header.h' line='31' column='1' id='type-id-85'/>
    <class-decl name='DBusHeaderField' size-in-bits='32' is-struct='yes' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='40' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value_pos' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='41' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DBusDataSlotList' type-id='type-id-60' filepath='../dbus/dbus-dataslot.h' line='31' column='1' id='type-id-35'/>
    <class-decl name='DBusDataSlotList' size-in-bits='128' is-struct='yes' visibility='default' filepath='../dbus/dbus-dataslot.h' line='70' column='1' id='type-id-60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='slots' type-id='type-id-65' visibility='default' filepath='../dbus/dbus-dataslot.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='n_slots' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-dataslot.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DBusDataSlot' type-id='type-id-82' filepath='../dbus/dbus-dataslot.h' line='34' column='1' id='type-id-78'/>
    <class-decl name='DBusDataSlot' size-in-bits='128' is-struct='yes' visibility='default' filepath='../dbus/dbus-dataslot.h' line='37' column='1' id='type-id-82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-dataslot.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='free_data_func' type-id='type-id-38' visibility='default' filepath='../dbus/dbus-dataslot.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DBusFreeFunction' type-id='type-id-63' filepath='../dbus/dbus-memory.h' line='64' column='1' id='type-id-38'/>
    <typedef-decl name='DBusCounter' type-id='type-id-68' filepath='../dbus/dbus-resources.h' line='32' column='1' id='type-id-51'/>
    <typedef-decl name='DBusTransport' type-id='type-id-74' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-transport.h' line='33' column='1' id='type-id-57'/>
    <typedef-decl name='DBusWatchList' type-id='type-id-75' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.h' line='38' column='1' id='type-id-58'/>
    <typedef-decl name='DBusTimeoutList' type-id='type-id-73' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.h' line='38' column='1' id='type-id-56'/>
    <typedef-decl name='DBusHashTable' type-id='type-id-69' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-hash.h' line='59' column='1' id='type-id-52'/>
    <typedef-decl name='DBusWakeupMainFunction' type-id='type-id-63' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='135' column='1' id='type-id-37'/>
    <typedef-decl name='DBusDispatchStatusFunction' type-id='type-id-62' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='128' column='1' id='type-id-39'/>
    <typedef-decl name='DBusDispatchStatus' type-id='type-id-61' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='84' column='1' id='type-id-40'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='80' column='1' id='type-id-61'>
      <underlying-type type-id='type-id-42'/>
      <enumerator name='DBUS_DISPATCH_DATA_REMAINS' value='0'/>
      <enumerator name='DBUS_DISPATCH_COMPLETE' value='1'/>
      <enumerator name='DBUS_DISPATCH_NEED_MEMORY' value='2'/>
    </enum-decl>
    <typedef-decl name='DBusObjectTree' type-id='type-id-71' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-object-tree.h' line='30' column='1' id='type-id-54'/>
    <typedef-decl name='DBusObjectPathVTable' type-id='type-id-95' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='53' column='1' id='type-id-96'/>
    <class-decl name='DBusObjectPathVTable' size-in-bits='384' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='385' column='1' id='type-id-95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='unregister_function' type-id='type-id-97' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='message_function' type-id='type-id-98' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dbus_internal_pad1' type-id='type-id-63' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dbus_internal_pad2' type-id='type-id-63' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dbus_internal_pad3' type-id='type-id-63' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dbus_internal_pad4' type-id='type-id-63' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='392' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DBusObjectPathUnregisterFunction' type-id='type-id-99' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='367' column='1' id='type-id-97'/>
    <typedef-decl name='DBusObjectPathMessageFunction' type-id='type-id-100' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='374' column='1' id='type-id-98'/>
    <typedef-decl name='DBusHandlerResult' type-id='type-id-101' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-shared.h' line='71' column='1' id='type-id-102'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-shared.h' line='67' column='1' id='type-id-101'>
      <underlying-type type-id='type-id-42'/>
      <enumerator name='DBUS_HANDLER_RESULT_HANDLED' value='0'/>
      <enumerator name='DBUS_HANDLER_RESULT_NOT_YET_HANDLED' value='1'/>
      <enumerator name='DBUS_HANDLER_RESULT_NEED_MEMORY' value='2'/>
    </enum-decl>
    <typedef-decl name='DBusHandleMessageFunction' type-id='type-id-100' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='169' column='1' id='type-id-103'/>
    <typedef-decl name='DBusAllowWindowsUserFunction' type-id='type-id-104' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='153' column='1' id='type-id-105'/>
    <typedef-decl name='DBusAllowUnixUserFunction' type-id='type-id-106' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='143' column='1' id='type-id-107'/>
    <typedef-decl name='DBusAddTimeoutFunction' type-id='type-id-108' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='110' column='1' id='type-id-109'/>
    <typedef-decl name='DBusTimeout' type-id='type-id-91' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='45' column='1' id='type-id-110'/>
    <typedef-decl name='DBusRemoveTimeoutFunction' type-id='type-id-111' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='123' column='1' id='type-id-112'/>
    <typedef-decl name='DBusTimeoutToggledFunction' type-id='type-id-111' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='117' column='1' id='type-id-113'/>
    <typedef-decl name='DBusAddWatchFunction' type-id='type-id-114' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='91' column='1' id='type-id-115'/>
    <typedef-decl name='DBusWatch' type-id='type-id-93' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='43' column='1' id='type-id-116'/>
    <typedef-decl name='DBusRemoveWatchFunction' type-id='type-id-117' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='103' column='1' id='type-id-118'/>
    <typedef-decl name='DBusWatchToggledFunction' type-id='type-id-117' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='97' column='1' id='type-id-119'/>
    <typedef-decl name='DBusPreallocatedSend' type-id='type-id-120' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='47' column='1' id='type-id-121'/>
    <class-decl name='DBusPreallocatedSend' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='241' column='1' id='type-id-120'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='connection' type-id='type-id-47' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='queue_link' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='counter_link' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='244' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DBusPendingCall' type-id='type-id-88' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='49' column='1' id='type-id-122'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-28'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-29'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-36'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-30'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-41'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-123'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-124'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-125'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-90'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-34'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-32'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-33'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-127'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-128'/>
    <qualified-type-def type-id='type-id-96' const='yes' id='type-id-129'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-130'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-131'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-100'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-106'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-108'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-114'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-137'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-62'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-99'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-111'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-117'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-63'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-141'/>
    <qualified-type-def type-id='type-id-81' volatile='yes' id='type-id-64'/>
    <function-decl name='dbus_connection_set_change_sigpipe' mangled-name='dbus_connection_set_change_sigpipe' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6043' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_change_sigpipe'>
      <parameter type-id='type-id-17' name='will_modify_sigpipe' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6043' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_connection_get_data' mangled-name='dbus_connection_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6017' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_data'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6017' column='1'/>
      <parameter type-id='type-id-81' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6018' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='dbus_connection_set_data' mangled-name='dbus_connection_set_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5968' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_data'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5968' column='1'/>
      <parameter type-id='type-id-81' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5969' column='1'/>
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5970' column='1'/>
      <parameter type-id='type-id-38' name='free_data_func' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5971' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_free_data_slot' mangled-name='dbus_connection_free_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5938' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_free_data_slot'>
      <parameter type-id='type-id-131' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5938' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_connection_allocate_data_slot' mangled-name='dbus_connection_allocate_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5920' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_allocate_data_slot'>
      <parameter type-id='type-id-131' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5920' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_list_registered' mangled-name='dbus_connection_list_registered' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5878' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_list_registered'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5878' column='1'/>
      <parameter type-id='type-id-15' name='parent_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5879' column='1'/>
      <parameter type-id='type-id-128' name='child_entries' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5880' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_unregister_object_path' mangled-name='dbus_connection_unregister_object_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5809' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_unregister_object_path'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5809' column='1'/>
      <parameter type-id='type-id-15' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5810' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_ref' mangled-name='dbus_connection_ref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2681' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_ref'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2681' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='dbus_connection_get_outgoing_unix_fds' mangled-name='dbus_connection_get_outgoing_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_outgoing_unix_fds'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6296' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='dbus_connection_get_outgoing_size' mangled-name='dbus_connection_get_outgoing_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_outgoing_size'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6235' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='dbus_connection_get_max_received_unix_fds' mangled-name='dbus_connection_get_max_received_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_max_received_unix_fds'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6212' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='dbus_connection_set_max_received_unix_fds' mangled-name='dbus_connection_set_max_received_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_max_received_unix_fds'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6194' column='1'/>
      <parameter type-id='type-id-80' name='n' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6195' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_connection_get_max_received_size' mangled-name='dbus_connection_get_max_received_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_max_received_size'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6170' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='dbus_connection_set_max_received_size' mangled-name='dbus_connection_set_max_received_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_max_received_size'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6152' column='1'/>
      <parameter type-id='type-id-80' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6153' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_connection_get_max_message_unix_fds' mangled-name='dbus_connection_get_max_message_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_max_message_unix_fds'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6114' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='dbus_connection_set_max_message_unix_fds' mangled-name='dbus_connection_set_max_message_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6096' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_max_message_unix_fds'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6096' column='1'/>
      <parameter type-id='type-id-80' name='n' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6097' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_connection_get_max_message_size' mangled-name='dbus_connection_get_max_message_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6075' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_max_message_size'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6075' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='dbus_connection_set_max_message_size' mangled-name='dbus_connection_set_max_message_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6057' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_max_message_size'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6057' column='1'/>
      <parameter type-id='type-id-80' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6058' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_connection_get_object_path_data' mangled-name='dbus_connection_get_object_path_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5841' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_object_path_data'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5841' column='1'/>
      <parameter type-id='type-id-15' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5842' column='1'/>
      <parameter type-id='type-id-141' name='data_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5843' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_register_fallback' mangled-name='dbus_connection_register_fallback' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5774' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_register_fallback'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5774' column='1'/>
      <parameter type-id='type-id-15' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5775' column='1'/>
      <parameter type-id='type-id-130' name='vtable' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5776' column='1'/>
      <parameter type-id='type-id-10' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5777' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_try_register_fallback' mangled-name='dbus_connection_try_register_fallback' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5742' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_try_register_fallback'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5742' column='1'/>
      <parameter type-id='type-id-15' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5743' column='1'/>
      <parameter type-id='type-id-130' name='vtable' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5744' column='1'/>
      <parameter type-id='type-id-10' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5745' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5746' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_register_object_path' mangled-name='dbus_connection_register_object_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5702' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_register_object_path'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5702' column='1'/>
      <parameter type-id='type-id-15' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5703' column='1'/>
      <parameter type-id='type-id-130' name='vtable' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5704' column='1'/>
      <parameter type-id='type-id-10' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5705' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_try_register_object_path' mangled-name='dbus_connection_try_register_object_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5672' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_try_register_object_path'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5672' column='1'/>
      <parameter type-id='type-id-15' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5673' column='1'/>
      <parameter type-id='type-id-130' name='vtable' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5674' column='1'/>
      <parameter type-id='type-id-10' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5675' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5676' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_remove_filter' mangled-name='dbus_connection_remove_filter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5563' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_remove_filter'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5563' column='1'/>
      <parameter type-id='type-id-103' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5564' column='1'/>
      <parameter type-id='type-id-10' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5565' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_connection_add_filter' mangled-name='dbus_connection_add_filter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5511' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_add_filter'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5511' column='1'/>
      <parameter type-id='type-id-103' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5512' column='1'/>
      <parameter type-id='type-id-10' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5513' column='1'/>
      <parameter type-id='type-id-38' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5514' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_set_route_peer_messages' mangled-name='dbus_connection_set_route_peer_messages' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_route_peer_messages'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5479' column='1'/>
      <parameter type-id='type-id-17' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5480' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_connection_set_allow_anonymous' mangled-name='dbus_connection_set_allow_anonymous' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5451' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_allow_anonymous'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5451' column='1'/>
      <parameter type-id='type-id-17' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5452' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_connection_set_windows_user_function' mangled-name='dbus_connection_set_windows_user_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_windows_user_function'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5404' column='1'/>
      <parameter type-id='type-id-105' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5405' column='1'/>
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5406' column='1'/>
      <parameter type-id='type-id-38' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5407' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_connection_get_windows_user' mangled-name='dbus_connection_get_windows_user' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5357' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_windows_user'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5357' column='1'/>
      <parameter type-id='type-id-127' name='windows_sid_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5358' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_set_unix_user_function' mangled-name='dbus_connection_set_unix_user_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_unix_user_function'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5305' column='1'/>
      <parameter type-id='type-id-107' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5306' column='1'/>
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5307' column='1'/>
      <parameter type-id='type-id-38' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5308' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_connection_get_adt_audit_session_data' mangled-name='dbus_connection_get_adt_audit_session_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_adt_audit_session_data'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5259' column='1'/>
      <parameter type-id='type-id-141' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5260' column='1'/>
      <parameter type-id='type-id-131' name='data_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5261' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_get_unix_process_id' mangled-name='dbus_connection_get_unix_process_id' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_unix_process_id'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5226' column='1'/>
      <parameter type-id='type-id-137' name='pid' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5227' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_get_unix_user' mangled-name='dbus_connection_get_unix_user' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_unix_user'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5190' column='1'/>
      <parameter type-id='type-id-137' name='uid' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5191' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_get_socket' mangled-name='dbus_connection_get_socket' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_socket'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5148' column='1'/>
      <parameter type-id='type-id-24' name='fd' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5149' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_get_unix_fd' mangled-name='dbus_connection_get_unix_fd' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_unix_fd'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5118' column='1'/>
      <parameter type-id='type-id-24' name='fd' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5119' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_set_dispatch_status_function' mangled-name='dbus_connection_set_dispatch_status_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5073' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_dispatch_status_function'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5073' column='1'/>
      <parameter type-id='type-id-39' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5074' column='1'/>
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5075' column='1'/>
      <parameter type-id='type-id-38' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5076' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_connection_set_wakeup_main_function' mangled-name='dbus_connection_set_wakeup_main_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5027' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_wakeup_main_function'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5027' column='1'/>
      <parameter type-id='type-id-37' name='wakeup_main_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5028' column='1'/>
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5029' column='1'/>
      <parameter type-id='type-id-38' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5030' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_connection_set_timeout_functions' mangled-name='dbus_connection_set_timeout_functions' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4989' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_timeout_functions'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4989' column='1'/>
      <parameter type-id='type-id-109' name='add_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4990' column='1'/>
      <parameter type-id='type-id-112' name='remove_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4991' column='1'/>
      <parameter type-id='type-id-113' name='toggled_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4992' column='1'/>
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4993' column='1'/>
      <parameter type-id='type-id-38' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4994' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_set_watch_functions' mangled-name='dbus_connection_set_watch_functions' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4926' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_watch_functions'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4926' column='1'/>
      <parameter type-id='type-id-115' name='add_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4927' column='1'/>
      <parameter type-id='type-id-118' name='remove_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4928' column='1'/>
      <parameter type-id='type-id-119' name='toggled_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4929' column='1'/>
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4930' column='1'/>
      <parameter type-id='type-id-38' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4931' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_set_exit_on_disconnect' mangled-name='dbus_connection_set_exit_on_disconnect' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_exit_on_disconnect'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3145' column='1'/>
      <parameter type-id='type-id-17' name='exit_on_disconnect' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3146' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_connection_get_is_authenticated' mangled-name='dbus_connection_get_is_authenticated' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2995' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_is_authenticated'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2995' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_has_messages_to_send' mangled-name='dbus_connection_has_messages_to_send' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='588' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_has_messages_to_send'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='588' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_preallocate_send' mangled-name='dbus_connection_preallocate_send' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_preallocate_send'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3165' column='1'/>
      <return type-id='type-id-125'/>
    </function-decl>
    <function-decl name='dbus_connection_get_is_connected' mangled-name='dbus_connection_get_is_connected' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2973' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_is_connected'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2973' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_free_preallocated_send' mangled-name='dbus_connection_free_preallocated_send' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_free_preallocated_send'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3191' column='1'/>
      <parameter type-id='type-id-125' name='preallocated' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3192' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_connection_can_send_type' mangled-name='dbus_connection_can_send_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_can_send_type'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3105' column='1'/>
      <parameter type-id='type-id-2' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3106' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_get_server_id' mangled-name='dbus_connection_get_server_id' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3074' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_server_id'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3074' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_connection_get_is_anonymous' mangled-name='dbus_connection_get_is_anonymous' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3029' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_is_anonymous'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3029' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_unref' mangled-name='dbus_connection_unref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2817' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_unref'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2817' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_connection_get_dispatch_status' mangled-name='dbus_connection_get_dispatch_status' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_dispatch_status'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4378' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='dbus_connection_borrow_message' mangled-name='dbus_connection_borrow_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3850' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_borrow_message'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3850' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='dbus_connection_pop_message' mangled-name='dbus_connection_pop_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4091' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_pop_message'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4091' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='dbus_connection_steal_borrowed_message' mangled-name='dbus_connection_steal_borrowed_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3935' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_steal_borrowed_message'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3935' column='1'/>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3936' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_connection_return_message' mangled-name='dbus_connection_return_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3901' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_return_message'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3901' column='1'/>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3902' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_connection_flush' mangled-name='dbus_connection_flush' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3641' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_flush'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3641' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_connection_send_preallocated' mangled-name='dbus_connection_send_preallocated' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_send_preallocated'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3217' column='1'/>
      <parameter type-id='type-id-125' name='preallocated' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3218' column='1'/>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3219' column='1'/>
      <parameter type-id='type-id-48' name='client_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3220' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_connection_send' mangled-name='dbus_connection_send' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3302' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_send'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3302' column='1'/>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3303' column='1'/>
      <parameter type-id='type-id-48' name='serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3304' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_close' mangled-name='dbus_connection_close' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2932' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_close'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2932' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_connection_open_private' mangled-name='dbus_connection_open_private' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2659' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_open_private'>
      <parameter type-id='type-id-15' name='address' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2659' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2660' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='dbus_connection_open' mangled-name='dbus_connection_open' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2616' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_open'>
      <parameter type-id='type-id-15' name='address' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2616' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2617' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='dbus_connection_send_with_reply' mangled-name='dbus_connection_send_with_reply' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3399' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_send_with_reply'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3399' column='1'/>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3400' column='1'/>
      <parameter type-id='type-id-124' name='pending_return' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3401' column='1'/>
      <parameter type-id='type-id-2' name='timeout_milliseconds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3402' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_send_with_reply_and_block' mangled-name='dbus_connection_send_with_reply_and_block' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3535' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_send_with_reply_and_block'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3535' column='1'/>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3536' column='1'/>
      <parameter type-id='type-id-2' name='timeout_milliseconds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3537' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3538' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='dbus_connection_dispatch' mangled-name='dbus_connection_dispatch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4549' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_dispatch'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4549' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='dbus_connection_read_write' mangled-name='dbus_connection_read_write' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_read_write'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3801' column='1'/>
      <parameter type-id='type-id-2' name='timeout_milliseconds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3802' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_connection_read_write_dispatch' mangled-name='dbus_connection_read_write_dispatch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3769' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_read_write_dispatch'>
      <parameter type-id='type-id-47' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3769' column='1'/>
      <parameter type-id='type-id-2' name='timeout_milliseconds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3770' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-132'>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-102'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-133'>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-17'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-134'>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-43'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-17'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-135'>
      <parameter type-id='type-id-90'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-17'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-136'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-17'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-76'>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-138'>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-139'>
      <parameter type-id='type-id-90'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-140'>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-77'>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-4'/>
    </function-type>
    <typedef-decl name='DBusPendingCallNotifyFunction' type-id='type-id-142' filepath='../dbus/dbus-connection.h' line='162' column='1' id='type-id-89'/>
    <typedef-decl name='DBusTimeoutHandler' type-id='type-id-143' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.h' line='41' column='1' id='type-id-92'/>
    <typedef-decl name='DBusWatchHandler' type-id='type-id-144' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.h' line='43' column='1' id='type-id-94'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-144'/>
    <pointer-type-def type-id='type-id-146' size-in-bits='64' id='type-id-143'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-142'/>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-errors.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <type-decl name='variadic parameter type' id='type-id-148'/>
    <qualified-type-def type-id='type-id-14' const='yes' id='type-id-149'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-150'/>
    <function-decl name='dbus_error_is_set' mangled-name='dbus_error_is_set' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='329' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_error_is_set'>
      <parameter type-id='type-id-150' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='329' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_error_init' mangled-name='dbus_error_init' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_error_init'>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='188' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_error_free' mangled-name='dbus_error_free' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_error_free'>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='211' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_move_error' mangled-name='dbus_move_error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_move_error'>
      <parameter type-id='type-id-21' name='src' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='279' column='1'/>
      <parameter type-id='type-id-21' name='dest' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='280' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_set_error_const' mangled-name='dbus_set_error_const' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_set_error_const'>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='243' column='1'/>
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='244' column='1'/>
      <parameter type-id='type-id-15' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='245' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_set_error' mangled-name='dbus_set_error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_set_error'>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='354' column='1'/>
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='355' column='1'/>
      <parameter type-id='type-id-15' name='format' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='356' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_error_has_name' mangled-name='dbus_error_has_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='302' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_error_has_name'>
      <parameter type-id='type-id-150' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='302' column='1'/>
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-errors.c' line='303' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-memory.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <typedef-decl name='size_t' type-id='type-id-43' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/include/stddef.h' line='211' column='1' id='type-id-151'/>
    <function-decl name='dbus_free' mangled-name='dbus_free' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='701' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_free'>
      <parameter type-id='type-id-10' name='memory' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='701' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_shutdown' mangled-name='dbus_shutdown' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='890' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_shutdown'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_free_string_array' mangled-name='dbus_free_string_array' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='749' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_free_string_array'>
      <parameter type-id='type-id-127' name='str_array' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='749' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_realloc' mangled-name='dbus_realloc' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='601' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_realloc'>
      <parameter type-id='type-id-10' name='memory' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='601' column='1'/>
      <parameter type-id='type-id-151' name='bytes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='602' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='dbus_malloc0' mangled-name='dbus_malloc0' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='531' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_malloc0'>
      <parameter type-id='type-id-151' name='bytes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='531' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='dbus_malloc' mangled-name='dbus_malloc' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_malloc'>
      <parameter type-id='type-id-151' name='bytes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='461' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-message.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-10' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-10' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DBusMessageIter' type-id='type-id-153' filepath='../dbus/dbus-message.h' line='46' column='1' id='type-id-154'/>
    <class-decl name='DBusMessageIter' size-in-bits='576' is-struct='yes' visibility='default' filepath='../dbus/dbus-message.h' line='52' column='1' id='type-id-153'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dummy1' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-message.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dummy2' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-message.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dummy3' type-id='type-id-16' visibility='default' filepath='../dbus/dbus-message.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='dummy4' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-message.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dummy5' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-message.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dummy6' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-message.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dummy7' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-message.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='dummy8' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-message.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dummy9' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-message.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='dummy10' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-message.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dummy11' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-message.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='pad1' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-message.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='pad2' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-message.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='pad3' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-message.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-155'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-156'/>
    <qualified-type-def type-id='type-id-53' const='yes' id='type-id-157'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-158'/>
    <function-decl name='dbus_message_contains_unix_fds' mangled-name='dbus_message_contains_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3825' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_contains_unix_fds'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3825' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_type_to_string' mangled-name='dbus_message_type_to_string' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4691' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_type_to_string'>
      <parameter type-id='type-id-2' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4691' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='dbus_message_demarshal_bytes_needed' mangled-name='dbus_message_demarshal_bytes_needed' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4841' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_demarshal_bytes_needed'>
      <parameter type-id='type-id-15' name='buf' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4841' column='1'/>
      <parameter type-id='type-id-2' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4842' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='dbus_message_type_from_string' mangled-name='dbus_message_type_from_string' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4663' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_type_from_string'>
      <parameter type-id='type-id-15' name='type_str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4663' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='dbus_message_get_data' mangled-name='dbus_message_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4635' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_data'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4635' column='1'/>
      <parameter type-id='type-id-81' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4636' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='dbus_message_set_data' mangled-name='dbus_message_set_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4599' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_data'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4599' column='1'/>
      <parameter type-id='type-id-81' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4600' column='1'/>
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4601' column='1'/>
      <parameter type-id='type-id-38' name='free_data_func' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4602' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_free_data_slot' mangled-name='dbus_message_free_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4578' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_free_data_slot'>
      <parameter type-id='type-id-131' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4578' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_message_allocate_data_slot' mangled-name='dbus_message_allocate_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4560' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_allocate_data_slot'>
      <parameter type-id='type-id-131' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4560' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_ref' mangled-name='dbus_message_ref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1667' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_ref'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1667' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='dbus_message_get_sender' mangled-name='dbus_message_get_sender' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_sender'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3510' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='dbus_message_has_sender' mangled-name='dbus_message_has_sender' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3725' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_sender'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3725' column='1'/>
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3726' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_get_destination' mangled-name='dbus_message_get_destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_destination'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3450' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='dbus_message_has_destination' mangled-name='dbus_message_has_destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3690' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_destination'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3690' column='1'/>
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3691' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_get_error_name' mangled-name='dbus_message_get_error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3397' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_error_name'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3397' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='dbus_message_get_member' mangled-name='dbus_message_get_member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_member'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3313' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='dbus_message_has_member' mangled-name='dbus_message_has_member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3335' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_member'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3335' column='1'/>
      <parameter type-id='type-id-15' name='member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3336' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_get_interface' mangled-name='dbus_message_get_interface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_interface'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3227' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='dbus_message_has_interface' mangled-name='dbus_message_has_interface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_interface'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3249' column='1'/>
      <parameter type-id='type-id-15' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3250' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_get_path' mangled-name='dbus_message_get_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3096' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_path'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3096' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='dbus_message_has_path' mangled-name='dbus_message_has_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_path'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3120' column='1'/>
      <parameter type-id='type-id-15' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3121' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_get_reply_serial' mangled-name='dbus_message_get_reply_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_reply_serial'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1163' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='dbus_message_get_signature' mangled-name='dbus_message_get_signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3543' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_signature'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3543' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='dbus_message_has_signature' mangled-name='dbus_message_has_signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3754' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_signature'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3754' column='1'/>
      <parameter type-id='type-id-15' name='signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3755' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_set_sender' mangled-name='dbus_message_set_sender' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_sender'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3479' column='1'/>
      <parameter type-id='type-id-15' name='sender' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3480' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_set_destination' mangled-name='dbus_message_set_destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3425' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_destination'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3425' column='1'/>
      <parameter type-id='type-id-15' name='destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3426' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_set_reply_serial' mangled-name='dbus_message_set_reply_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_reply_serial'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1143' column='1'/>
      <parameter type-id='type-id-16' name='reply_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1144' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_set_error_name' mangled-name='dbus_message_set_error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_error_name'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3371' column='1'/>
      <parameter type-id='type-id-15' name='error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3372' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_set_member' mangled-name='dbus_message_set_member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_member'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3286' column='1'/>
      <parameter type-id='type-id-15' name='member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3287' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_set_interface' mangled-name='dbus_message_set_interface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_interface'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3198' column='1'/>
      <parameter type-id='type-id-15' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3199' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_get_path_decomposed' mangled-name='dbus_message_get_path_decomposed' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_path_decomposed'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3164' column='1'/>
      <parameter type-id='type-id-128' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3165' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_set_path' mangled-name='dbus_message_set_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3067' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_path'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3067' column='1'/>
      <parameter type-id='type-id-15' name='object_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3068' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_get_auto_start' mangled-name='dbus_message_get_auto_start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3045' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_auto_start'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3045' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_get_no_reply' mangled-name='dbus_message_get_no_reply' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3003' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_no_reply'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3003' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_set_auto_start' mangled-name='dbus_message_set_auto_start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3026' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_auto_start'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3026' column='1'/>
      <parameter type-id='type-id-17' name='auto_start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3027' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_message_set_no_reply' mangled-name='dbus_message_set_no_reply' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2984' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_no_reply'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2984' column='1'/>
      <parameter type-id='type-id-17' name='no_reply' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2985' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_message_iter_abandon_container' mangled-name='dbus_message_iter_abandon_container' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2951' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_abandon_container'>
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2951' column='1'/>
      <parameter type-id='type-id-155' name='sub' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2952' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_message_iter_close_container' mangled-name='dbus_message_iter_close_container' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2918' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_close_container'>
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2918' column='1'/>
      <parameter type-id='type-id-155' name='sub' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2919' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_iter_open_container' mangled-name='dbus_message_iter_open_container' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2849' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_open_container'>
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2849' column='1'/>
      <parameter type-id='type-id-2' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2850' column='1'/>
      <parameter type-id='type-id-15' name='contained_signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2851' column='1'/>
      <parameter type-id='type-id-155' name='sub' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2852' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_iter_append_fixed_array' mangled-name='dbus_message_iter_append_fixed_array' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2791' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_append_fixed_array'>
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2791' column='1'/>
      <parameter type-id='type-id-2' name='element_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2792' column='1'/>
      <parameter type-id='type-id-10' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2793' column='1'/>
      <parameter type-id='type-id-2' name='n_elements' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2794' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_iter_append_basic' mangled-name='dbus_message_iter_append_basic' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2656' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_append_basic'>
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2656' column='1'/>
      <parameter type-id='type-id-2' name='type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2657' column='1'/>
      <parameter type-id='type-id-10' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2658' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_iter_init_append' mangled-name='dbus_message_iter_init_append' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2421' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_init_append'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2421' column='1'/>
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2422' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_message_iter_get_arg_type' mangled-name='dbus_message_iter_get_arg_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_get_arg_type'>
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2139' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='dbus_message_iter_get_fixed_array' mangled-name='dbus_message_iter_get_fixed_array' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2391' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_get_fixed_array'>
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2391' column='1'/>
      <parameter type-id='type-id-10' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2392' column='1'/>
      <parameter type-id='type-id-24' name='n_elements' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2393' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_message_iter_get_array_len' mangled-name='dbus_message_iter_get_array_len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2346' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_get_array_len'>
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2346' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='dbus_message_iter_get_basic' mangled-name='dbus_message_iter_get_basic' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_get_basic'>
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2293' column='1'/>
      <parameter type-id='type-id-10' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2294' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_message_iter_get_signature' mangled-name='dbus_message_iter_get_signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_get_signature'>
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2220' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_message_iter_recurse' mangled-name='dbus_message_iter_recurse' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_recurse'>
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2195' column='1'/>
      <parameter type-id='type-id-155' name='sub' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2196' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_message_iter_get_element_type' mangled-name='dbus_message_iter_get_element_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_get_element_type'>
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2158' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='dbus_message_iter_next' mangled-name='dbus_message_iter_next' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_next'>
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2114' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_iter_has_next' mangled-name='dbus_message_iter_has_next' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2095' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_has_next'>
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2095' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_iter_init' mangled-name='dbus_message_iter_init' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2064' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_init'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2064' column='1'/>
      <parameter type-id='type-id-155' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2065' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_append_args_valist' mangled-name='dbus_message_append_args_valist' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1824' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_append_args_valist'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1824' column='1'/>
      <parameter type-id='type-id-2' name='first_arg_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1825' column='1'/>
      <parameter type-id='type-id-156' name='var_args' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1826' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_append_args' mangled-name='dbus_message_append_args' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1792' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_append_args'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1792' column='1'/>
      <parameter type-id='type-id-2' name='first_arg_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1793' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_get_type' mangled-name='dbus_message_get_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1722' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_type'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1722' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='dbus_message_is_error' mangled-name='dbus_message_is_error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3657' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_is_error'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3657' column='1'/>
      <parameter type-id='type-id-15' name='error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3658' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_is_signal' mangled-name='dbus_message_is_signal' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3630' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_is_signal'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3630' column='1'/>
      <parameter type-id='type-id-15' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3631' column='1'/>
      <parameter type-id='type-id-15' name='signal_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3632' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_is_method_call' mangled-name='dbus_message_is_method_call' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3602' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_is_method_call'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3602' column='1'/>
      <parameter type-id='type-id-15' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3603' column='1'/>
      <parameter type-id='type-id-15' name='method' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3604' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_unref' mangled-name='dbus_message_unref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1690' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_unref'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1690' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_message_demarshal' mangled-name='dbus_message_demarshal' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4783' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_demarshal'>
      <parameter type-id='type-id-15' name='str' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4783' column='1'/>
      <parameter type-id='type-id-2' name='len' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4784' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4785' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='dbus_message_copy' mangled-name='dbus_message_copy' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1587' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_copy'>
      <parameter type-id='type-id-158' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1587' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='dbus_message_new_signal' mangled-name='dbus_message_new_signal' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1424' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new_signal'>
      <parameter type-id='type-id-15' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1424' column='1'/>
      <parameter type-id='type-id-15' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1425' column='1'/>
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1426' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='dbus_message_new_method_call' mangled-name='dbus_message_new_method_call' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new_method_call'>
      <parameter type-id='type-id-15' name='destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1333' column='1'/>
      <parameter type-id='type-id-15' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1334' column='1'/>
      <parameter type-id='type-id-15' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1335' column='1'/>
      <parameter type-id='type-id-15' name='method' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1336' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='dbus_message_new' mangled-name='dbus_message_new' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new'>
      <parameter type-id='type-id-2' name='message_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1289' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='dbus_message_get_serial' mangled-name='dbus_message_get_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_serial'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1127' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='dbus_message_new_error' mangled-name='dbus_message_new_error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1470' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new_error'>
      <parameter type-id='type-id-30' name='reply_to' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1470' column='1'/>
      <parameter type-id='type-id-15' name='error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1471' column='1'/>
      <parameter type-id='type-id-15' name='error_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1472' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='dbus_message_new_error_printf' mangled-name='dbus_message_new_error_printf' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1542' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new_error_printf'>
      <parameter type-id='type-id-30' name='reply_to' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1542' column='1'/>
      <parameter type-id='type-id-15' name='error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1543' column='1'/>
      <parameter type-id='type-id-15' name='error_format' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1544' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='dbus_message_new_method_return' mangled-name='dbus_message_new_method_return' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1373' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new_method_return'>
      <parameter type-id='type-id-30' name='method_call' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1373' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='dbus_message_get_args_valist' mangled-name='dbus_message_get_args_valist' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_args_valist'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2009' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2010' column='1'/>
      <parameter type-id='type-id-2' name='first_arg_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2011' column='1'/>
      <parameter type-id='type-id-156' name='var_args' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2012' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_get_args' mangled-name='dbus_message_get_args' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1980' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_args'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1980' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1981' column='1'/>
      <parameter type-id='type-id-2' name='first_arg_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1982' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_set_error_from_message' mangled-name='dbus_set_error_from_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3796' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_set_error_from_message'>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3796' column='1'/>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3797' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_lock' mangled-name='dbus_message_lock' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_lock'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='384' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_message_marshal' mangled-name='dbus_message_marshal' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4721' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_marshal'>
      <parameter type-id='type-id-30' name='msg' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4721' column='1'/>
      <parameter type-id='type-id-127' name='marshalled_data_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4722' column='1'/>
      <parameter type-id='type-id-24' name='len_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4723' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_message_set_serial' mangled-name='dbus_message_set_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_serial'>
      <parameter type-id='type-id-30' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='254' column='1'/>
      <parameter type-id='type-id-16' name='serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='255' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-misc.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <function-decl name='dbus_get_version' mangled-name='dbus_get_version' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-misc.c' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_get_version'>
      <parameter type-id='type-id-24' name='major_version_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-misc.c' line='161' column='1'/>
      <parameter type-id='type-id-24' name='minor_version_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-misc.c' line='162' column='1'/>
      <parameter type-id='type-id-24' name='micro_version_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-misc.c' line='163' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_get_local_machine_id' mangled-name='dbus_get_local_machine_id' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-misc.c' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_get_local_machine_id'>
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-pending-call.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <typedef-decl name='DBusPendingCallNotifyFunction' type-id='type-id-142' filepath='../dbus/dbus-connection.h' line='162' column='1' id='type-id-89'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-142'/>
    <function-decl name='dbus_pending_call_get_data' mangled-name='dbus_pending_call_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='827' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_get_data'>
      <parameter type-id='type-id-123' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='827' column='1'/>
      <parameter type-id='type-id-81' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='828' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='dbus_pending_call_steal_reply' mangled-name='dbus_pending_call_steal_reply' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='702' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_steal_reply'>
      <parameter type-id='type-id-123' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='702' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='dbus_pending_call_get_completed' mangled-name='dbus_pending_call_get_completed' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='679' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_get_completed'>
      <parameter type-id='type-id-123' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='679' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_pending_call_free_data_slot' mangled-name='dbus_pending_call_free_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='779' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_free_data_slot'>
      <parameter type-id='type-id-131' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='779' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_pending_call_allocate_data_slot' mangled-name='dbus_pending_call_allocate_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='759' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_allocate_data_slot'>
      <parameter type-id='type-id-131' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='759' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_pending_call_block' mangled-name='dbus_pending_call_block' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='737' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_block'>
      <parameter type-id='type-id-123' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='737' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_pending_call_cancel' mangled-name='dbus_pending_call_cancel' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='663' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_cancel'>
      <parameter type-id='type-id-123' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='663' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_pending_call_unref' mangled-name='dbus_pending_call_unref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='597' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_unref'>
      <parameter type-id='type-id-123' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='597' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_pending_call_ref' mangled-name='dbus_pending_call_ref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='577' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_ref'>
      <parameter type-id='type-id-123' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='577' column='1'/>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='dbus_pending_call_set_data' mangled-name='dbus_pending_call_set_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_set_data'>
      <parameter type-id='type-id-123' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='801' column='1'/>
      <parameter type-id='type-id-81' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='802' column='1'/>
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='803' column='1'/>
      <parameter type-id='type-id-38' name='free_data_func' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='804' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_pending_call_set_notify' mangled-name='dbus_pending_call_set_notify' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='622' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_set_notify'>
      <parameter type-id='type-id-123' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='622' column='1'/>
      <parameter type-id='type-id-89' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='623' column='1'/>
      <parameter type-id='type-id-10' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='624' column='1'/>
      <parameter type-id='type-id-38' name='free_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='625' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-147'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-server.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='128' id='type-id-159'>
      <subrange length='16' type-id='type-id-43' id='type-id-160'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='128' id='type-id-161'>
      <subrange length='4' type-id='type-id-43' id='type-id-162'/>
    </array-type-def>
    <class-decl name='DBusServer' size-in-bits='1216' is-struct='yes' visibility='default' filepath='../dbus/dbus-server-protected.h' line='57' column='1' id='type-id-163'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='refcount' type-id='type-id-26' visibility='default' filepath='../dbus/dbus-server-protected.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vtable' type-id='type-id-164' visibility='default' filepath='../dbus/dbus-server-protected.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mutex' type-id='type-id-27' visibility='default' filepath='../dbus/dbus-server-protected.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='guid' type-id='type-id-165' visibility='default' filepath='../dbus/dbus-server-protected.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='guid_hex' type-id='type-id-7' visibility='default' filepath='../dbus/dbus-server-protected.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='watches' type-id='type-id-33' visibility='default' filepath='../dbus/dbus-server-protected.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='timeouts' type-id='type-id-34' visibility='default' filepath='../dbus/dbus-server-protected.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='address' type-id='type-id-22' visibility='default' filepath='../dbus/dbus-server-protected.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='published_address' type-id='type-id-17' visibility='default' filepath='../dbus/dbus-server-protected.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='max_connections' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-server-protected.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='slot_list' type-id='type-id-35' visibility='default' filepath='../dbus/dbus-server-protected.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='new_connection_function' type-id='type-id-166' visibility='default' filepath='../dbus/dbus-server-protected.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='new_connection_data' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-server-protected.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='new_connection_free_data_function' type-id='type-id-38' visibility='default' filepath='../dbus/dbus-server-protected.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='auth_mechanisms' type-id='type-id-127' visibility='default' filepath='../dbus/dbus-server-protected.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='disconnected' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-server-protected.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='have_server_lock' type-id='type-id-3' visibility='default' filepath='../dbus/dbus-server-protected.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DBusServerVTable' type-id='type-id-167' filepath='../dbus/dbus-server-protected.h' line='38' column='1' id='type-id-168'/>
    <class-decl name='DBusServerVTable' size-in-bits='128' is-struct='yes' visibility='default' filepath='../dbus/dbus-server-protected.h' line='44' column='1' id='type-id-167'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='finalize' type-id='type-id-169' visibility='default' filepath='../dbus/dbus-server-protected.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='disconnect' type-id='type-id-169' visibility='default' filepath='../dbus/dbus-server-protected.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DBusServer' type-id='type-id-163' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.h' line='42' column='1' id='type-id-170'/>
    <typedef-decl name='DBusGUID' type-id='type-id-171' filepath='../dbus/dbus-sysdeps.h' line='507' column='1' id='type-id-165'/>
    <union-decl name='DBusGUID' size-in-bits='128' visibility='default' filepath='../dbus/dbus-internals.h' line='351' column='1' id='type-id-171'>
      <data-member access='public'>
        <var-decl name='as_uint32s' type-id='type-id-161' visibility='default' filepath='../dbus/dbus-internals.h' line='352' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='as_bytes' type-id='type-id-159' visibility='default' filepath='../dbus/dbus-internals.h' line='353' column='1'/>
      </data-member>
    </union-decl>
    <typedef-decl name='DBusNewConnectionFunction' type-id='type-id-172' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.h' line='47' column='1' id='type-id-166'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-173'/>
    <qualified-type-def type-id='type-id-168' const='yes' id='type-id-174'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-164'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-175'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-169'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-172'/>
    <function-decl name='dbus_server_get_data' mangled-name='dbus_server_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_get_data'>
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1156' column='1'/>
      <parameter type-id='type-id-2' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1157' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='dbus_server_set_new_connection_function' mangled-name='dbus_server_set_new_connection_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='889' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_set_new_connection_function'>
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='889' column='1'/>
      <parameter type-id='type-id-166' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='890' column='1'/>
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='891' column='1'/>
      <parameter type-id='type-id-38' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='892' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_server_get_is_connected' mangled-name='dbus_server_get_is_connected' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='797' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_get_is_connected'>
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='797' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_server_set_data' mangled-name='dbus_server_set_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_set_data'>
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1116' column='1'/>
      <parameter type-id='type-id-2' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1117' column='1'/>
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1118' column='1'/>
      <parameter type-id='type-id-38' name='free_data_func' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1119' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_server_free_data_slot' mangled-name='dbus_server_free_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1095' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_free_data_slot'>
      <parameter type-id='type-id-131' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1095' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_server_allocate_data_slot' mangled-name='dbus_server_allocate_data_slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1077' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_allocate_data_slot'>
      <parameter type-id='type-id-131' name='slot_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1077' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_server_set_auth_mechanisms' mangled-name='dbus_server_set_auth_mechanisms' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1033' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_set_auth_mechanisms'>
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1033' column='1'/>
      <parameter type-id='type-id-175' name='mechanisms' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1034' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_server_set_timeout_functions' mangled-name='dbus_server_set_timeout_functions' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='982' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_set_timeout_functions'>
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='982' column='1'/>
      <parameter type-id='type-id-109' name='add_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='983' column='1'/>
      <parameter type-id='type-id-112' name='remove_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='984' column='1'/>
      <parameter type-id='type-id-113' name='toggled_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='985' column='1'/>
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='986' column='1'/>
      <parameter type-id='type-id-38' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='987' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_server_set_watch_functions' mangled-name='dbus_server_set_watch_functions' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='929' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_set_watch_functions'>
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='929' column='1'/>
      <parameter type-id='type-id-115' name='add_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='930' column='1'/>
      <parameter type-id='type-id-118' name='remove_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='931' column='1'/>
      <parameter type-id='type-id-119' name='toggled_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='932' column='1'/>
      <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='933' column='1'/>
      <parameter type-id='type-id-38' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='934' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_server_get_id' mangled-name='dbus_server_get_id' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='854' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_get_id'>
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='854' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_server_get_address' mangled-name='dbus_server_get_address' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='818' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_get_address'>
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='818' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dbus_server_unref' mangled-name='dbus_server_unref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='720' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_unref'>
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='720' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_server_ref' mangled-name='dbus_server_ref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='687' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_ref'>
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='687' column='1'/>
      <return type-id='type-id-173'/>
    </function-decl>
    <function-decl name='dbus_server_disconnect' mangled-name='dbus_server_disconnect' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='770' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_disconnect'>
      <parameter type-id='type-id-173' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='770' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_server_listen' mangled-name='dbus_server_listen' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='549' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_server_listen'>
      <parameter type-id='type-id-15' name='address' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='549' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='550' column='1'/>
      <return type-id='type-id-173'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-176'>
      <parameter type-id='type-id-173'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-177'>
      <parameter type-id='type-id-173'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-signature.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <typedef-decl name='DBusSignatureIter' type-id='type-id-178' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.h' line='51' column='1' id='type-id-179'/>
    <class-decl name='__anonymous_struct__' size-in-bits='256' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-179' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.h' line='45' column='1' id='type-id-178'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dummy1' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dummy2' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dummy8' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='dummy12' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dummy17' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-180'/>
    <qualified-type-def type-id='type-id-179' const='yes' id='type-id-181'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-182'/>
    <function-decl name='dbus_signature_iter_init' mangled-name='dbus_signature_iter_init' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_signature_iter_init'>
      <parameter type-id='type-id-180' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='67' column='1'/>
      <parameter type-id='type-id-15' name='signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='68' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_type_is_valid' mangled-name='dbus_type_is_valid' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_type_is_valid'>
      <parameter type-id='type-id-2' name='typecode' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='383' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_type_is_fixed' mangled-name='dbus_type_is_fixed' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_type_is_fixed'>
      <parameter type-id='type-id-2' name='typecode' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='349' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_type_is_basic' mangled-name='dbus_type_is_basic' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_type_is_basic'>
      <parameter type-id='type-id-2' name='typecode' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='318' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_type_is_container' mangled-name='dbus_type_is_container' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_type_is_container'>
      <parameter type-id='type-id-2' name='typecode' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='294' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_signature_validate' mangled-name='dbus_signature_validate' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_signature_validate'>
      <parameter type-id='type-id-15' name='signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='233' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='234' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_signature_iter_next' mangled-name='dbus_signature_iter_next' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_signature_iter_next'>
      <parameter type-id='type-id-180' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='164' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_signature_iter_get_current_type' mangled-name='dbus_signature_iter_get_current_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='92' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_signature_iter_get_current_type'>
      <parameter type-id='type-id-182' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='92' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='dbus_signature_validate_single' mangled-name='dbus_signature_validate_single' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_signature_validate_single'>
      <parameter type-id='type-id-15' name='signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='264' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='265' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_signature_iter_recurse' mangled-name='dbus_signature_iter_recurse' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_signature_iter_recurse'>
      <parameter type-id='type-id-182' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='207' column='1'/>
      <parameter type-id='type-id-180' name='subiter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='208' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='dbus_signature_iter_get_element_type' mangled-name='dbus_signature_iter_get_element_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_signature_iter_get_element_type'>
      <parameter type-id='type-id-182' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='146' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='dbus_signature_iter_get_signature' mangled-name='dbus_signature_iter_get_signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_signature_iter_get_signature'>
      <parameter type-id='type-id-182' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-signature.c' line='112' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-syntax.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <function-decl name='dbus_validate_utf8' mangled-name='dbus_validate_utf8' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_validate_utf8'>
      <parameter type-id='type-id-15' name='alleged_utf8' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='289' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='290' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_validate_bus_name' mangled-name='dbus_validate_bus_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_validate_bus_name'>
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='242' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='243' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_validate_error_name' mangled-name='dbus_validate_error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_validate_error_name'>
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='195' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='196' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_validate_member' mangled-name='dbus_validate_member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_validate_member'>
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='148' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='149' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_validate_interface' mangled-name='dbus_validate_interface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_validate_interface'>
      <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='101' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='102' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dbus_validate_path' mangled-name='dbus_validate_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_validate_path'>
      <parameter type-id='type-id-15' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='54' column='1'/>
      <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-syntax.c' line='55' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-sysdeps.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <function-decl name='dbus_setenv' mangled-name='dbus_setenv' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-sysdeps.c' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_setenv'>
      <parameter type-id='type-id-15' name='varname' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-sysdeps.c' line='114' column='1'/>
      <parameter type-id='type-id-15' name='value' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-sysdeps.c' line='115' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dbus-threads.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
    <class-decl name='DBusMutex' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-183'/>
    <typedef-decl name='DBusThreadFunctions' type-id='type-id-184' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='178' column='1' id='type-id-185'/>
    <class-decl name='__anonymous_struct__' size-in-bits='1216' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-185' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='153' column='1' id='type-id-184'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mask' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mutex_new' type-id='type-id-186' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mutex_free' type-id='type-id-187' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mutex_lock' type-id='type-id-188' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mutex_unlock' type-id='type-id-189' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='condvar_new' type-id='type-id-190' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='condvar_free' type-id='type-id-191' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='condvar_wait' type-id='type-id-192' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='condvar_wait_timeout' type-id='type-id-193' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='condvar_wake_one' type-id='type-id-194' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='condvar_wake_all' type-id='type-id-195' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='recursive_mutex_new' type-id='type-id-196' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='recursive_mutex_free' type-id='type-id-197' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='recursive_mutex_lock' type-id='type-id-198' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='recursive_mutex_unlock' type-id='type-id-199' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='padding1' type-id='type-id-200' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='padding2' type-id='type-id-200' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='padding3' type-id='type-id-200' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='padding4' type-id='type-id-200' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='176' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DBusMutexNewFunction' type-id='type-id-201' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='46' column='1' id='type-id-186'/>
    <typedef-decl name='DBusMutex' type-id='type-id-183' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='41' column='1' id='type-id-202'/>
    <typedef-decl name='DBusMutexFreeFunction' type-id='type-id-203' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='48' column='1' id='type-id-187'/>
    <typedef-decl name='DBusMutexLockFunction' type-id='type-id-204' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='50' column='1' id='type-id-188'/>
    <typedef-decl name='DBusMutexUnlockFunction' type-id='type-id-204' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='52' column='1' id='type-id-189'/>
    <typedef-decl name='DBusCondVarNewFunction' type-id='type-id-205' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='77' column='1' id='type-id-190'/>
    <typedef-decl name='DBusCondVarFreeFunction' type-id='type-id-206' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='80' column='1' id='type-id-191'/>
    <typedef-decl name='DBusCondVarWaitFunction' type-id='type-id-207' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='92' column='1' id='type-id-192'/>
    <typedef-decl name='DBusCondVarWaitTimeoutFunction' type-id='type-id-208' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='101' column='1' id='type-id-193'/>
    <typedef-decl name='DBusCondVarWakeOneFunction' type-id='type-id-206' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='108' column='1' id='type-id-194'/>
    <typedef-decl name='DBusCondVarWakeAllFunction' type-id='type-id-206' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='114' column='1' id='type-id-195'/>
    <typedef-decl name='DBusRecursiveMutexNewFunction' type-id='type-id-201' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='61' column='1' id='type-id-196'/>
    <typedef-decl name='DBusRecursiveMutexFreeFunction' type-id='type-id-203' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='64' column='1' id='type-id-197'/>
    <typedef-decl name='DBusRecursiveMutexLockFunction' type-id='type-id-203' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='68' column='1' id='type-id-198'/>
    <typedef-decl name='DBusRecursiveMutexUnlockFunction' type-id='type-id-203' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-threads.h' line='72' column='1' id='type-id-199'/>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-205'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' id='type-id-210'/>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' id='type-id-201'/>
    <qualified-type-def type-id='type-id-185' const='yes' id='type-id-212'/>
    <pointer-type-def type-id='type-id-212' size-in-bits='64' id='type-id-213'/>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' id='type-id-208'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-204'/>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-200'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-206'/>
