<abi-corpus version='2.0' path='data/test-read-dwarf/test15-pr18892.so' soname='libtsan.so.0'>
  <elf-needed>
    <dependency name='librt.so.1'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
    <dependency name='libgcc_s.so.1'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='AnnotateBenignRace' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AnnotateBenignRaceSized' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AnnotateCondVarSignal' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AnnotateCondVarSignalAll' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AnnotateCondVarWait' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AnnotateEnableRaceDetection' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='AnnotateExpectRace' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='strncasecmp' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='strncmp' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='strncpy' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='strptime' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='strrchr' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='strstr' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='strtoimax' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='strtoumax' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='sysinfo' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tcgetattr' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tempnam' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='textdomain' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='time' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='times' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tmpnam' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tmpnam_r' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='unlink' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='usleep' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='valloc' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vfscanf' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vscanf' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='vsscanf' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wait' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wait3' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wait4' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='waitid' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='waitpid' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wcsnrtombs' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wcsrtombs' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wcstombs' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wordexp' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='write' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='writev' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='__asan_cplus_demangle_builtin_types' size='1056' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='__asan_cplus_demangle_operators' size='1488' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='../../.././libsanitizer/interception/interception_linux.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/interception' language='LANG_C_plus_plus'>
    <function-decl name='dlvsym' filepath='/usr/include/dlfcn.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-2'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-1'/>
    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-3'/>
    <type-decl name='void' id='type-id-4'/>
    <type-decl name='char' size-in-bits='8' id='type-id-5'/>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/interception/interception_type_test.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/interception' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <class-decl name='backtrace_freelist_struct' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='55' column='1' id='type-id-6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-7' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-8' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='60' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='backtrace_state' size-in-bits='576' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='127' column='1' id='type-id-9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='filename' type-id='type-id-2' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='threaded' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lock' type-id='type-id-1' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fileline_fn' type-id='type-id-11' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fileline_data' type-id='type-id-1' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='syminfo_fn' type-id='type-id-12' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='syminfo_data' type-id='type-id-1' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='fileline_initialization_failed' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='lock_alloc' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='freelist' type-id='type-id-7' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='150' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='fileline' type-id='type-id-13' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='114' column='1' id='type-id-11'/>
    <typedef-decl name='syminfo' type-id='type-id-14' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='121' column='1' id='type-id-12'/>
    <class-decl name='backtrace_vector' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='221' column='1' id='type-id-15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='base' type-id='type-id-1' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-8' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='alc' type-id='type-id-8' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='228' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__compar_fn_t' type-id='type-id-16' filepath='/usr/include/stdlib.h' line='742' column='1' id='type-id-17'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-7'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-18'/>
    <qualified-type-def type-id='type-id-19' const='yes' id='type-id-20'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-21'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-22'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-13'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-14'/>
    <function-decl name='__asan_backtrace_dwarf_add' mangled-name='__asan_backtrace_dwarf_add' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2958' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_dwarf_add'>
      <parameter type-id='type-id-25' name='state' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2958' column='1'/>
      <parameter type-id='type-id-26' name='base_address' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2959' column='1'/>
      <parameter type-id='type-id-21' name='dwarf_info' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2960' column='1'/>
      <parameter type-id='type-id-8' name='dwarf_info_size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2961' column='1'/>
      <parameter type-id='type-id-21' name='dwarf_line' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2962' column='1'/>
      <parameter type-id='type-id-8' name='dwarf_line_size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2963' column='1'/>
      <parameter type-id='type-id-21' name='dwarf_abbrev' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2964' column='1'/>
      <parameter type-id='type-id-8' name='dwarf_abbrev_size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2965' column='1'/>
      <parameter type-id='type-id-21' name='dwarf_ranges' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2966' column='1'/>
      <parameter type-id='type-id-8' name='dwarf_ranges_size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2967' column='1'/>
      <parameter type-id='type-id-21' name='dwarf_str' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2968' column='1'/>
      <parameter type-id='type-id-8' name='dwarf_str_size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2969' column='1'/>
      <parameter type-id='type-id-10' name='is_bigendian' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2970' column='1'/>
      <parameter type-id='type-id-27' name='error_callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2971' column='1'/>
      <parameter type-id='type-id-1' name='data' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2972' column='1'/>
      <parameter type-id='type-id-22' name='fileline_fn' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2972' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='__asan_backtrace_vector_grow' mangled-name='__asan_backtrace_vector_grow' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_vector_grow'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='snprintf' filepath='/usr/include/stdio.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-2'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='__asan_backtrace_free' mangled-name='__asan_backtrace_free' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_free'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__asan_internal_memset' filepath='../../.././libsanitizer/libbacktrace/backtrace-rename.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='bsearch' filepath='/usr/include/stdlib.h' line='755' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__asan_internal_strnlen' filepath='../../.././libsanitizer/libbacktrace/backtrace-rename.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__asan_internal_strcmp' filepath='../../.././libsanitizer/libbacktrace/backtrace-rename.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='__asan_backtrace_alloc' mangled-name='__asan_backtrace_alloc' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_alloc'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__asan_backtrace_qsort' mangled-name='__asan_backtrace_qsort' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_qsort'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__asan_backtrace_vector_release' mangled-name='__asan_backtrace_vector_release' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_vector_release'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-25'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-28'/>
    <function-type size-in-bits='64' id='type-id-23'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-24'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-4'/>
    </function-type>
    <type-decl name='int' size-in-bits='32' id='type-id-10'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-16'/>
    <typedef-decl name='backtrace_error_callback' type-id='type-id-32' filepath='../../.././libsanitizer/../libbacktrace/backtrace.h' line='82' column='1' id='type-id-27'/>
    <typedef-decl name='size_t' type-id='type-id-33' filepath='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/host-x86_64-unknown-linux-gnu/gcc/include/stddef.h' line='212' column='1' id='type-id-8'/>
    <typedef-decl name='uintptr_t' type-id='type-id-33' filepath='/usr/include/stdint.h' line='123' column='1' id='type-id-26'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-19'/>
    <typedef-decl name='backtrace_full_callback' type-id='type-id-34' filepath='../../.././libsanitizer/../libbacktrace/backtrace.h' line='110' column='1' id='type-id-29'/>
    <typedef-decl name='backtrace_syminfo_callback' type-id='type-id-35' filepath='../../.././libsanitizer/../libbacktrace/backtrace.h' line='175' column='1' id='type-id-30'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-33'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-32'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-34'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-35'/>
    <function-type size-in-bits='64' id='type-id-37'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-38'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/elf.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <function-decl name='dl_iterate_phdr' filepath='/usr/include/link.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-39'/>
    <function-type size-in-bits='64' id='type-id-40'>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-10'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <function-decl name='__asan_backtrace_pcinfo' mangled-name='__asan_backtrace_pcinfo' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_pcinfo'>
      <parameter type-id='type-id-25' name='state' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='166' column='1'/>
      <parameter type-id='type-id-26' name='pc' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='166' column='1'/>
      <parameter type-id='type-id-29' name='callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='167' column='1'/>
      <parameter type-id='type-id-27' name='error_callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='168' column='1'/>
      <parameter type-id='type-id-1' name='data' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='168' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='__asan_backtrace_syminfo' mangled-name='__asan_backtrace_syminfo' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_syminfo'>
      <parameter type-id='type-id-25' name='state' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='182' column='1'/>
      <parameter type-id='type-id-26' name='pc' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='182' column='1'/>
      <parameter type-id='type-id-30' name='callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='183' column='1'/>
      <parameter type-id='type-id-27' name='error_callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='184' column='1'/>
      <parameter type-id='type-id-1' name='data' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='184' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='__asan_backtrace_open' mangled-name='__asan_backtrace_open' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_open'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-42'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='__asan_backtrace_initialize' mangled-name='__asan_backtrace_initialize' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_initialize'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-42'/>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <function-decl name='__asan_backtrace_vector_finish' mangled-name='__asan_backtrace_vector_finish' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='258' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_vector_finish'>
      <parameter type-id='type-id-25' name='state' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='259' column='1'/>
      <parameter type-id='type-id-18' name='vec' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='260' column='1'/>
      <parameter type-id='type-id-27' name='error_callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='261' column='1'/>
      <parameter type-id='type-id-1' name='data' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='262' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <typedef-decl name='off_t' type-id='type-id-43' filepath='/usr/include/sys/types.h' line='87' column='1' id='type-id-44'/>
    <typedef-decl name='__off_t' type-id='type-id-45' filepath='/usr/include/bits/types.h' line='141' column='1' id='type-id-43'/>
    <class-decl name='backtrace_view' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='169' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-1' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='base' type-id='type-id-1' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='len' type-id='type-id-8' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='176' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-47'/>
    <function-decl name='__asan_backtrace_get_view' mangled-name='__asan_backtrace_get_view' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_get_view'>
      <parameter type-id='type-id-25' name='state' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='53' column='1'/>
      <parameter type-id='type-id-10' name='descriptor' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='54' column='1'/>
      <parameter type-id='type-id-44' name='offset' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='54' column='1'/>
      <parameter type-id='type-id-8' name='size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='54' column='1'/>
      <parameter type-id='type-id-27' name='error_callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='55' column='1'/>
      <parameter type-id='type-id-1' name='data' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='56' column='1'/>
      <parameter type-id='type-id-47' name='view' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='56' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='__asan_backtrace_release_view' mangled-name='__asan_backtrace_release_view' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_release_view'>
      <parameter type-id='type-id-25' name='state' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='87' column='1'/>
      <parameter type-id='type-id-47' name='view' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='88' column='1'/>
      <parameter type-id='type-id-27' name='error_callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='89' column='1'/>
      <parameter type-id='type-id-1' name='data' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='90' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='getpagesize' filepath='/usr/include/unistd.h' line='992' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='mmap' filepath='/usr/include/sys/mman.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='munmap' filepath='/usr/include/sys/mman.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <type-decl name='long int' size-in-bits='64' id='type-id-45'/>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/posix.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <function-decl name='__asan_backtrace_close' mangled-name='__asan_backtrace_close' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/posix.c' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_close'>
      <parameter type-id='type-id-10' name='descriptor' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/posix.c' line='91' column='1'/>
      <parameter type-id='type-id-27' name='error_callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/posix.c' line='91' column='1'/>
      <parameter type-id='type-id-1' name='data' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/posix.c' line='92' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='open' filepath='/usr/include/fcntl.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-10'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='fcntl' filepath='/usr/include/fcntl.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/bits/errno.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <function-decl name='__asan_backtrace_create_state' mangled-name='__asan_backtrace_create_state' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_create_state'>
      <parameter type-id='type-id-2' name='filename' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='46' column='1'/>
      <parameter type-id='type-id-10' name='threaded' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='46' column='1'/>
      <parameter type-id='type-id-27' name='error_callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='47' column='1'/>
      <parameter type-id='type-id-1' name='data' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='48' column='1'/>
      <return type-id='type-id-25'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='8448' id='type-id-49'>
      <subrange length='33' type-id='type-id-50' id='type-id-51'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-52' size-in-bits='11904' id='type-id-53'>
      <subrange length='62' type-id='type-id-50' id='type-id-54'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-55' size-in-bits='8448' id='type-id-56'>
      <subrange length='33' type-id='type-id-50' id='type-id-51'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-57' size-in-bits='11904' id='type-id-58'>
      <subrange length='62' type-id='type-id-50' id='type-id-54'/>
    </array-type-def>
    <class-decl name='demangle_component' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='453' column='1' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-60' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='u' type-id='type-id-61' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='560' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='demangle_component_type' filepath='../../.././libsanitizer/../include/demangle.h' line='223' column='1' id='type-id-60'>
      <underlying-type type-id='type-id-62'/>
      <enumerator name='DEMANGLE_COMPONENT_NAME' value='0'/>
      <enumerator name='DEMANGLE_COMPONENT_QUAL_NAME' value='1'/>
      <enumerator name='DEMANGLE_COMPONENT_LOCAL_NAME' value='2'/>
      <enumerator name='DEMANGLE_COMPONENT_TYPED_NAME' value='3'/>
      <enumerator name='DEMANGLE_COMPONENT_TEMPLATE' value='4'/>
      <enumerator name='DEMANGLE_COMPONENT_TEMPLATE_PARAM' value='5'/>
      <enumerator name='DEMANGLE_COMPONENT_FUNCTION_PARAM' value='6'/>
      <enumerator name='DEMANGLE_COMPONENT_CTOR' value='7'/>
      <enumerator name='DEMANGLE_COMPONENT_DTOR' value='8'/>
      <enumerator name='DEMANGLE_COMPONENT_VTABLE' value='9'/>
      <enumerator name='DEMANGLE_COMPONENT_VTT' value='10'/>
      <enumerator name='DEMANGLE_COMPONENT_CONSTRUCTION_VTABLE' value='11'/>
      <enumerator name='DEMANGLE_COMPONENT_TYPEINFO' value='12'/>
      <enumerator name='DEMANGLE_COMPONENT_TYPEINFO_NAME' value='13'/>
      <enumerator name='DEMANGLE_COMPONENT_TYPEINFO_FN' value='14'/>
      <enumerator name='DEMANGLE_COMPONENT_THUNK' value='15'/>
      <enumerator name='DEMANGLE_COMPONENT_VIRTUAL_THUNK' value='16'/>
      <enumerator name='DEMANGLE_COMPONENT_COVARIANT_THUNK' value='17'/>
      <enumerator name='DEMANGLE_COMPONENT_JAVA_CLASS' value='18'/>
      <enumerator name='DEMANGLE_COMPONENT_GUARD' value='19'/>
      <enumerator name='DEMANGLE_COMPONENT_TLS_INIT' value='20'/>
      <enumerator name='DEMANGLE_COMPONENT_TLS_WRAPPER' value='21'/>
      <enumerator name='DEMANGLE_COMPONENT_REFTEMP' value='22'/>
      <enumerator name='DEMANGLE_COMPONENT_HIDDEN_ALIAS' value='23'/>
      <enumerator name='DEMANGLE_COMPONENT_SUB_STD' value='24'/>
      <enumerator name='DEMANGLE_COMPONENT_RESTRICT' value='25'/>
      <enumerator name='DEMANGLE_COMPONENT_VOLATILE' value='26'/>
      <enumerator name='DEMANGLE_COMPONENT_CONST' value='27'/>
      <enumerator name='DEMANGLE_COMPONENT_RESTRICT_THIS' value='28'/>
      <enumerator name='DEMANGLE_COMPONENT_VOLATILE_THIS' value='29'/>
      <enumerator name='DEMANGLE_COMPONENT_CONST_THIS' value='30'/>
      <enumerator name='DEMANGLE_COMPONENT_REFERENCE_THIS' value='31'/>
      <enumerator name='DEMANGLE_COMPONENT_RVALUE_REFERENCE_THIS' value='32'/>
      <enumerator name='DEMANGLE_COMPONENT_VENDOR_TYPE_QUAL' value='33'/>
      <enumerator name='DEMANGLE_COMPONENT_POINTER' value='34'/>
      <enumerator name='DEMANGLE_COMPONENT_REFERENCE' value='35'/>
      <enumerator name='DEMANGLE_COMPONENT_RVALUE_REFERENCE' value='36'/>
      <enumerator name='DEMANGLE_COMPONENT_COMPLEX' value='37'/>
      <enumerator name='DEMANGLE_COMPONENT_IMAGINARY' value='38'/>
      <enumerator name='DEMANGLE_COMPONENT_BUILTIN_TYPE' value='39'/>
      <enumerator name='DEMANGLE_COMPONENT_VENDOR_TYPE' value='40'/>
      <enumerator name='DEMANGLE_COMPONENT_FUNCTION_TYPE' value='41'/>
      <enumerator name='DEMANGLE_COMPONENT_ARRAY_TYPE' value='42'/>
      <enumerator name='DEMANGLE_COMPONENT_PTRMEM_TYPE' value='43'/>
      <enumerator name='DEMANGLE_COMPONENT_FIXED_TYPE' value='44'/>
      <enumerator name='DEMANGLE_COMPONENT_VECTOR_TYPE' value='45'/>
      <enumerator name='DEMANGLE_COMPONENT_ARGLIST' value='46'/>
      <enumerator name='DEMANGLE_COMPONENT_TEMPLATE_ARGLIST' value='47'/>
      <enumerator name='DEMANGLE_COMPONENT_INITIALIZER_LIST' value='48'/>
      <enumerator name='DEMANGLE_COMPONENT_OPERATOR' value='49'/>
      <enumerator name='DEMANGLE_COMPONENT_EXTENDED_OPERATOR' value='50'/>
      <enumerator name='DEMANGLE_COMPONENT_CAST' value='51'/>
      <enumerator name='DEMANGLE_COMPONENT_NULLARY' value='52'/>
      <enumerator name='DEMANGLE_COMPONENT_UNARY' value='53'/>
      <enumerator name='DEMANGLE_COMPONENT_BINARY' value='54'/>
      <enumerator name='DEMANGLE_COMPONENT_BINARY_ARGS' value='55'/>
      <enumerator name='DEMANGLE_COMPONENT_TRINARY' value='56'/>
      <enumerator name='DEMANGLE_COMPONENT_TRINARY_ARG1' value='57'/>
      <enumerator name='DEMANGLE_COMPONENT_TRINARY_ARG2' value='58'/>
      <enumerator name='DEMANGLE_COMPONENT_LITERAL' value='59'/>
      <enumerator name='DEMANGLE_COMPONENT_LITERAL_NEG' value='60'/>
      <enumerator name='DEMANGLE_COMPONENT_JAVA_RESOURCE' value='61'/>
      <enumerator name='DEMANGLE_COMPONENT_COMPOUND_NAME' value='62'/>
      <enumerator name='DEMANGLE_COMPONENT_CHARACTER' value='63'/>
      <enumerator name='DEMANGLE_COMPONENT_NUMBER' value='64'/>
      <enumerator name='DEMANGLE_COMPONENT_DECLTYPE' value='65'/>
      <enumerator name='DEMANGLE_COMPONENT_GLOBAL_CONSTRUCTORS' value='66'/>
      <enumerator name='DEMANGLE_COMPONENT_GLOBAL_DESTRUCTORS' value='67'/>
      <enumerator name='DEMANGLE_COMPONENT_LAMBDA' value='68'/>
      <enumerator name='DEMANGLE_COMPONENT_DEFAULT_ARG' value='69'/>
      <enumerator name='DEMANGLE_COMPONENT_UNNAMED_TYPE' value='70'/>
      <enumerator name='DEMANGLE_COMPONENT_TRANSACTION_CLONE' value='71'/>
      <enumerator name='DEMANGLE_COMPONENT_NONTRANSACTION_CLONE' value='72'/>
      <enumerator name='DEMANGLE_COMPONENT_PACK_EXPANSION' value='73'/>
      <enumerator name='DEMANGLE_COMPONENT_TAGGED_NAME' value='74'/>
      <enumerator name='DEMANGLE_COMPONENT_CLONE' value='75'/>
    </enum-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='458' column='1' id='type-id-61'>
      <data-member access='public'>
        <var-decl name='s_name' type-id='type-id-63' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='467' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_operator' type-id='type-id-64' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='474' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_extended_operator' type-id='type-id-65' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='483' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_fixed' type-id='type-id-66' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='494' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_ctor' type-id='type-id-67' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='503' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_dtor' type-id='type-id-68' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='512' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_builtin' type-id='type-id-69' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='519' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_string' type-id='type-id-70' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='528' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_number' type-id='type-id-71' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='535' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_character' type-id='type-id-72' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='541' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_binary' type-id='type-id-73' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='550' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s_unary_num' type-id='type-id-74' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='558' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='461' column='1' id='type-id-63'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s' type-id='type-id-2' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='466' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='470' column='1' id='type-id-64'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-75' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='473' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='demangle_operator_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='37' column='1' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='code' type-id='type-id-2' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-2' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='len' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='args' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='477' column='1' id='type-id-65'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='args' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-76' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='482' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='486' column='1' id='type-id-66'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='type-id-76' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='489' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='accum' type-id='type-id-77' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='sat' type-id='type-id-77' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='493' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='497' column='1' id='type-id-67'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kind' type-id='type-id-78' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-76' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='502' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='gnu_v3_ctor_kinds' filepath='../../.././libsanitizer/../include/demangle.h' line='172' column='1' id='type-id-78'>
      <underlying-type type-id='type-id-62'/>
      <enumerator name='gnu_v3_complete_object_ctor' value='1'/>
      <enumerator name='gnu_v3_base_object_ctor' value='2'/>
      <enumerator name='gnu_v3_complete_object_allocating_ctor' value='3'/>
      <enumerator name='gnu_v3_unified_ctor' value='4'/>
      <enumerator name='gnu_v3_object_ctor_group' value='5'/>
    </enum-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='506' column='1' id='type-id-68'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kind' type-id='type-id-79' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-76' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='511' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='gnu_v3_dtor_kinds' filepath='../../.././libsanitizer/../include/demangle.h' line='191' column='1' id='type-id-79'>
      <underlying-type type-id='type-id-62'/>
      <enumerator name='gnu_v3_deleting_dtor' value='1'/>
      <enumerator name='gnu_v3_complete_object_dtor' value='2'/>
      <enumerator name='gnu_v3_base_object_dtor' value='3'/>
      <enumerator name='gnu_v3_unified_dtor' value='4'/>
      <enumerator name='gnu_v3_object_dtor_group' value='5'/>
    </enum-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='515' column='1' id='type-id-69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-80' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='518' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='demangle_builtin_type_info' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='77' column='1' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-2' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='java_name' type-id='type-id-2' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='java_len' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='print' type-id='type-id-81' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='d_builtin_type_print' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='51' column='1' id='type-id-81'>
      <underlying-type type-id='type-id-62'/>
      <enumerator name='D_PRINT_DEFAULT' value='0'/>
      <enumerator name='D_PRINT_INT' value='1'/>
      <enumerator name='D_PRINT_UNSIGNED' value='2'/>
      <enumerator name='D_PRINT_LONG' value='3'/>
      <enumerator name='D_PRINT_UNSIGNED_LONG' value='4'/>
      <enumerator name='D_PRINT_LONG_LONG' value='5'/>
      <enumerator name='D_PRINT_UNSIGNED_LONG_LONG' value='6'/>
      <enumerator name='D_PRINT_BOOL' value='7'/>
      <enumerator name='D_PRINT_FLOAT' value='8'/>
      <enumerator name='D_PRINT_VOID' value='9'/>
    </enum-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='522' column='1' id='type-id-70'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='string' type-id='type-id-2' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='527' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='531' column='1' id='type-id-71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='number' type-id='type-id-45' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='534' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='538' column='1' id='type-id-72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='character' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='540' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='544' column='1' id='type-id-73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='left' type-id='type-id-76' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='right' type-id='type-id-76' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='549' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='552' column='1' id='type-id-74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sub' type-id='type-id-76' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='num' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='557' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='d_info' size-in-bits='768' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='93' column='1' id='type-id-82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s' type-id='type-id-2' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='send' type-id='type-id-2' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='options' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='n' type-id='type-id-2' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='comps' type-id='type-id-76' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='next_comp' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='num_comps' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='subs' type-id='type-id-83' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='next_sub' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='num_subs' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='did_subs' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='last_name' type-id='type-id-76' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='expansion' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='is_expression' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='is_conversion' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='129' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-55' const='yes' id='type-id-48'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-80'/>
    <qualified-type-def type-id='type-id-59' const='yes' id='type-id-84'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-85'/>
    <qualified-type-def type-id='type-id-57' const='yes' id='type-id-52'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-75'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-86'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-76'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-83'/>
    <function-decl name='__asan_cplus_demangle_fill_name' mangled-name='__asan_cplus_demangle_fill_name' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='783' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_fill_name'>
      <parameter type-id='type-id-76' name='p' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='783' column='1'/>
      <parameter type-id='type-id-2' name='s' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='783' column='1'/>
      <parameter type-id='type-id-10' name='len' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='783' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='__asan_cplus_demangle_fill_extended_operator' mangled-name='__asan_cplus_demangle_fill_extended_operator' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='797' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_fill_extended_operator'>
      <parameter type-id='type-id-76' name='p' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='797' column='1'/>
      <parameter type-id='type-id-10' name='args' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='797' column='1'/>
      <parameter type-id='type-id-76' name='name' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='798' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='__asan_cplus_demangle_fill_ctor' mangled-name='__asan_cplus_demangle_fill_ctor' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='812' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_fill_ctor'>
      <parameter type-id='type-id-76' name='p' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='812' column='1'/>
      <parameter type-id='type-id-78' name='kind' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='813' column='1'/>
      <parameter type-id='type-id-76' name='name' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='814' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='__asan_cplus_demangle_fill_dtor' mangled-name='__asan_cplus_demangle_fill_dtor' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='831' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_fill_dtor'>
      <parameter type-id='type-id-76' name='p' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='831' column='1'/>
      <parameter type-id='type-id-79' name='kind' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='832' column='1'/>
      <parameter type-id='type-id-76' name='name' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='833' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='__asan_cplus_demangle_type' mangled-name='__asan_cplus_demangle_type' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='2230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_type'>
      <parameter type-id='type-id-86' name='di' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='2230' column='1'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='__asan_cplus_demangle_mangled_name' mangled-name='__asan_cplus_demangle_mangled_name' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='1140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_mangled_name'>
      <parameter type-id='type-id-86' name='di' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='1140' column='1'/>
      <parameter type-id='type-id-10' name='top_level' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='1140' column='1'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='__asan_cplus_demangle_print_callback' mangled-name='__asan_cplus_demangle_print_callback' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4029' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_print_callback'>
      <parameter type-id='type-id-10' name='options' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4029' column='1'/>
      <parameter type-id='type-id-85' name='dc' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4030' column='1'/>
      <parameter type-id='type-id-87' name='callback' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4031' column='1'/>
      <parameter type-id='type-id-1' name='opaque' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4031' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='__asan_cplus_demangle_print' mangled-name='__asan_cplus_demangle_print' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4069' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_print'>
      <parameter type-id='type-id-10' name='options' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4069' column='1'/>
      <parameter type-id='type-id-85' name='dc' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4069' column='1'/>
      <parameter type-id='type-id-10' name='estimate' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4070' column='1'/>
      <parameter type-id='type-id-88' name='palc' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4070' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='__asan_cplus_demangle_init_info' mangled-name='__asan_cplus_demangle_init_info' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5731' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_init_info'>
      <parameter type-id='type-id-2' name='mangled' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5731' column='1'/>
      <parameter type-id='type-id-10' name='options' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5731' column='1'/>
      <parameter type-id='type-id-8' name='len' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5731' column='1'/>
      <parameter type-id='type-id-86' name='di' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5732' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__asan_cplus_demangle_v3' mangled-name='__asan_cplus_demangle_v3' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6018' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_v3'>
      <parameter type-id='type-id-2' name='mangled' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6018' column='1'/>
      <parameter type-id='type-id-10' name='options' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6018' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='__asan_cplus_demangle_v3_callback' mangled-name='__asan_cplus_demangle_v3_callback' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6026' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_v3_callback'>
      <parameter type-id='type-id-2' name='mangled' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6026' column='1'/>
      <parameter type-id='type-id-10' name='options' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6026' column='1'/>
      <parameter type-id='type-id-87' name='callback' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6027' column='1'/>
      <parameter type-id='type-id-1' name='opaque' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6027' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='__asan_java_demangle_v3' mangled-name='__asan_java_demangle_v3' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6039' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_java_demangle_v3'>
      <parameter type-id='type-id-2' name='mangled' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6039' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='__asan_java_demangle_v3_callback' mangled-name='__asan_java_demangle_v3_callback' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6047' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_java_demangle_v3_callback'>
      <parameter type-id='type-id-2' name='mangled' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6047' column='1'/>
      <parameter type-id='type-id-87' name='callback' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6048' column='1'/>
      <parameter type-id='type-id-1' name='opaque' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6048' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='__asan_is_gnu_v3_mangled_ctor' mangled-name='__asan_is_gnu_v3_mangled_ctor' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_is_gnu_v3_mangled_ctor'>
      <parameter type-id='type-id-2' name='name' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6137' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='__asan_is_gnu_v3_mangled_dtor' mangled-name='__asan_is_gnu_v3_mangled_dtor' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_is_gnu_v3_mangled_dtor'>
      <parameter type-id='type-id-2' name='name' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6152' column='1'/>
      <return type-id='type-id-79'/>
    </function-decl>
    <var-decl name='__asan_cplus_demangle_operators' type-id='type-id-53' mangled-name='__asan_cplus_demangle_operators' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='1688' column='1' elf-symbol-id='__asan_cplus_demangle_operators'/>
    <var-decl name='__asan_cplus_demangle_builtin_types' type-id='type-id-49' mangled-name='__asan_cplus_demangle_builtin_types' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='2188' column='1' elf-symbol-id='__asan_cplus_demangle_builtin_types'/>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='realloc' filepath='/usr/include/stdlib.h' line='485' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__asan_internal_memcpy' filepath='../../.././libsanitizer/libbacktrace/backtrace-rename.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__asan_internal_strlen' filepath='../../.././libsanitizer/libbacktrace/backtrace-rename.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sprintf' filepath='/usr/include/stdio.h' line='363' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-2'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='__asan_internal_strncmp' filepath='../../.././libsanitizer/libbacktrace/backtrace-rename.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='__asan_internal_memcmp' filepath='../../.././libsanitizer/libbacktrace/backtrace-rename.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-77'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-88'/>
    <type-decl name='sizetype' size-in-bits='64' id='type-id-50'/>
    <typedef-decl name='demangle_callbackref' type-id='type-id-89' filepath='../../.././libsanitizer/../include/demangle.h' line='150' column='1' id='type-id-87'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-89'/>
    <function-type size-in-bits='64' id='type-id-90'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/libbacktrace/bridge.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='type-id-91' const='yes' id='type-id-92'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-94'/>
    <qualified-type-def type-id='type-id-94' const='yes' id='type-id-95'/>
    <qualified-type-def type-id='type-id-96' const='yes' id='type-id-97'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-98'/>
    <qualified-type-def type-id='type-id-98' const='yes' id='type-id-99'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-101'/>
    <namespace-decl name='__sanitizer'>
      <typedef-decl name='LowLevelAllocateCallback' type-id='type-id-101' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='116' column='1' id='type-id-102'/>
      <class-decl name='CrashOnMapUnmap' size-in-bits='8' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator_internal.h' line='47' column='1' id='type-id-96'/>
      <class-decl name='LowLevelAllocator' size-in-bits='128' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='108' column='1' id='type-id-93'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='allocated_end_' type-id='type-id-28' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='113' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='allocated_current_' type-id='type-id-28' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='114' column='1'/>
        </data-member>
      </class-decl>
      <function-decl name='AllocatorReturnNull' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.cc' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
        <return type-id='type-id-1'/>
      </function-decl>
      <function-decl name='internal_allocator' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.cc' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
        <return type-id='type-id-103'/>
      </function-decl>
    </namespace-decl>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-103'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-91'/>
    <function-type size-in-bits='64' id='type-id-100'>
      <parameter type-id='type-id-106'/>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-4'/>
    </function-type>
    <namespace-decl name='__sanitizer'>
      <class-decl name='LargeMmapAllocator&lt;__sanitizer::CrashOnMapUnmap&gt;' size-in-bits='16781952' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='995' column='1' id='type-id-105'>
        <member-type access='private'>
          <class-decl name='Stats' size-in-bits='4352' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1215' column='1' id='type-id-107'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='n_allocs' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1216' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='n_frees' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1216' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='currently_allocated' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1216' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <var-decl name='max_allocated' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1216' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='256'>
              <var-decl name='by_size_log' type-id='type-id-108' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1216' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='Header' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1186' column='1' id='type-id-109'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='map_beg' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1187' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='map_size' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1188' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='size' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1189' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <var-decl name='chunk_idx' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1190' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='private' static='yes'>
          <var-decl name='kMaxNumChunks' type-id='type-id-110' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1185' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='page_size_' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1210' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='chunks_' type-id='type-id-111' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1211' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='16777280'>
          <var-decl name='n_chunks_' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1212' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='16777344'>
          <var-decl name='min_mmap_' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1213' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='16777408'>
          <var-decl name='max_mmap_' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1213' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='16777472'>
          <var-decl name='chunks_sorted_' type-id='type-id-112' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1214' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='16777536'>
          <var-decl name='stats' type-id='type-id-107' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1217' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='16781888'>
          <var-decl name='mutex_' type-id='type-id-113' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1218' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='__sanitizer'>
      <typedef-decl name='InternalAllocator' type-id='type-id-114' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator_internal.h' line='58' column='1' id='type-id-104'/>
    </namespace-decl>
    <namespace-decl name='__sanitizer'>
      <typedef-decl name='uptr' type-id='type-id-33' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='56' column='1' id='type-id-106'/>
    </namespace-decl>
    <array-type-def dimensions='1' type-id='type-id-115' size-in-bits='16777216' id='type-id-111'>
      <subrange length='262144' type-id='type-id-50' id='type-id-116'/>
    </array-type-def>
    <type-decl name='bool' size-in-bits='8' id='type-id-112'/>
    <namespace-decl name='__sanitizer'>
      <class-decl name='CombinedAllocator&lt;__sanitizer::SizeClassAllocator32&lt;0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap&lt;17ul, 64ul, 14ul&gt;, 24ul, __sanitizer::TwoLevelByteMap&lt;2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback&gt;, __sanitizer::NoOpMapUnmapCallback&gt;, __sanitizer::SizeClassAllocatorLocalCache&lt;__sanitizer::SizeClassAllocator32&lt;0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap&lt;17ul, 64ul, 14ul&gt;, 24ul, __sanitizer::TwoLevelByteMap&lt;2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback&gt;, __sanitizer::NoOpMapUnmapCallback&gt; &gt;, __sanitizer::LargeMmapAllocator&lt;__sanitizer::CrashOnMapUnmap&gt; &gt;' size-in-bits='16940672' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1229' column='1' id='type-id-114'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='primary_' type-id='type-id-117' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1368' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='158272'>
          <var-decl name='secondary_' type-id='type-id-105' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1369' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='16940224'>
          <var-decl name='stats_' type-id='type-id-118' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='1370' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='__sanitizer'>
      <class-decl name='SpinMutex' size-in-bits='8' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='61' column='1' id='type-id-113'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-119'/>
        <member-function access='public' constructor='yes'>
          <function-decl name='SpinMutex' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-120' is-artificial='yes'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='SpinMutex' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-120' is-artificial='yes'/>
            <parameter type-id='type-id-121'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-110'/>
    <array-type-def dimensions='1' type-id='type-id-33' size-in-bits='4096' id='type-id-108'>
      <subrange length='64' type-id='type-id-50' id='type-id-122'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-115'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-120'/>
    <namespace-decl name='__sanitizer'>
      <class-decl name='AllocatorGlobalStats' size-in-bits='448' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='236' column='1' id='type-id-118'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-123'/>
        <data-member access='private' layout-offset-in-bits='384'>
          <var-decl name='mu_' type-id='type-id-113' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='274' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='__sanitizer'>
      <class-decl name='SizeClassAllocator32&lt;0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap&lt;17ul, 64ul, 14ul&gt;, 24ul, __sanitizer::TwoLevelByteMap&lt;2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback&gt;, __sanitizer::NoOpMapUnmapCallback&gt;' size-in-bits='158272' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='677' column='1' id='type-id-117'>
        <member-type access='public'>
          <typedef-decl name='Batch' type-id='type-id-125' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='679' column='1' id='type-id-124'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='AllocatorCache' type-id='type-id-127' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='682' column='1' id='type-id-126'/>
        </member-type>
        <member-type access='private'>
          <class-decl name='SizeClassInfo' size-in-bits='512' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='820' column='1' id='type-id-128'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='mutex' type-id='type-id-113' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='821' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='free_list' type-id='type-id-129' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='822' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='256'>
              <var-decl name='padding' type-id='type-id-130' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='823' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='kNumClasses' type-id='type-id-131' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='814' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='kRegionSize' type-id='type-id-131' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='817' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='kNumPossibleRegions' type-id='type-id-131' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='818' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='possible_regions' type-id='type-id-132' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='881' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='131136'>
          <var-decl name='size_class_info_array' type-id='type-id-133' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='882' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='__sanitizer'>
      <class-decl name='StaticSpinMutex' size-in-bits='8' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='21' column='1' id='type-id-119'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='state_' type-id='type-id-134' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='46' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <reference-type-def kind='lvalue' type-id='type-id-135' size-in-bits='64' id='type-id-121'/>
    <array-type-def dimensions='1' type-id='type-id-128' size-in-bits='27136' id='type-id-133'>
      <subrange length='53' type-id='type-id-50' id='type-id-136'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='256' id='type-id-130'>
      <subrange length='32' type-id='type-id-50' id='type-id-137'/>
    </array-type-def>
    <namespace-decl name='__sanitizer'>
      <class-decl name='AllocatorStats' size-in-bits='384' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='209' column='1' id='type-id-123'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='next_' type-id='type-id-138' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='230' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='prev_' type-id='type-id-138' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='231' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='stats_' type-id='type-id-139' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='232' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='__sanitizer'>
      <class-decl name='IntrusiveList&lt;__sanitizer::SizeClassMap&lt;17ul, 64ul, 14ul&gt;::TransferBatch&gt;' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_list.h' line='26' column='1' id='type-id-129'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='size_' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_list.h' line='115' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='first_' type-id='type-id-140' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_list.h' line='116' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='last_' type-id='type-id-140' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_list.h' line='117' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='__sanitizer'>
      <class-decl name='SizeClassAllocatorLocalCache&lt;__sanitizer::SizeClassAllocator32&lt;0ul, 140737488355328ull, 16ul, __sanitizer::SizeClassMap&lt;17ul, 64ul, 14ul&gt;, 24ul, __sanitizer::TwoLevelByteMap&lt;2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback&gt;, __sanitizer::NoOpMapUnmapCallback&gt; &gt;' size-in-bits='441344' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='889' column='1' id='type-id-127'>
        <member-type access='public'>
          <typedef-decl name='Batch' type-id='type-id-125' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='941' column='1' id='type-id-141'/>
        </member-type>
        <member-type access='public'>
          <class-decl name='PerClass' size-in-bits='8320' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='942' column='1' id='type-id-142'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='count' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='943' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='max_count' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='944' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='batch' type-id='type-id-143' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='945' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='public' static='yes'>
          <var-decl name='kNumClasses' type-id='type-id-131' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='891' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='per_class_' type-id='type-id-144' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='947' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='440960'>
          <var-decl name='stats_' type-id='type-id-123' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='948' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='__sanitizer'>
      <class-decl name='SizeClassMap&lt;17ul, 64ul, 14ul&gt;' size-in-bits='8' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='89' column='1' id='type-id-145'>
        <member-type access='public'>
          <class-decl name='TransferBatch' size-in-bits='4224' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='103' column='1' id='type-id-125'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='next' type-id='type-id-140' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='104' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='count' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='105' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='batch' type-id='type-id-146' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='106' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='__sanitizer'>
      <class-decl name='TwoLevelByteMap&lt;2048ull, 4096ull, __sanitizer::NoOpMapUnmapCallback&gt;' size-in-bits='131136' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='594' column='1' id='type-id-132'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='map1_' type-id='type-id-147' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='648' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='131072'>
          <var-decl name='mu_' type-id='type-id-119' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_allocator.h' line='649' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='__sanitizer'>
      <class-decl name='atomic_uint8_t' size-in-bits='8' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='28' column='1' id='type-id-134'>
        <member-type access='public'>
          <typedef-decl name='Type' type-id='type-id-149' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='29' column='1' id='type-id-148'/>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='val_dont_use' type-id='type-id-150' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='30' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <qualified-type-def type-id='type-id-113' const='yes' id='type-id-135'/>
    <qualified-type-def type-id='type-id-106' const='yes' id='type-id-131'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-138'/>
    <array-type-def dimensions='1' type-id='type-id-142' size-in-bits='440960' id='type-id-144'>
      <subrange length='53' type-id='type-id-50' id='type-id-136'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-140'/>
    <array-type-def dimensions='1' type-id='type-id-151' size-in-bits='256' id='type-id-139'>
      <subrange length='4' type-id='type-id-50' id='type-id-152'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-153' size-in-bits='131072' id='type-id-147'>
      <subrange length='2048' type-id='type-id-50' id='type-id-154'/>
    </array-type-def>
    <namespace-decl name='__sanitizer'>
      <typedef-decl name='u8' type-id='type-id-19' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='66' column='1' id='type-id-149'/>
    </namespace-decl>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='8192' id='type-id-143'>
      <subrange length='128' type-id='type-id-50' id='type-id-155'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='4096' id='type-id-146'>
      <subrange length='64' type-id='type-id-50' id='type-id-122'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-148' volatile='yes' id='type-id-150'/>
    <namespace-decl name='__sanitizer'>
      <class-decl name='atomic_uint64_t' size-in-bits='64' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='43' column='1' id='type-id-151'>
        <member-type access='public'>
          <typedef-decl name='Type' type-id='type-id-157' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='44' column='1' id='type-id-156'/>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='val_dont_use' type-id='type-id-158' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='45' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='__sanitizer'>
      <class-decl name='atomic_uintptr_t' size-in-bits='64' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='48' column='1' id='type-id-153'>
        <member-type access='public'>
          <typedef-decl name='Type' type-id='type-id-106' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='49' column='1' id='type-id-159'/>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='val_dont_use' type-id='type-id-160' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='50' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='__sanitizer'>
      <typedef-decl name='u64' type-id='type-id-161' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='69' column='1' id='type-id-157'/>
    </namespace-decl>
    <qualified-type-def type-id='type-id-156' volatile='yes' id='type-id-158'/>
    <qualified-type-def type-id='type-id-159' volatile='yes' id='type-id-160'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-161'/>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-162' size-in-bits='768' id='type-id-163'>
      <subrange length='6' type-id='type-id-50' id='type-id-164'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='32768' id='type-id-165'>
      <subrange length='4096' type-id='type-id-50' id='type-id-166'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-168'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-170'/>
    <qualified-type-def type-id='type-id-170' const='yes' id='type-id-171'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-173'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-175'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-177'/>
    <qualified-type-def type-id='type-id-169' const='yes' id='type-id-178'/>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-179'/>
    <qualified-type-def type-id='type-id-179' const='yes' id='type-id-180'/>
    <qualified-type-def type-id='type-id-33' const='yes' id='type-id-181'/>
    <reference-type-def kind='lvalue' type-id='type-id-181' size-in-bits='64' id='type-id-182'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' id='type-id-184'/>
    <namespace-decl name='__sanitizer'>
      <class-decl name='StackTrace' size-in-bits='16512' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace.h' line='31' column='1' id='type-id-172'>
        <member-type access='public'>
          <typedef-decl name='SymbolizeCallback' type-id='type-id-177' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace.h' line='33' column='1' id='type-id-185'/>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='top_frame_bp' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace.h' line='34' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='size' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace.h' line='35' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='trace' type-id='type-id-186' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stacktrace.h' line='36' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='DieCallbackType' type-id='type-id-187' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='202' column='1' id='type-id-188'/>
      <class-decl name='InternalScopedString' size-in-bits='192' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='88' column='1' id='type-id-167'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-189'/>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='length_' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='102' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='InternalScopedString' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-168' is-artificial='yes'/>
            <parameter type-id='type-id-106'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='LoadedModule' size-in-bits='960' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='442' column='1' id='type-id-169'>
        <member-type access='private'>
          <class-decl name='AddressRange' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='452' column='1' id='type-id-162'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='beg' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='453' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='end' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='454' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='full_name_' type-id='type-id-28' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='456' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='base_address_' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='457' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='kMaxNumberOfAddressRanges' type-id='type-id-131' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='458' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='ranges_' type-id='type-id-163' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='459' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='896'>
          <var-decl name='n_ranges_' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='460' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='LoadedModule' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='444' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-170' is-artificial='yes'/>
            <parameter type-id='type-id-2'/>
            <parameter type-id='type-id-106'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='LoadedModule' mangled-name='_ZN11__sanitizer12LoadedModuleC2EPKcm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='444' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-170' is-artificial='yes'/>
            <parameter type-id='type-id-2'/>
            <parameter type-id='type-id-106'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
      </class-decl>
      <function-decl name='GetPageSizeCached' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='22' column='1' visibility='default' binding='global' size-in-bits='64'>
        <return type-id='type-id-106'/>
      </function-decl>
      <function-decl name='ReportErrorSummary' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='177' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-2'/>
        <return type-id='type-id-4'/>
      </function-decl>
      <function-decl name='ReportErrorSummary' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='186' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-2'/>
        <parameter type-id='type-id-2'/>
        <parameter type-id='type-id-10'/>
        <parameter type-id='type-id-2'/>
        <return type-id='type-id-4'/>
      </function-decl>
      <function-decl name='Swap&lt;long unsigned int&gt;' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='292' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-190'/>
        <parameter type-id='type-id-190'/>
        <return type-id='type-id-4'/>
      </function-decl>
      <function-decl name='CheckFailed' mangled-name='_ZN11__sanitizer11CheckFailedEPKciS1_yy' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11__sanitizer11CheckFailedEPKciS1_yy'>
        <parameter type-id='type-id-2'/>
        <parameter type-id='type-id-10'/>
        <parameter type-id='type-id-2'/>
        <parameter type-id='type-id-157'/>
        <parameter type-id='type-id-157'/>
        <return type-id='type-id-4'/>
      </function-decl>
      <var-decl name='SanitizerToolName' type-id='type-id-2' mangled-name='_ZN11__sanitizer17SanitizerToolNameE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='20' column='1'/>
      <var-decl name='report_fd' type-id='type-id-191' mangled-name='_ZN11__sanitizer9report_fdE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='33' column='1'/>
      <var-decl name='log_to_file' type-id='type-id-112' mangled-name='_ZN11__sanitizer11log_to_fileE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='36' column='1'/>
      <var-decl name='report_path_prefix' type-id='type-id-165' mangled-name='_ZN11__sanitizer18report_path_prefixE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='37' column='1'/>
      <var-decl name='report_fd_pid' type-id='type-id-106' mangled-name='_ZN11__sanitizer13report_fd_pidE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='41' column='1'/>
      <var-decl name='stoptheworld_tracer_pid' type-id='type-id-106' mangled-name='_ZN11__sanitizer23stoptheworld_tracer_pidE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='45' column='1'/>
      <var-decl name='stoptheworld_tracer_ppid' type-id='type-id-106' mangled-name='_ZN11__sanitizer24stoptheworld_tracer_ppidE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='48' column='1'/>
    </namespace-decl>
    <function-decl name='__sanitizer_sandbox_on_notify' mangled-name='__sanitizer_sandbox_on_notify' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='277' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sanitizer_sandbox_on_notify'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__sanitizer_report_error_summary' mangled-name='__sanitizer_report_error_summary' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.cc' line='282' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sanitizer_report_error_summary'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <namespace-decl name='__sanitizer'>
      <class-decl name='InternalScopedBuffer&lt;char&gt;' size-in-bits='128' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='67' column='1' id='type-id-189'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='ptr_' type-id='type-id-28' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='81' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='cnt_' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='82' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='InternalScopedBuffer' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-192' is-artificial='yes'/>
            <parameter type-id='type-id-106'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~InternalScopedBuffer' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-192' is-artificial='yes'/>
            <parameter type-id='type-id-10' is-artificial='yes'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='InternalScopedBuffer' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-192' is-artificial='yes'/>
            <parameter type-id='type-id-193'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <function-type size-in-bits='64' id='type-id-174'>
      <parameter type-id='type-id-182'/>
      <parameter type-id='type-id-182'/>
      <return type-id='type-id-112'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-176'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-112'/>
    </function-type>
    <namespace-decl name='__sanitizer'>
      <typedef-decl name='fd_t' type-id='type-id-10' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='74' column='1' id='type-id-191'/>
    </namespace-decl>
    <reference-type-def kind='lvalue' type-id='type-id-33' size-in-bits='64' id='type-id-190'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-183'/>
    <array-type-def dimensions='1' type-id='type-id-33' size-in-bits='16384' id='type-id-186'>
      <subrange length='256' type-id='type-id-50' id='type-id-194'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-195' size-in-bits='64' id='type-id-187'/>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-192'/>
    <reference-type-def kind='lvalue' type-id='type-id-196' size-in-bits='64' id='type-id-193'/>
    <qualified-type-def type-id='type-id-189' const='yes' id='type-id-196'/>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_common_libcdep.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_coverage.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' id='type-id-198'/>
    <qualified-type-def type-id='type-id-198' const='yes' id='type-id-199'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-201'/>
    <qualified-type-def type-id='type-id-201' const='yes' id='type-id-202'/>
    <qualified-type-def type-id='type-id-197' const='yes' id='type-id-203'/>
    <reference-type-def kind='lvalue' type-id='type-id-203' size-in-bits='64' id='type-id-204'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-205'/>
    <qualified-type-def type-id='type-id-205' const='yes' id='type-id-206'/>
    <qualified-type-def type-id='type-id-200' const='yes' id='type-id-207'/>
    <reference-type-def kind='lvalue' type-id='type-id-207' size-in-bits='64' id='type-id-208'/>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-209'/>
    <qualified-type-def type-id='type-id-209' const='yes' id='type-id-210'/>
    <qualified-type-def type-id='type-id-211' const='yes' id='type-id-212'/>
    <qualified-type-def type-id='type-id-213' id='type-id-214'/>
    <reference-type-def kind='lvalue' type-id='type-id-212' size-in-bits='64' id='type-id-213'/>
    <pointer-type-def type-id='type-id-212' size-in-bits='64' id='type-id-215'/>
    <qualified-type-def type-id='type-id-182' id='type-id-216'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-217'/>
    <reference-type-def kind='lvalue' type-id='type-id-211' size-in-bits='64' id='type-id-218'/>
    <namespace-decl name='__sanitizer'>
      <class-decl name='InternalMmapVector&lt;long unsigned int&gt;' size-in-bits='192' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='320' column='1' id='type-id-197'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='data_' type-id='type-id-183' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='382' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='capacity_' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='383' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='size_' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='384' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='InternalMmapVector' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='322' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-198' is-artificial='yes'/>
            <parameter type-id='type-id-106'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~InternalMmapVector' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='327' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-198' is-artificial='yes'/>
            <parameter type-id='type-id-10' is-artificial='yes'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='InternalMmapVector' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='379' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-198' is-artificial='yes'/>
            <parameter type-id='type-id-204'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='InternalMmapVector&lt;unsigned int&gt;' size-in-bits='192' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='320' column='1' id='type-id-200'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='data_' type-id='type-id-219' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='382' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='capacity_' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='383' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='size_' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='384' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='InternalMmapVector' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='322' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-201' is-artificial='yes'/>
            <parameter type-id='type-id-106'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~InternalMmapVector' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='327' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-201' is-artificial='yes'/>
            <parameter type-id='type-id-10' is-artificial='yes'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='InternalMmapVector' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='379' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-201' is-artificial='yes'/>
            <parameter type-id='type-id-208'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <function-decl name='__sanitizer_cov' mangled-name='__sanitizer_cov' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_coverage.cc' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sanitizer_cov'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__sanitizer_cov_dump' mangled-name='__sanitizer_cov_dump' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_coverage.cc' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sanitizer_cov_dump'>
      <return type-id='type-id-4'/>
    </function-decl>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-211'/>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' id='type-id-219'/>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_flags.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_libc.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <namespace-decl name='__sanitizer'>
      <function-decl name='IsSpace' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='299' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-10'/>
        <return type-id='type-id-112'/>
      </function-decl>
      <function-decl name='internal_strchr' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_libc.cc' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-2'/>
        <parameter type-id='type-id-10'/>
        <return type-id='type-id-28'/>
      </function-decl>
      <function-decl name='internal_strlen' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_libc.cc' line='161' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-2'/>
        <return type-id='type-id-106'/>
      </function-decl>
      <function-decl name='internal_memcpy' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_libc.cc' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-1'/>
        <parameter type-id='type-id-1'/>
        <parameter type-id='type-id-106'/>
        <return type-id='type-id-1'/>
      </function-decl>
      <function-decl name='internal_memset' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_libc.cc' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-1'/>
        <parameter type-id='type-id-10'/>
        <parameter type-id='type-id-106'/>
        <return type-id='type-id-1'/>
      </function-decl>
      <function-decl name='internal_memcmp' mangled-name='_ZN11__sanitizer15internal_memcmpEPKvS1_m' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_libc.cc' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-1' name='s1' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='633' column='1'/>
        <parameter type-id='type-id-1' name='s2' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='633' column='1'/>
        <parameter type-id='type-id-106' name='n' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='633' column='1'/>
        <return type-id='type-id-10'/>
      </function-decl>
      <function-decl name='RoundDownTo' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='265' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-106'/>
        <parameter type-id='type-id-106'/>
        <return type-id='type-id-106'/>
      </function-decl>
      <function-decl name='IsDigit' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='303' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-10'/>
        <return type-id='type-id-112'/>
      </function-decl>
      <function-decl name='Min&lt;long long unsigned int&gt;' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='290' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-161'/>
        <parameter type-id='type-id-161'/>
        <return type-id='type-id-161'/>
      </function-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_libignore.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <qualified-type-def type-id='type-id-220' const='yes' id='type-id-221'/>
    <qualified-type-def type-id='type-id-222' id='type-id-223'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-220'/>
    <reference-type-def kind='lvalue' type-id='type-id-225' size-in-bits='64' id='type-id-222'/>
    <namespace-decl name='__sanitizer'>
      <class-decl name='LibIgnore' size-in-bits='49984' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_libignore.h' line='26' column='1' id='type-id-224'>
        <member-type access='private'>
          <class-decl name='Lib' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_libignore.h' line='43' column='1' id='type-id-226'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='templ' type-id='type-id-28' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_libignore.h' line='44' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='name' type-id='type-id-28' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_libignore.h' line='45' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='128'>
              <var-decl name='real_name' type-id='type-id-28' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_libignore.h' line='46' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='192'>
              <var-decl name='loaded' type-id='type-id-112' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_libignore.h' line='47' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <member-type access='private'>
          <class-decl name='LibCodeRange' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_libignore.h' line='50' column='1' id='type-id-227'>
            <data-member access='public' layout-offset-in-bits='0'>
              <var-decl name='begin' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_libignore.h' line='51' column='1'/>
            </data-member>
            <data-member access='public' layout-offset-in-bits='64'>
              <var-decl name='end' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_libignore.h' line='52' column='1'/>
            </data-member>
          </class-decl>
        </member-type>
        <data-member access='private' static='yes'>
          <var-decl name='kMaxLibs' type-id='type-id-131' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_libignore.h' line='55' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='loaded_count_' type-id='type-id-153' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_libignore.h' line='58' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='code_ranges_' type-id='type-id-228' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_libignore.h' line='59' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='16448'>
          <var-decl name='mutex_' type-id='type-id-229' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_libignore.h' line='62' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='17152'>
          <var-decl name='count_' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_libignore.h' line='63' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='17216'>
          <var-decl name='libs_' type-id='type-id-230' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_libignore.h' line='64' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='LibIgnore' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_libignore.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-220' is-artificial='yes'/>
            <parameter type-id='type-id-231'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='private' constructor='yes'>
          <function-decl name='LibIgnore' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_libignore.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-220' is-artificial='yes'/>
            <parameter type-id='type-id-232'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='LibIgnore' mangled-name='_ZN11__sanitizer9LibIgnoreC2E17LinkerInitialized' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_libignore.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-220' is-artificial='yes'/>
            <parameter type-id='type-id-231'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <qualified-type-def type-id='type-id-233' const='yes' id='type-id-225'/>
    <array-type-def dimensions='1' type-id='type-id-227' size-in-bits='16384' id='type-id-228'>
      <subrange length='128' type-id='type-id-50' id='type-id-155'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-226' size-in-bits='32768' id='type-id-230'>
      <subrange length='128' type-id='type-id-50' id='type-id-155'/>
    </array-type-def>
    <namespace-decl name='__sanitizer'>
      <class-decl name='BlockingMutex' size-in-bits='704' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='72' column='1' id='type-id-229'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='opaque_storage_' type-id='type-id-234' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='80' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='640'>
          <var-decl name='owner_' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='81' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='BlockingMutex' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-235' is-artificial='yes'/>
            <parameter type-id='type-id-231'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='BlockingMutex' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-235' is-artificial='yes'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='BlockingMutex' mangled-name='_ZN11__sanitizer13BlockingMutexC2E17LinkerInitialized' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-235' is-artificial='yes'/>
            <parameter type-id='type-id-231'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='BlockingMutex' mangled-name='_ZN11__sanitizer13BlockingMutexC2Ev' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_mutex.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-235' is-artificial='yes'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='__sanitizer'>
      <class-decl name='SuppressionContext' size-in-bits='256' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_suppressions.h' line='37' column='1' id='type-id-233'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='suppressions_' type-id='type-id-236' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_suppressions.h' line='47' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='can_parse_' type-id='type-id-112' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_suppressions.h' line='48' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='SuppressionContext' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_suppressions.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-237' is-artificial='yes'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <reference-type-def kind='lvalue' type-id='type-id-238' size-in-bits='64' id='type-id-232'/>
    <enum-decl name='LinkerInitialized' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='283' column='1' id='type-id-231'>
      <underlying-type type-id='type-id-62'/>
      <enumerator name='LINKER_INITIALIZED' value='0'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-235'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' id='type-id-237'/>
    <namespace-decl name='__sanitizer'>
      <class-decl name='InternalMmapVector&lt;__sanitizer::Suppression&gt;' size-in-bits='192' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='320' column='1' id='type-id-236'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='data_' type-id='type-id-239' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='382' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='capacity_' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='383' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='128'>
          <var-decl name='size_' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='384' column='1'/>
        </data-member>
        <member-function access='public'>
          <function-decl name='InternalMmapVector' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='322' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-240' is-artificial='yes'/>
            <parameter type-id='type-id-106'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~InternalMmapVector' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='327' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-240' is-artificial='yes'/>
            <parameter type-id='type-id-10' is-artificial='yes'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='private'>
          <function-decl name='InternalMmapVector' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='379' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-240' is-artificial='yes'/>
            <parameter type-id='type-id-241'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
      </class-decl>
    </namespace-decl>
    <qualified-type-def type-id='type-id-224' const='yes' id='type-id-238'/>
    <array-type-def dimensions='1' type-id='type-id-33' size-in-bits='640' id='type-id-234'>
      <subrange length='10' type-id='type-id-50' id='type-id-242'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-236' size-in-bits='64' id='type-id-240'/>
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-239'/>
    <reference-type-def kind='lvalue' type-id='type-id-244' size-in-bits='64' id='type-id-241'/>
    <namespace-decl name='__sanitizer'>
      <class-decl name='Suppression' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_suppressions.h' line='30' column='1' id='type-id-243'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='type' type-id='type-id-245' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_suppressions.h' line='31' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='templ' type-id='type-id-28' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_suppressions.h' line='32' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='hit_count' type-id='type-id-211' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_suppressions.h' line='33' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='weight' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_suppressions.h' line='34' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <qualified-type-def type-id='type-id-236' const='yes' id='type-id-244'/>
    <namespace-decl name='__sanitizer'>
      <enum-decl name='SuppressionType' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_suppressions.h' line='19' column='1' id='type-id-245'>
        <underlying-type type-id='type-id-62'/>
        <enumerator name='SuppressionNone' value='0'/>
        <enumerator name='SuppressionRace' value='1'/>
        <enumerator name='SuppressionMutex' value='2'/>
        <enumerator name='SuppressionThread' value='3'/>
        <enumerator name='SuppressionSignal' value='4'/>
        <enumerator name='SuppressionLeak' value='5'/>
        <enumerator name='SuppressionLib' value='6'/>
        <enumerator name='SuppressionTypeCount' value='7'/>
      </enum-decl>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='2048' id='type-id-246'>
      <subrange length='256' type-id='type-id-50' id='type-id-194'/>
    </array-type-def>
    <class-decl name='sigaltstack' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/bits/sigstack.h' line='50' column='1' id='type-id-247'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ss_sp' type-id='type-id-1' visibility='default' filepath='/usr/include/bits/sigstack.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ss_flags' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/sigstack.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ss_size' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/sigstack.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='link_map' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/link.h' line='85' column='1' id='type-id-248'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='l_addr' type-id='type-id-249' visibility='default' filepath='/usr/include/link.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='l_name' type-id='type-id-28' visibility='default' filepath='/usr/include/link.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='l_ld' type-id='type-id-250' visibility='default' filepath='/usr/include/link.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='l_next' type-id='type-id-251' visibility='default' filepath='/usr/include/link.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='l_prev' type-id='type-id-251' visibility='default' filepath='/usr/include/link.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Elf64_Dyn' type-id='type-id-252' filepath='/usr/include/elf.h' line='650' column='1' id='type-id-253'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-253' visibility='default' filepath='/usr/include/elf.h' line='643' column='1' id='type-id-252'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/elf.h' line='646' column='1' id='type-id-254'>
          <data-member access='public'>
            <var-decl name='d_val' type-id='type-id-255' visibility='default' filepath='/usr/include/elf.h' line='647' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='d_ptr' type-id='type-id-249' visibility='default' filepath='/usr/include/elf.h' line='648' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_tag' type-id='type-id-256' visibility='default' filepath='/usr/include/elf.h' line='644' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_un' type-id='type-id-254' visibility='default' filepath='/usr/include/elf.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Elf64_Sxword' type-id='type-id-257' filepath='/usr/include/elf.h' line='46' column='1' id='type-id-256'/>
    <typedef-decl name='int64_t' type-id='type-id-45' filepath='/usr/include/sys/types.h' line='198' column='1' id='type-id-257'/>
    <pointer-type-def type-id='type-id-253' size-in-bits='64' id='type-id-250'/>
    <pointer-type-def type-id='type-id-258' size-in-bits='64' id='type-id-259'/>
    <qualified-type-def type-id='type-id-259' const='yes' id='type-id-260'/>
    <pointer-type-def type-id='type-id-261' size-in-bits='64' id='type-id-262'/>
    <qualified-type-def type-id='type-id-262' const='yes' id='type-id-263'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-265'/>
    <pointer-type-def type-id='type-id-266' size-in-bits='64' id='type-id-267'/>
    <qualified-type-def type-id='type-id-28' const='yes' id='type-id-268'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-269'/>
    <qualified-type-def type-id='type-id-264' const='yes' id='type-id-270'/>
    <pointer-type-def type-id='type-id-270' size-in-bits='64' id='type-id-271'/>
    <qualified-type-def type-id='type-id-247' const='yes' id='type-id-272'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-273'/>
    <pointer-type-def type-id='type-id-248' size-in-bits='64' id='type-id-251'/>
    <pointer-type-def type-id='type-id-247' size-in-bits='64' id='type-id-274'/>
    <pointer-type-def type-id='type-id-275' size-in-bits='64' id='type-id-276'/>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' id='type-id-278'/>
    <namespace-decl name='__sanitizer'>
      <class-decl name='linux_dirent' size-in-bits='2240' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='565' column='1' id='type-id-266'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='d_ino' type-id='type-id-33' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='566' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='d_off' type-id='type-id-33' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='567' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='d_reclen' type-id='type-id-279' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='568' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='144'>
          <var-decl name='d_name' type-id='type-id-246' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='569' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__sanitizer_kernel_sigaction_t' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.h' line='423' column='1' id='type-id-264'>
        <member-type access='public'>
          <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.h' line='424' column='1' id='type-id-280'>
            <data-member access='public'>
              <var-decl name='sigaction' type-id='type-id-276' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.h' line='425' column='1'/>
            </data-member>
            <data-member access='public'>
              <var-decl name='handler' type-id='type-id-281' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.h' line='426' column='1'/>
            </data-member>
          </union-decl>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='' type-id='type-id-280' visibility='default'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='sa_flags' type-id='type-id-33' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.h' line='428' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='sa_restorer' type-id='type-id-187' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.h' line='429' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='sa_mask' type-id='type-id-282' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.h' line='430' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='MemoryMappingLayout' size-in-bits='256' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='42' column='1' id='type-id-258'>
        <data-member access='public' static='yes'>
          <var-decl name='kProtectionRead' type-id='type-id-131' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='60' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='kProtectionWrite' type-id='type-id-131' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='61' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='kProtectionExecute' type-id='type-id-131' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='62' column='1'/>
        </data-member>
        <data-member access='public' static='yes'>
          <var-decl name='kProtectionShared' type-id='type-id-131' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='63' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='proc_self_maps_' type-id='type-id-283' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='100' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='current_' type-id='type-id-28' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='101' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='cached_proc_self_maps_' type-id='type-id-283' mangled-name='_ZN11__sanitizer19MemoryMappingLayout22cached_proc_self_maps_E' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='104' column='1'/>
        </data-member>
        <data-member access='private' static='yes'>
          <var-decl name='cache_lock_' type-id='type-id-119' mangled-name='_ZN11__sanitizer19MemoryMappingLayout11cache_lock_E' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='105' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='MemoryMappingLayout' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-259' is-artificial='yes'/>
            <parameter type-id='type-id-112'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~MemoryMappingLayout' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-259' is-artificial='yes'/>
            <parameter type-id='type-id-10' is-artificial='yes'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~MemoryMappingLayout' mangled-name='_ZN11__sanitizer19MemoryMappingLayoutD2Ev' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-259' is-artificial='yes'/>
            <parameter type-id='type-id-10' is-artificial='yes'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='MemoryMappingLayout' mangled-name='_ZN11__sanitizer19MemoryMappingLayoutC2Eb' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-259' is-artificial='yes'/>
            <parameter type-id='type-id-112'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
      </class-decl>
      <class-decl name='ProcSelfMapsBuff' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='35' column='1' id='type-id-283'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='data' type-id='type-id-28' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='36' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='mmaped_size' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='37' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='len' type-id='type-id-106' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_procmaps.h' line='38' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='ThreadLister' size-in-bits='384' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='46' column='1' id='type-id-261'>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='pid_' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='59' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='32'>
          <var-decl name='descriptor_' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='60' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='buffer_' type-id='type-id-189' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='61' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='192'>
          <var-decl name='error_' type-id='type-id-112' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='62' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='256'>
          <var-decl name='entry_' type-id='type-id-267' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='63' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='320'>
          <var-decl name='bytes_read_' type-id='type-id-10' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='64' column='1'/>
        </data-member>
        <member-function access='public' constructor='yes'>
          <function-decl name='ThreadLister' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-262' is-artificial='yes'/>
            <parameter type-id='type-id-10'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~ThreadLister' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-262' is-artificial='yes'/>
            <parameter type-id='type-id-10'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public' constructor='yes'>
          <function-decl name='ThreadLister' mangled-name='_ZN11__sanitizer12ThreadListerC2Ei' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-262' is-artificial='yes'/>
            <parameter type-id='type-id-10'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
        <member-function access='public' destructor='yes'>
          <function-decl name='~ThreadLister' mangled-name='_ZN11__sanitizer12ThreadListerD2Ev' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
            <parameter type-id='type-id-262' is-artificial='yes'/>
            <parameter type-id='type-id-10'/>
            <return type-id='type-id-4'/>
          </function-decl>
        </member-function>
      </class-decl>
      <function-decl name='internal_open' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-2'/>
        <parameter type-id='type-id-10'/>
        <parameter type-id='type-id-284'/>
        <return type-id='type-id-106'/>
      </function-decl>
      <function-decl name='internal_iserror' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_syscall_linux_x86_64.inc' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-106'/>
        <parameter type-id='type-id-42'/>
        <return type-id='type-id-112'/>
      </function-decl>
      <function-decl name='internal_fstat' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-191'/>
        <parameter type-id='type-id-1'/>
        <return type-id='type-id-106'/>
      </function-decl>
      <function-decl name='internal_stat' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-2'/>
        <parameter type-id='type-id-1'/>
        <return type-id='type-id-106'/>
      </function-decl>
      <function-decl name='internal_execve' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='201' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-2'/>
        <parameter type-id='type-id-269'/>
        <parameter type-id='type-id-269'/>
        <return type-id='type-id-106'/>
      </function-decl>
      <function-decl name='internal_lseek' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='594' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-191'/>
        <parameter type-id='type-id-285'/>
        <parameter type-id='type-id-10'/>
        <return type-id='type-id-106'/>
      </function-decl>
      <function-decl name='internal_readlink' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-2'/>
        <parameter type-id='type-id-28'/>
        <parameter type-id='type-id-106'/>
        <return type-id='type-id-106'/>
      </function-decl>
      <function-decl name='internal_sched_yield' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='192' column='1' visibility='default' binding='global' size-in-bits='64'>
        <return type-id='type-id-106'/>
      </function-decl>
      <function-decl name='internal_close' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-191'/>
        <return type-id='type-id-106'/>
      </function-decl>
      <function-decl name='internal_open' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='95' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-2'/>
        <parameter type-id='type-id-10'/>
        <return type-id='type-id-106'/>
      </function-decl>
      <function-decl name='internal_getdents' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='590' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-191'/>
        <parameter type-id='type-id-267'/>
        <parameter type-id='type-id-211'/>
        <return type-id='type-id-106'/>
      </function-decl>
      <function-decl name='atomic_exchange&lt;__sanitizer::atomic_uint32_t&gt;' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic_clang.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-286'/>
        <parameter type-id='type-id-287'/>
        <parameter type-id='type-id-288'/>
        <return type-id='type-id-287'/>
      </function-decl>
    </namespace-decl>
    <namespace-decl name='__sanitizer'>
      <class-decl name='__sanitizer_kernel_sigset_t' size-in-bits='64' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.h' line='419' column='1' id='type-id-282'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='sig' type-id='type-id-289' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.h' line='420' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='__sanitizer'>
      <enum-decl name='memory_order' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='19' column='1' id='type-id-288'>
        <underlying-type type-id='type-id-62'/>
        <enumerator name='memory_order_relaxed' value='1'/>
        <enumerator name='memory_order_consume' value='2'/>
        <enumerator name='memory_order_acquire' value='4'/>
        <enumerator name='memory_order_release' value='8'/>
        <enumerator name='memory_order_acq_rel' value='16'/>
        <enumerator name='memory_order_seq_cst' value='32'/>
      </enum-decl>
    </namespace-decl>
    <function-type size-in-bits='64' id='type-id-275'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-277'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-4'/>
    </function-type>
    <typedef-decl name='Elf64_Addr' type-id='type-id-290' filepath='/usr/include/elf.h' line='50' column='1' id='type-id-249'/>
    <typedef-decl name='Elf64_Xword' type-id='type-id-290' filepath='/usr/include/elf.h' line='45' column='1' id='type-id-255'/>
    <namespace-decl name='__sanitizer'>
      <typedef-decl name='OFF_T' type-id='type-id-157' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='81' column='1' id='type-id-285'/>
    </namespace-decl>
    <namespace-decl name='__sanitizer'>
      <class-decl name='atomic_uint32_t' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='38' column='1' id='type-id-291'>
        <member-type access='public'>
          <typedef-decl name='Type' type-id='type-id-284' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='39' column='1' id='type-id-287'/>
        </member-type>
      </class-decl>
    </namespace-decl>
    <namespace-decl name='__sanitizer'>
      <typedef-decl name='u32' type-id='type-id-211' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_internal_defs.h' line='68' column='1' id='type-id-284'/>
    </namespace-decl>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-279'/>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' id='type-id-281'/>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' id='type-id-286'/>
    <typedef-decl name='uint64_t' type-id='type-id-33' filepath='/usr/include/stdint.h' line='56' column='1' id='type-id-290'/>
    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='64' id='type-id-289'>
      <subrange length='8' type-id='type-id-50' id='type-id-294'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-291' volatile='yes' id='type-id-293'/>
    <namespace-decl name='__sanitizer'>
      <class-decl name='atomic_uint32_t' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='38' column='1' id='type-id-291'>
        <member-type access='public'>
          <typedef-decl name='Type' type-id='type-id-284' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='39' column='1' id='type-id-287'/>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='val_dont_use' type-id='type-id-295' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_atomic.h' line='40' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <qualified-type-def type-id='type-id-287' volatile='yes' id='type-id-295'/>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_linux_libcdep.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='448' id='type-id-296'>
      <subrange length='56' type-id='type-id-50' id='type-id-297'/>
    </array-type-def>
    <typedef-decl name='_Unwind_Reason_Code' type-id='type-id-298' filepath='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/host-x86_64-unknown-linux-gnu/gcc/include/unwind.h' line='76' column='1' id='type-id-299'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' linkage-name='19_Unwind_Reason_Code' filepath='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/host-x86_64-unknown-linux-gnu/gcc/include/unwind.h' line='66' column='1' id='type-id-298'>
      <underlying-type type-id='type-id-62'/>
      <enumerator name='_URC_NO_REASON' value='0'/>
      <enumerator name='_URC_FOREIGN_EXCEPTION_CAUGHT' value='1'/>
      <enumerator name='_URC_FATAL_PHASE2_ERROR' value='2'/>
      <enumerator name='_URC_FATAL_PHASE1_ERROR' value='3'/>
      <enumerator name='_URC_NORMAL_STOP' value='4'/>
      <enumerator name='_URC_END_OF_STACK' value='5'/>
      <enumerator name='_URC_HANDLER_FOUND' value='6'/>
      <enumerator name='_URC_INSTALL_CONTEXT' value='7'/>
      <enumerator name='_URC_CONTINUE_UNWIND' value='8'/>
    </enum-decl>
    <typedef-decl name='_Unwind_Ptr' type-id='type-id-33' filepath='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/host-x86_64-unknown-linux-gnu/gcc/include/unwind.h' line='53' column='1' id='type-id-300'/>
    <typedef-decl name='pthread_attr_t' type-id='type-id-301' filepath='/usr/include/bits/pthreadtypes.h' line='57' column='1' id='type-id-302'/>
    <union-decl name='__anonymous_union__' size-in-bits='448' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='54' column='1' id='type-id-301'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-296' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='55' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-45' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='56' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-303' size-in-bits='64' id='type-id-304'/>
    <qualified-type-def type-id='type-id-173' const='yes' id='type-id-305'/>
    <pointer-type-def type-id='type-id-306' size-in-bits='64' id='type-id-307'/>
    <qualified-type-def type-id='type-id-302' const='yes' id='type-id-308'/>
    <pointer-type-def type-id='type-id-308' size-in-bits='64' id='type-id-309'/>
    <pointer-type-def type-id='type-id-302' size-in-bits='64' id='type-id-310'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-88'/>
    <namespace-decl name='__sanitizer'>
      <typedef-decl name='string_predicate_t' type-id='type-id-307' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='467' column='1' id='type-id-311'/>
      <function-decl name='Unwind_GetIP' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux_libcdep.cc' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='type-id-304'/>
        <return type-id='type-id-106'/>
      </function-decl>
      <function-decl name='GetTlsSize' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux_libcdep.cc' line='204' column='1' visibility='default' binding='global' size-in-bits='64'>
        <return type-id='type-id-106'/>
      </function-decl>
      <function-decl name='ThreadSelf' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux_libcdep.cc' line='254' column='1' visibility='default' binding='global' size-in-bits='64'>
        <return type-id='type-id-106'/>
      </function-decl>
    </namespace-decl>
    <function-decl name='_Unwind_GetIP' filepath='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/host-x86_64-unknown-linux-gnu/gcc/include/unwind.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-304'/>
      <return type-id='type-id-300'/>
    </function-decl>
    <function-decl name='pthread_attr_getstack' filepath='/usr/include/pthread.h' line='373' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-309'/>
      <parameter type-id='type-id-312'/>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='dlsym' filepath='/usr/include/dlfcn.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='prctl' filepath='/usr/include/sys/prctl.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='confstr' filepath='/usr/include/unistd.h' line='620' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pthread_attr_setstacksize' filepath='/usr/include/pthread.h' line='367' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-310'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <class-decl name='_Unwind_Context' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-303'/>
    <function-type size-in-bits='64' id='type-id-306'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-112'/>
    </function-type>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-312'/>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_linux.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <namespace-decl name='__sanitizer'>
      <var-decl name='struct_statfs64_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer18struct_statfs64_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_linux.cc' line='63' column='1'/>
    </namespace-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
    <namespace-decl name='__sanitizer'>
      <var-decl name='struct_utsname_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer17struct_utsname_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='120' column='1'/>
      <var-decl name='struct_stat_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer14struct_stat_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='121' column='1'/>
      <var-decl name='struct_stat64_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer16struct_stat64_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='123' column='1'/>
      <var-decl name='struct_rusage_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer16struct_rusage_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='125' column='1'/>
      <var-decl name='struct_passwd_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer16struct_passwd_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='127' column='1'/>
      <var-decl name='struct_group_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer15struct_group_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='128' column='1'/>
      <var-decl name='siginfo_t_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer12siginfo_t_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='129' column='1'/>
      <var-decl name='struct_itimerval_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer19struct_itimerval_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='131' column='1'/>
      <var-decl name='pthread_t_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer12pthread_t_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='132' column='1'/>
      <var-decl name='pthread_cond_t_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer17pthread_cond_t_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='133' column='1'/>
      <var-decl name='pid_t_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer8pid_t_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='134' column='1'/>
      <var-decl name='timeval_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer10timeval_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='135' column='1'/>
      <var-decl name='uid_t_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer8uid_t_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='136' column='1'/>
      <var-decl name='mbstate_t_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer12mbstate_t_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='137' column='1'/>
      <var-decl name='struct_timezone_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer18struct_timezone_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='139' column='1'/>
      <var-decl name='struct_tms_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer13struct_tms_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='140' column='1'/>
      <var-decl name='struct_itimerspec_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer20struct_itimerspec_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='165' column='1'/>
      <var-decl name='struct_sigevent_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer18struct_sigevent_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='141' column='1'/>
      <var-decl name='struct_sched_param_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer21struct_sched_param_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='142' column='1'/>
      <var-decl name='struct_statfs_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer16struct_statfs_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='143' column='1'/>
      <var-decl name='ucontext_t_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer13ucontext_t_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='150' column='1'/>
      <var-decl name='struct_utimbuf_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer17struct_utimbuf_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='161' column='1'/>
      <var-decl name='struct_new_utsname_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer21struct_new_utsname_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='162' column='1'/>
      <var-decl name='struct_old_utsname_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer21struct_old_utsname_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='163' column='1'/>
      <var-decl name='struct_oldold_utsname_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer24struct_oldold_utsname_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='164' column='1'/>
      <var-decl name='struct_msqid_ds_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer18struct_msqid_ds_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='172' column='1'/>
      <var-decl name='struct_mq_attr_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer17struct_mq_attr_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='173' column='1'/>
      <var-decl name='struct_timex_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer15struct_timex_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='171' column='1'/>
      <var-decl name='struct_ustat_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer15struct_ustat_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='166' column='1'/>
      <var-decl name='struct_rlimit_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer16struct_rlimit_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='154' column='1'/>
      <var-decl name='struct_epoll_event_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer21struct_epoll_event_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='155' column='1'/>
      <var-decl name='struct_sysinfo_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer17struct_sysinfo_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='156' column='1'/>
      <var-decl name='struct_timespec_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer18struct_timespec_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='157' column='1'/>
      <var-decl name='__user_cap_header_struct_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer27__user_cap_header_struct_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='158' column='1'/>
      <var-decl name='__user_cap_data_struct_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer25__user_cap_data_struct_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='160' column='1'/>
      <var-decl name='struct_rlimit64_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer18struct_rlimit64_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='170' column='1'/>
      <var-decl name='struct_statvfs_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer17struct_statvfs_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='174' column='1'/>
      <var-decl name='struct_statvfs64_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer19struct_statvfs64_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='175' column='1'/>
      <var-decl name='sig_ign' type-id='type-id-106' mangled-name='_ZN11__sanitizer7sig_ignE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='178' column='1'/>
      <var-decl name='sig_dfl' type-id='type-id-106' mangled-name='_ZN11__sanitizer7sig_dflE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='179' column='1'/>
      <var-decl name='sa_siginfo' type-id='type-id-106' mangled-name='_ZN11__sanitizer10sa_siginfoE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='180' column='1'/>
      <var-decl name='e_tabsz' type-id='type-id-10' mangled-name='_ZN11__sanitizer7e_tabszE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='183' column='1'/>
      <var-decl name='af_inet' type-id='type-id-10' mangled-name='_ZN11__sanitizer7af_inetE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='196' column='1'/>
      <var-decl name='af_inet6' type-id='type-id-10' mangled-name='_ZN11__sanitizer8af_inet6E' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='197' column='1'/>
      <var-decl name='glob_nomatch' type-id='type-id-10' mangled-name='_ZN11__sanitizer12glob_nomatchE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='209' column='1'/>
      <var-decl name='glob_altdirfunc' type-id='type-id-10' mangled-name='_ZN11__sanitizer15glob_altdirfuncE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='210' column='1'/>
      <var-decl name='path_max' type-id='type-id-211' mangled-name='_ZN11__sanitizer8path_maxE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='243' column='1'/>
      <var-decl name='struct_user_regs_struct_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer26struct_user_regs_struct_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='215' column='1'/>
      <var-decl name='struct_user_fpregs_struct_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer28struct_user_fpregs_struct_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='216' column='1'/>
      <var-decl name='struct_user_fpxregs_struct_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer29struct_user_fpxregs_struct_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='218' column='1'/>
      <var-decl name='ptrace_peektext' type-id='type-id-10' mangled-name='_ZN11__sanitizer15ptrace_peektextE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='223' column='1'/>
      <var-decl name='ptrace_peekdata' type-id='type-id-10' mangled-name='_ZN11__sanitizer15ptrace_peekdataE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='224' column='1'/>
      <var-decl name='ptrace_peekuser' type-id='type-id-10' mangled-name='_ZN11__sanitizer15ptrace_peekuserE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='225' column='1'/>
      <var-decl name='ptrace_getregs' type-id='type-id-10' mangled-name='_ZN11__sanitizer14ptrace_getregsE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='226' column='1'/>
      <var-decl name='ptrace_setregs' type-id='type-id-10' mangled-name='_ZN11__sanitizer14ptrace_setregsE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='227' column='1'/>
      <var-decl name='ptrace_getfpregs' type-id='type-id-10' mangled-name='_ZN11__sanitizer16ptrace_getfpregsE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='228' column='1'/>
      <var-decl name='ptrace_setfpregs' type-id='type-id-10' mangled-name='_ZN11__sanitizer16ptrace_setfpregsE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='229' column='1'/>
      <var-decl name='ptrace_getfpxregs' type-id='type-id-10' mangled-name='_ZN11__sanitizer17ptrace_getfpxregsE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='230' column='1'/>
      <var-decl name='ptrace_setfpxregs' type-id='type-id-10' mangled-name='_ZN11__sanitizer17ptrace_setfpxregsE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='231' column='1'/>
      <var-decl name='ptrace_getsiginfo' type-id='type-id-10' mangled-name='_ZN11__sanitizer17ptrace_getsiginfoE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='232' column='1'/>
      <var-decl name='ptrace_setsiginfo' type-id='type-id-10' mangled-name='_ZN11__sanitizer17ptrace_setsiginfoE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='233' column='1'/>
      <var-decl name='ptrace_getregset' type-id='type-id-10' mangled-name='_ZN11__sanitizer16ptrace_getregsetE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='238' column='1'/>
      <var-decl name='ptrace_setregset' type-id='type-id-10' mangled-name='_ZN11__sanitizer16ptrace_setregsetE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='239' column='1'/>
      <var-decl name='struct_shminfo_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer17struct_shminfo_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='188' column='1'/>
      <var-decl name='struct_shm_info_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer18struct_shm_info_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='189' column='1'/>
      <var-decl name='shmctl_ipc_stat' type-id='type-id-10' mangled-name='_ZN11__sanitizer15shmctl_ipc_statE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='190' column='1'/>
      <var-decl name='shmctl_ipc_info' type-id='type-id-10' mangled-name='_ZN11__sanitizer15shmctl_ipc_infoE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='191' column='1'/>
      <var-decl name='shmctl_shm_info' type-id='type-id-10' mangled-name='_ZN11__sanitizer15shmctl_shm_infoE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='192' column='1'/>
      <var-decl name='shmctl_shm_stat' type-id='type-id-10' mangled-name='_ZN11__sanitizer15shmctl_shm_statE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='193' column='1'/>
      <var-decl name='struct_arpreq_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer16struct_arpreq_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='246' column='1'/>
      <var-decl name='struct_ifreq_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer15struct_ifreq_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='247' column='1'/>
      <var-decl name='struct_termios_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer17struct_termios_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='248' column='1'/>
      <var-decl name='struct_winsize_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer17struct_winsize_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='249' column='1'/>
      <var-decl name='struct_cdrom_msf_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer19struct_cdrom_msf_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='252' column='1'/>
      <var-decl name='struct_cdrom_multisession_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer28struct_cdrom_multisession_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='253' column='1'/>
      <var-decl name='struct_cdrom_read_audio_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer26struct_cdrom_read_audio_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='254' column='1'/>
      <var-decl name='struct_cdrom_subchnl_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer23struct_cdrom_subchnl_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='255' column='1'/>
      <var-decl name='struct_cdrom_ti_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer18struct_cdrom_ti_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='256' column='1'/>
      <var-decl name='struct_cdrom_tocentry_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer24struct_cdrom_tocentry_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='257' column='1'/>
      <var-decl name='struct_cdrom_tochdr_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer22struct_cdrom_tochdr_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='258' column='1'/>
      <var-decl name='struct_cdrom_volctrl_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer23struct_cdrom_volctrl_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='259' column='1'/>
      <var-decl name='struct_copr_buffer_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer21struct_copr_buffer_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='265' column='1'/>
      <var-decl name='struct_copr_debug_buf_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer24struct_copr_debug_buf_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='266' column='1'/>
      <var-decl name='struct_copr_msg_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer18struct_copr_msg_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='267' column='1'/>
      <var-decl name='struct_ff_effect_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer19struct_ff_effect_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='269' column='1'/>
      <var-decl name='struct_floppy_drive_params_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer29struct_floppy_drive_params_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='270' column='1'/>
      <var-decl name='struct_floppy_drive_struct_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer29struct_floppy_drive_struct_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='271' column='1'/>
      <var-decl name='struct_floppy_fdc_state_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer26struct_floppy_fdc_state_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='272' column='1'/>
      <var-decl name='struct_floppy_max_errors_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer27struct_floppy_max_errors_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='273' column='1'/>
      <var-decl name='struct_floppy_raw_cmd_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer24struct_floppy_raw_cmd_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='274' column='1'/>
      <var-decl name='struct_floppy_struct_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer23struct_floppy_struct_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='275' column='1'/>
      <var-decl name='struct_floppy_write_errors_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer29struct_floppy_write_errors_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='276' column='1'/>
      <var-decl name='struct_format_descr_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer22struct_format_descr_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='277' column='1'/>
      <var-decl name='struct_hd_driveid_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer20struct_hd_driveid_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='278' column='1'/>
      <var-decl name='struct_hd_geometry_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer21struct_hd_geometry_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='279' column='1'/>
      <var-decl name='struct_input_absinfo_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer23struct_input_absinfo_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='280' column='1'/>
      <var-decl name='struct_input_id_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer18struct_input_id_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='281' column='1'/>
      <var-decl name='struct_midi_info_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer19struct_midi_info_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='282' column='1'/>
      <var-decl name='struct_mtget_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer15struct_mtget_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='283' column='1'/>
      <var-decl name='struct_mtop_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer14struct_mtop_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='284' column='1'/>
      <var-decl name='struct_mtpos_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer15struct_mtpos_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='285' column='1'/>
      <var-decl name='struct_rtentry_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer17struct_rtentry_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='286' column='1'/>
      <var-decl name='struct_sbi_instrument_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer24struct_sbi_instrument_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='287' column='1'/>
      <var-decl name='struct_seq_event_rec_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer23struct_seq_event_rec_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='288' column='1'/>
      <var-decl name='struct_synth_info_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer20struct_synth_info_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='289' column='1'/>
      <var-decl name='struct_termio_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer16struct_termio_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='290' column='1'/>
      <var-decl name='struct_vt_consize_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer20struct_vt_consize_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='291' column='1'/>
      <var-decl name='struct_vt_mode_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer17struct_vt_mode_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='292' column='1'/>
      <var-decl name='struct_vt_sizes_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer18struct_vt_sizes_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='293' column='1'/>
      <var-decl name='struct_vt_stat_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer17struct_vt_stat_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='294' column='1'/>
      <var-decl name='struct_audio_buf_info_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer24struct_audio_buf_info_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='298' column='1'/>
      <var-decl name='struct_ax25_parms_struct_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer27struct_ax25_parms_struct_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='299' column='1'/>
      <var-decl name='struct_cyclades_monitor_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer26struct_cyclades_monitor_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='300' column='1'/>
      <var-decl name='struct_input_keymap_entry_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer28struct_input_keymap_entry_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='304' column='1'/>
      <var-decl name='struct_ipx_config_data_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer25struct_ipx_config_data_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='306' column='1'/>
      <var-decl name='struct_kbdiacrs_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer18struct_kbdiacrs_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='307' column='1'/>
      <var-decl name='struct_kbentry_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer17struct_kbentry_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='308' column='1'/>
      <var-decl name='struct_kbkeycode_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer19struct_kbkeycode_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='309' column='1'/>
      <var-decl name='struct_kbsentry_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer18struct_kbsentry_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='310' column='1'/>
      <var-decl name='struct_mtconfiginfo_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer22struct_mtconfiginfo_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='311' column='1'/>
      <var-decl name='struct_nr_parms_struct_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer25struct_nr_parms_struct_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='312' column='1'/>
      <var-decl name='struct_ppp_stats_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer19struct_ppp_stats_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='313' column='1'/>
      <var-decl name='struct_scc_modem_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer19struct_scc_modem_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='314' column='1'/>
      <var-decl name='struct_scc_stat_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer18struct_scc_stat_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='315' column='1'/>
      <var-decl name='struct_serial_multiport_struct_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer33struct_serial_multiport_struct_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='316' column='1'/>
      <var-decl name='struct_serial_struct_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer23struct_serial_struct_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='318' column='1'/>
      <var-decl name='struct_sockaddr_ax25_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer23struct_sockaddr_ax25_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='319' column='1'/>
      <var-decl name='struct_unimapdesc_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer20struct_unimapdesc_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='320' column='1'/>
      <var-decl name='struct_unimapinit_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer20struct_unimapinit_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='321' column='1'/>
      <var-decl name='struct_sioc_sg_req_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer21struct_sioc_sg_req_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='325' column='1'/>
      <var-decl name='struct_sioc_vif_req_sz' type-id='type-id-211' mangled-name='_ZN11__sanitizer22struct_sioc_vif_req_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='326' column='1'/>
      <var-decl name='IOCTL_NOT_PRESENT' type-id='type-id-211' mangled-name='_ZN11__sanitizer17IOCTL_NOT_PRESENTE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='329' column='1'/>
      <var-decl name='IOCTL_FIOASYNC' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_FIOASYNCE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='331' column='1'/>
      <var-decl name='IOCTL_FIOCLEX' type-id='type-id-211' mangled-name='_ZN11__sanitizer13IOCTL_FIOCLEXE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='332' column='1'/>
      <var-decl name='IOCTL_FIOGETOWN' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_FIOGETOWNE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='333' column='1'/>
      <var-decl name='IOCTL_FIONBIO' type-id='type-id-211' mangled-name='_ZN11__sanitizer13IOCTL_FIONBIOE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='334' column='1'/>
      <var-decl name='IOCTL_FIONCLEX' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_FIONCLEXE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='335' column='1'/>
      <var-decl name='IOCTL_FIOSETOWN' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_FIOSETOWNE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='336' column='1'/>
      <var-decl name='IOCTL_SIOCADDMULTI' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_SIOCADDMULTIE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='337' column='1'/>
      <var-decl name='IOCTL_SIOCATMARK' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_SIOCATMARKE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='338' column='1'/>
      <var-decl name='IOCTL_SIOCDELMULTI' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_SIOCDELMULTIE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='339' column='1'/>
      <var-decl name='IOCTL_SIOCGIFADDR' type-id='type-id-211' mangled-name='_ZN11__sanitizer17IOCTL_SIOCGIFADDRE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='340' column='1'/>
      <var-decl name='IOCTL_SIOCGIFBRDADDR' type-id='type-id-211' mangled-name='_ZN11__sanitizer20IOCTL_SIOCGIFBRDADDRE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='341' column='1'/>
      <var-decl name='IOCTL_SIOCGIFCONF' type-id='type-id-211' mangled-name='_ZN11__sanitizer17IOCTL_SIOCGIFCONFE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='342' column='1'/>
      <var-decl name='IOCTL_SIOCGIFDSTADDR' type-id='type-id-211' mangled-name='_ZN11__sanitizer20IOCTL_SIOCGIFDSTADDRE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='343' column='1'/>
      <var-decl name='IOCTL_SIOCGIFFLAGS' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_SIOCGIFFLAGSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='344' column='1'/>
      <var-decl name='IOCTL_SIOCGIFMETRIC' type-id='type-id-211' mangled-name='_ZN11__sanitizer19IOCTL_SIOCGIFMETRICE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='345' column='1'/>
      <var-decl name='IOCTL_SIOCGIFMTU' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_SIOCGIFMTUE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='346' column='1'/>
      <var-decl name='IOCTL_SIOCGIFNETMASK' type-id='type-id-211' mangled-name='_ZN11__sanitizer20IOCTL_SIOCGIFNETMASKE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='347' column='1'/>
      <var-decl name='IOCTL_SIOCGPGRP' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_SIOCGPGRPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='348' column='1'/>
      <var-decl name='IOCTL_SIOCSIFADDR' type-id='type-id-211' mangled-name='_ZN11__sanitizer17IOCTL_SIOCSIFADDRE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='349' column='1'/>
      <var-decl name='IOCTL_SIOCSIFBRDADDR' type-id='type-id-211' mangled-name='_ZN11__sanitizer20IOCTL_SIOCSIFBRDADDRE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='350' column='1'/>
      <var-decl name='IOCTL_SIOCSIFDSTADDR' type-id='type-id-211' mangled-name='_ZN11__sanitizer20IOCTL_SIOCSIFDSTADDRE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='351' column='1'/>
      <var-decl name='IOCTL_SIOCSIFFLAGS' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_SIOCSIFFLAGSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='352' column='1'/>
      <var-decl name='IOCTL_SIOCSIFMETRIC' type-id='type-id-211' mangled-name='_ZN11__sanitizer19IOCTL_SIOCSIFMETRICE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='353' column='1'/>
      <var-decl name='IOCTL_SIOCSIFMTU' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_SIOCSIFMTUE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='354' column='1'/>
      <var-decl name='IOCTL_SIOCSIFNETMASK' type-id='type-id-211' mangled-name='_ZN11__sanitizer20IOCTL_SIOCSIFNETMASKE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='355' column='1'/>
      <var-decl name='IOCTL_SIOCSPGRP' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_SIOCSPGRPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='356' column='1'/>
      <var-decl name='IOCTL_TIOCCONS' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_TIOCCONSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='357' column='1'/>
      <var-decl name='IOCTL_TIOCEXCL' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_TIOCEXCLE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='358' column='1'/>
      <var-decl name='IOCTL_TIOCGETD' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_TIOCGETDE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='359' column='1'/>
      <var-decl name='IOCTL_TIOCGPGRP' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_TIOCGPGRPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='360' column='1'/>
      <var-decl name='IOCTL_TIOCGWINSZ' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_TIOCGWINSZE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='361' column='1'/>
      <var-decl name='IOCTL_TIOCMBIC' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_TIOCMBICE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='362' column='1'/>
      <var-decl name='IOCTL_TIOCMBIS' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_TIOCMBISE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='363' column='1'/>
      <var-decl name='IOCTL_TIOCMGET' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_TIOCMGETE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='364' column='1'/>
      <var-decl name='IOCTL_TIOCMSET' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_TIOCMSETE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='365' column='1'/>
      <var-decl name='IOCTL_TIOCNOTTY' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_TIOCNOTTYE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='366' column='1'/>
      <var-decl name='IOCTL_TIOCNXCL' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_TIOCNXCLE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='367' column='1'/>
      <var-decl name='IOCTL_TIOCOUTQ' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_TIOCOUTQE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='368' column='1'/>
      <var-decl name='IOCTL_TIOCPKT' type-id='type-id-211' mangled-name='_ZN11__sanitizer13IOCTL_TIOCPKTE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='369' column='1'/>
      <var-decl name='IOCTL_TIOCSCTTY' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_TIOCSCTTYE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='370' column='1'/>
      <var-decl name='IOCTL_TIOCSETD' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_TIOCSETDE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='371' column='1'/>
      <var-decl name='IOCTL_TIOCSPGRP' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_TIOCSPGRPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='372' column='1'/>
      <var-decl name='IOCTL_TIOCSTI' type-id='type-id-211' mangled-name='_ZN11__sanitizer13IOCTL_TIOCSTIE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='373' column='1'/>
      <var-decl name='IOCTL_TIOCSWINSZ' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_TIOCSWINSZE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='374' column='1'/>
      <var-decl name='IOCTL_SIOCGETSGCNT' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_SIOCGETSGCNTE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='376' column='1'/>
      <var-decl name='IOCTL_SIOCGETVIFCNT' type-id='type-id-211' mangled-name='_ZN11__sanitizer19IOCTL_SIOCGETVIFCNTE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='377' column='1'/>
      <var-decl name='IOCTL_EVIOCGABS' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_EVIOCGABSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='380' column='1'/>
      <var-decl name='IOCTL_EVIOCGBIT' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_EVIOCGBITE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='381' column='1'/>
      <var-decl name='IOCTL_EVIOCGEFFECTS' type-id='type-id-211' mangled-name='_ZN11__sanitizer19IOCTL_EVIOCGEFFECTSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='382' column='1'/>
      <var-decl name='IOCTL_EVIOCGID' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_EVIOCGIDE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='383' column='1'/>
      <var-decl name='IOCTL_EVIOCGKEY' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_EVIOCGKEYE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='384' column='1'/>
      <var-decl name='IOCTL_EVIOCGKEYCODE' type-id='type-id-211' mangled-name='_ZN11__sanitizer19IOCTL_EVIOCGKEYCODEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='385' column='1'/>
      <var-decl name='IOCTL_EVIOCGLED' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_EVIOCGLEDE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='386' column='1'/>
      <var-decl name='IOCTL_EVIOCGNAME' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_EVIOCGNAMEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='387' column='1'/>
      <var-decl name='IOCTL_EVIOCGPHYS' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_EVIOCGPHYSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='388' column='1'/>
      <var-decl name='IOCTL_EVIOCGRAB' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_EVIOCGRABE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='389' column='1'/>
      <var-decl name='IOCTL_EVIOCGREP' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_EVIOCGREPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='390' column='1'/>
      <var-decl name='IOCTL_EVIOCGSND' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_EVIOCGSNDE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='391' column='1'/>
      <var-decl name='IOCTL_EVIOCGSW' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_EVIOCGSWE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='392' column='1'/>
      <var-decl name='IOCTL_EVIOCGUNIQ' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_EVIOCGUNIQE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='393' column='1'/>
      <var-decl name='IOCTL_EVIOCGVERSION' type-id='type-id-211' mangled-name='_ZN11__sanitizer19IOCTL_EVIOCGVERSIONE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='394' column='1'/>
      <var-decl name='IOCTL_EVIOCRMFF' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_EVIOCRMFFE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='395' column='1'/>
      <var-decl name='IOCTL_EVIOCSABS' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_EVIOCSABSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='396' column='1'/>
      <var-decl name='IOCTL_EVIOCSFF' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_EVIOCSFFE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='397' column='1'/>
      <var-decl name='IOCTL_EVIOCSKEYCODE' type-id='type-id-211' mangled-name='_ZN11__sanitizer19IOCTL_EVIOCSKEYCODEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='398' column='1'/>
      <var-decl name='IOCTL_EVIOCSREP' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_EVIOCSREPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='399' column='1'/>
      <var-decl name='IOCTL_BLKFLSBUF' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_BLKFLSBUFE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='400' column='1'/>
      <var-decl name='IOCTL_BLKGETSIZE' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_BLKGETSIZEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='401' column='1'/>
      <var-decl name='IOCTL_BLKRAGET' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_BLKRAGETE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='402' column='1'/>
      <var-decl name='IOCTL_BLKRASET' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_BLKRASETE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='403' column='1'/>
      <var-decl name='IOCTL_BLKROGET' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_BLKROGETE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='404' column='1'/>
      <var-decl name='IOCTL_BLKROSET' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_BLKROSETE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='405' column='1'/>
      <var-decl name='IOCTL_BLKRRPART' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_BLKRRPARTE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='406' column='1'/>
      <var-decl name='IOCTL_CDROMAUDIOBUFSIZ' type-id='type-id-211' mangled-name='_ZN11__sanitizer22IOCTL_CDROMAUDIOBUFSIZE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='407' column='1'/>
      <var-decl name='IOCTL_CDROMEJECT' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_CDROMEJECTE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='408' column='1'/>
      <var-decl name='IOCTL_CDROMEJECT_SW' type-id='type-id-211' mangled-name='_ZN11__sanitizer19IOCTL_CDROMEJECT_SWE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='409' column='1'/>
      <var-decl name='IOCTL_CDROMMULTISESSION' type-id='type-id-211' mangled-name='_ZN11__sanitizer23IOCTL_CDROMMULTISESSIONE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='410' column='1'/>
      <var-decl name='IOCTL_CDROMPAUSE' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_CDROMPAUSEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='411' column='1'/>
      <var-decl name='IOCTL_CDROMPLAYMSF' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_CDROMPLAYMSFE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='412' column='1'/>
      <var-decl name='IOCTL_CDROMPLAYTRKIND' type-id='type-id-211' mangled-name='_ZN11__sanitizer21IOCTL_CDROMPLAYTRKINDE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='413' column='1'/>
      <var-decl name='IOCTL_CDROMREADAUDIO' type-id='type-id-211' mangled-name='_ZN11__sanitizer20IOCTL_CDROMREADAUDIOE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='414' column='1'/>
      <var-decl name='IOCTL_CDROMREADCOOKED' type-id='type-id-211' mangled-name='_ZN11__sanitizer21IOCTL_CDROMREADCOOKEDE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='415' column='1'/>
      <var-decl name='IOCTL_CDROMREADMODE1' type-id='type-id-211' mangled-name='_ZN11__sanitizer20IOCTL_CDROMREADMODE1E' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='416' column='1'/>
      <var-decl name='IOCTL_CDROMREADMODE2' type-id='type-id-211' mangled-name='_ZN11__sanitizer20IOCTL_CDROMREADMODE2E' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='417' column='1'/>
      <var-decl name='IOCTL_CDROMREADRAW' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_CDROMREADRAWE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='418' column='1'/>
      <var-decl name='IOCTL_CDROMREADTOCENTRY' type-id='type-id-211' mangled-name='_ZN11__sanitizer23IOCTL_CDROMREADTOCENTRYE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='419' column='1'/>
      <var-decl name='IOCTL_CDROMREADTOCHDR' type-id='type-id-211' mangled-name='_ZN11__sanitizer21IOCTL_CDROMREADTOCHDRE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='420' column='1'/>
      <var-decl name='IOCTL_CDROMRESET' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_CDROMRESETE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='421' column='1'/>
      <var-decl name='IOCTL_CDROMRESUME' type-id='type-id-211' mangled-name='_ZN11__sanitizer17IOCTL_CDROMRESUMEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='422' column='1'/>
      <var-decl name='IOCTL_CDROMSEEK' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_CDROMSEEKE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='423' column='1'/>
      <var-decl name='IOCTL_CDROMSTART' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_CDROMSTARTE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='424' column='1'/>
      <var-decl name='IOCTL_CDROMSTOP' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_CDROMSTOPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='425' column='1'/>
      <var-decl name='IOCTL_CDROMSUBCHNL' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_CDROMSUBCHNLE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='426' column='1'/>
      <var-decl name='IOCTL_CDROMVOLCTRL' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_CDROMVOLCTRLE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='427' column='1'/>
      <var-decl name='IOCTL_CDROMVOLREAD' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_CDROMVOLREADE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='428' column='1'/>
      <var-decl name='IOCTL_CDROM_GET_UPC' type-id='type-id-211' mangled-name='_ZN11__sanitizer19IOCTL_CDROM_GET_UPCE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='429' column='1'/>
      <var-decl name='IOCTL_FDCLRPRM' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_FDCLRPRME' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='430' column='1'/>
      <var-decl name='IOCTL_FDDEFPRM' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_FDDEFPRME' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='431' column='1'/>
      <var-decl name='IOCTL_FDFLUSH' type-id='type-id-211' mangled-name='_ZN11__sanitizer13IOCTL_FDFLUSHE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='432' column='1'/>
      <var-decl name='IOCTL_FDFMTBEG' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_FDFMTBEGE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='433' column='1'/>
      <var-decl name='IOCTL_FDFMTEND' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_FDFMTENDE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='434' column='1'/>
      <var-decl name='IOCTL_FDFMTTRK' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_FDFMTTRKE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='435' column='1'/>
      <var-decl name='IOCTL_FDGETDRVPRM' type-id='type-id-211' mangled-name='_ZN11__sanitizer17IOCTL_FDGETDRVPRME' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='436' column='1'/>
      <var-decl name='IOCTL_FDGETDRVSTAT' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_FDGETDRVSTATE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='437' column='1'/>
      <var-decl name='IOCTL_FDGETDRVTYP' type-id='type-id-211' mangled-name='_ZN11__sanitizer17IOCTL_FDGETDRVTYPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='438' column='1'/>
      <var-decl name='IOCTL_FDGETFDCSTAT' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_FDGETFDCSTATE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='439' column='1'/>
      <var-decl name='IOCTL_FDGETMAXERRS' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_FDGETMAXERRSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='440' column='1'/>
      <var-decl name='IOCTL_FDGETPRM' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_FDGETPRME' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='441' column='1'/>
      <var-decl name='IOCTL_FDMSGOFF' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_FDMSGOFFE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='442' column='1'/>
      <var-decl name='IOCTL_FDMSGON' type-id='type-id-211' mangled-name='_ZN11__sanitizer13IOCTL_FDMSGONE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='443' column='1'/>
      <var-decl name='IOCTL_FDPOLLDRVSTAT' type-id='type-id-211' mangled-name='_ZN11__sanitizer19IOCTL_FDPOLLDRVSTATE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='444' column='1'/>
      <var-decl name='IOCTL_FDRAWCMD' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_FDRAWCMDE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='445' column='1'/>
      <var-decl name='IOCTL_FDRESET' type-id='type-id-211' mangled-name='_ZN11__sanitizer13IOCTL_FDRESETE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='446' column='1'/>
      <var-decl name='IOCTL_FDSETDRVPRM' type-id='type-id-211' mangled-name='_ZN11__sanitizer17IOCTL_FDSETDRVPRME' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='447' column='1'/>
      <var-decl name='IOCTL_FDSETEMSGTRESH' type-id='type-id-211' mangled-name='_ZN11__sanitizer20IOCTL_FDSETEMSGTRESHE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='448' column='1'/>
      <var-decl name='IOCTL_FDSETMAXERRS' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_FDSETMAXERRSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='449' column='1'/>
      <var-decl name='IOCTL_FDSETPRM' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_FDSETPRME' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='450' column='1'/>
      <var-decl name='IOCTL_FDTWADDLE' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_FDTWADDLEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='451' column='1'/>
      <var-decl name='IOCTL_FDWERRORCLR' type-id='type-id-211' mangled-name='_ZN11__sanitizer17IOCTL_FDWERRORCLRE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='452' column='1'/>
      <var-decl name='IOCTL_FDWERRORGET' type-id='type-id-211' mangled-name='_ZN11__sanitizer17IOCTL_FDWERRORGETE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='453' column='1'/>
      <var-decl name='IOCTL_HDIO_DRIVE_CMD' type-id='type-id-211' mangled-name='_ZN11__sanitizer20IOCTL_HDIO_DRIVE_CMDE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='454' column='1'/>
      <var-decl name='IOCTL_HDIO_GETGEO' type-id='type-id-211' mangled-name='_ZN11__sanitizer17IOCTL_HDIO_GETGEOE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='455' column='1'/>
      <var-decl name='IOCTL_HDIO_GET_32BIT' type-id='type-id-211' mangled-name='_ZN11__sanitizer20IOCTL_HDIO_GET_32BITE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='456' column='1'/>
      <var-decl name='IOCTL_HDIO_GET_DMA' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_HDIO_GET_DMAE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='457' column='1'/>
      <var-decl name='IOCTL_HDIO_GET_IDENTITY' type-id='type-id-211' mangled-name='_ZN11__sanitizer23IOCTL_HDIO_GET_IDENTITYE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='458' column='1'/>
      <var-decl name='IOCTL_HDIO_GET_KEEPSETTINGS' type-id='type-id-211' mangled-name='_ZN11__sanitizer27IOCTL_HDIO_GET_KEEPSETTINGSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='459' column='1'/>
      <var-decl name='IOCTL_HDIO_GET_MULTCOUNT' type-id='type-id-211' mangled-name='_ZN11__sanitizer24IOCTL_HDIO_GET_MULTCOUNTE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='460' column='1'/>
      <var-decl name='IOCTL_HDIO_GET_NOWERR' type-id='type-id-211' mangled-name='_ZN11__sanitizer21IOCTL_HDIO_GET_NOWERRE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='461' column='1'/>
      <var-decl name='IOCTL_HDIO_GET_UNMASKINTR' type-id='type-id-211' mangled-name='_ZN11__sanitizer25IOCTL_HDIO_GET_UNMASKINTRE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='462' column='1'/>
      <var-decl name='IOCTL_HDIO_SET_32BIT' type-id='type-id-211' mangled-name='_ZN11__sanitizer20IOCTL_HDIO_SET_32BITE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='463' column='1'/>
      <var-decl name='IOCTL_HDIO_SET_DMA' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_HDIO_SET_DMAE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='464' column='1'/>
      <var-decl name='IOCTL_HDIO_SET_KEEPSETTINGS' type-id='type-id-211' mangled-name='_ZN11__sanitizer27IOCTL_HDIO_SET_KEEPSETTINGSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='465' column='1'/>
      <var-decl name='IOCTL_HDIO_SET_MULTCOUNT' type-id='type-id-211' mangled-name='_ZN11__sanitizer24IOCTL_HDIO_SET_MULTCOUNTE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='466' column='1'/>
      <var-decl name='IOCTL_HDIO_SET_NOWERR' type-id='type-id-211' mangled-name='_ZN11__sanitizer21IOCTL_HDIO_SET_NOWERRE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='467' column='1'/>
      <var-decl name='IOCTL_HDIO_SET_UNMASKINTR' type-id='type-id-211' mangled-name='_ZN11__sanitizer25IOCTL_HDIO_SET_UNMASKINTRE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='468' column='1'/>
      <var-decl name='IOCTL_MTIOCGET' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_MTIOCGETE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='469' column='1'/>
      <var-decl name='IOCTL_MTIOCPOS' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_MTIOCPOSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='470' column='1'/>
      <var-decl name='IOCTL_MTIOCTOP' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_MTIOCTOPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='471' column='1'/>
      <var-decl name='IOCTL_PPPIOCGASYNCMAP' type-id='type-id-211' mangled-name='_ZN11__sanitizer21IOCTL_PPPIOCGASYNCMAPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='472' column='1'/>
      <var-decl name='IOCTL_PPPIOCGDEBUG' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_PPPIOCGDEBUGE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='473' column='1'/>
      <var-decl name='IOCTL_PPPIOCGFLAGS' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_PPPIOCGFLAGSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='474' column='1'/>
      <var-decl name='IOCTL_PPPIOCGUNIT' type-id='type-id-211' mangled-name='_ZN11__sanitizer17IOCTL_PPPIOCGUNITE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='475' column='1'/>
      <var-decl name='IOCTL_PPPIOCGXASYNCMAP' type-id='type-id-211' mangled-name='_ZN11__sanitizer22IOCTL_PPPIOCGXASYNCMAPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='476' column='1'/>
      <var-decl name='IOCTL_PPPIOCSASYNCMAP' type-id='type-id-211' mangled-name='_ZN11__sanitizer21IOCTL_PPPIOCSASYNCMAPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='477' column='1'/>
      <var-decl name='IOCTL_PPPIOCSDEBUG' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_PPPIOCSDEBUGE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='478' column='1'/>
      <var-decl name='IOCTL_PPPIOCSFLAGS' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_PPPIOCSFLAGSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='479' column='1'/>
      <var-decl name='IOCTL_PPPIOCSMAXCID' type-id='type-id-211' mangled-name='_ZN11__sanitizer19IOCTL_PPPIOCSMAXCIDE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='480' column='1'/>
      <var-decl name='IOCTL_PPPIOCSMRU' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_PPPIOCSMRUE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='481' column='1'/>
      <var-decl name='IOCTL_PPPIOCSXASYNCMAP' type-id='type-id-211' mangled-name='_ZN11__sanitizer22IOCTL_PPPIOCSXASYNCMAPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='482' column='1'/>
      <var-decl name='IOCTL_SIOCADDRT' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_SIOCADDRTE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='483' column='1'/>
      <var-decl name='IOCTL_SIOCDARP' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_SIOCDARPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='484' column='1'/>
      <var-decl name='IOCTL_SIOCDELRT' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_SIOCDELRTE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='485' column='1'/>
      <var-decl name='IOCTL_SIOCDRARP' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_SIOCDRARPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='486' column='1'/>
      <var-decl name='IOCTL_SIOCGARP' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_SIOCGARPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='487' column='1'/>
      <var-decl name='IOCTL_SIOCGIFENCAP' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_SIOCGIFENCAPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='488' column='1'/>
      <var-decl name='IOCTL_SIOCGIFHWADDR' type-id='type-id-211' mangled-name='_ZN11__sanitizer19IOCTL_SIOCGIFHWADDRE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='489' column='1'/>
      <var-decl name='IOCTL_SIOCGIFMAP' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_SIOCGIFMAPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='490' column='1'/>
      <var-decl name='IOCTL_SIOCGIFMEM' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_SIOCGIFMEME' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='491' column='1'/>
      <var-decl name='IOCTL_SIOCGIFNAME' type-id='type-id-211' mangled-name='_ZN11__sanitizer17IOCTL_SIOCGIFNAMEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='492' column='1'/>
      <var-decl name='IOCTL_SIOCGIFSLAVE' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_SIOCGIFSLAVEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='493' column='1'/>
      <var-decl name='IOCTL_SIOCGRARP' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_SIOCGRARPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='494' column='1'/>
      <var-decl name='IOCTL_SIOCGSTAMP' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_SIOCGSTAMPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='495' column='1'/>
      <var-decl name='IOCTL_SIOCSARP' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_SIOCSARPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='496' column='1'/>
      <var-decl name='IOCTL_SIOCSIFENCAP' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_SIOCSIFENCAPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='497' column='1'/>
      <var-decl name='IOCTL_SIOCSIFHWADDR' type-id='type-id-211' mangled-name='_ZN11__sanitizer19IOCTL_SIOCSIFHWADDRE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='498' column='1'/>
      <var-decl name='IOCTL_SIOCSIFLINK' type-id='type-id-211' mangled-name='_ZN11__sanitizer17IOCTL_SIOCSIFLINKE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='499' column='1'/>
      <var-decl name='IOCTL_SIOCSIFMAP' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_SIOCSIFMAPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='500' column='1'/>
      <var-decl name='IOCTL_SIOCSIFMEM' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_SIOCSIFMEME' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='501' column='1'/>
      <var-decl name='IOCTL_SIOCSIFSLAVE' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_SIOCSIFSLAVEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='502' column='1'/>
      <var-decl name='IOCTL_SIOCSRARP' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_SIOCSRARPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='503' column='1'/>
      <var-decl name='IOCTL_SNDCTL_COPR_HALT' type-id='type-id-211' mangled-name='_ZN11__sanitizer22IOCTL_SNDCTL_COPR_HALTE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='522' column='1'/>
      <var-decl name='IOCTL_SNDCTL_COPR_LOAD' type-id='type-id-211' mangled-name='_ZN11__sanitizer22IOCTL_SNDCTL_COPR_LOADE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='523' column='1'/>
      <var-decl name='IOCTL_SNDCTL_COPR_RCODE' type-id='type-id-211' mangled-name='_ZN11__sanitizer23IOCTL_SNDCTL_COPR_RCODEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='524' column='1'/>
      <var-decl name='IOCTL_SNDCTL_COPR_RCVMSG' type-id='type-id-211' mangled-name='_ZN11__sanitizer24IOCTL_SNDCTL_COPR_RCVMSGE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='525' column='1'/>
      <var-decl name='IOCTL_SNDCTL_COPR_RDATA' type-id='type-id-211' mangled-name='_ZN11__sanitizer23IOCTL_SNDCTL_COPR_RDATAE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='526' column='1'/>
      <var-decl name='IOCTL_SNDCTL_COPR_RESET' type-id='type-id-211' mangled-name='_ZN11__sanitizer23IOCTL_SNDCTL_COPR_RESETE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='527' column='1'/>
      <var-decl name='IOCTL_SNDCTL_COPR_RUN' type-id='type-id-211' mangled-name='_ZN11__sanitizer21IOCTL_SNDCTL_COPR_RUNE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='528' column='1'/>
      <var-decl name='IOCTL_SNDCTL_COPR_SENDMSG' type-id='type-id-211' mangled-name='_ZN11__sanitizer25IOCTL_SNDCTL_COPR_SENDMSGE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='529' column='1'/>
      <var-decl name='IOCTL_SNDCTL_COPR_WCODE' type-id='type-id-211' mangled-name='_ZN11__sanitizer23IOCTL_SNDCTL_COPR_WCODEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='530' column='1'/>
      <var-decl name='IOCTL_SNDCTL_COPR_WDATA' type-id='type-id-211' mangled-name='_ZN11__sanitizer23IOCTL_SNDCTL_COPR_WDATAE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='531' column='1'/>
      <var-decl name='IOCTL_SNDCTL_DSP_GETBLKSIZE' type-id='type-id-211' mangled-name='_ZN11__sanitizer27IOCTL_SNDCTL_DSP_GETBLKSIZEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='539' column='1'/>
      <var-decl name='IOCTL_SNDCTL_DSP_GETFMTS' type-id='type-id-211' mangled-name='_ZN11__sanitizer24IOCTL_SNDCTL_DSP_GETFMTSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='540' column='1'/>
      <var-decl name='IOCTL_SNDCTL_DSP_NONBLOCK' type-id='type-id-211' mangled-name='_ZN11__sanitizer25IOCTL_SNDCTL_DSP_NONBLOCKE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='541' column='1'/>
      <var-decl name='IOCTL_SNDCTL_DSP_POST' type-id='type-id-211' mangled-name='_ZN11__sanitizer21IOCTL_SNDCTL_DSP_POSTE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='542' column='1'/>
      <var-decl name='IOCTL_SNDCTL_DSP_RESET' type-id='type-id-211' mangled-name='_ZN11__sanitizer22IOCTL_SNDCTL_DSP_RESETE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='543' column='1'/>
      <var-decl name='IOCTL_SNDCTL_DSP_SETFMT' type-id='type-id-211' mangled-name='_ZN11__sanitizer23IOCTL_SNDCTL_DSP_SETFMTE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='544' column='1'/>
      <var-decl name='IOCTL_SNDCTL_DSP_SETFRAGMENT' type-id='type-id-211' mangled-name='_ZN11__sanitizer28IOCTL_SNDCTL_DSP_SETFRAGMENTE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='545' column='1'/>
      <var-decl name='IOCTL_SNDCTL_DSP_SPEED' type-id='type-id-211' mangled-name='_ZN11__sanitizer22IOCTL_SNDCTL_DSP_SPEEDE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='546' column='1'/>
      <var-decl name='IOCTL_SNDCTL_DSP_STEREO' type-id='type-id-211' mangled-name='_ZN11__sanitizer23IOCTL_SNDCTL_DSP_STEREOE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='547' column='1'/>
      <var-decl name='IOCTL_SNDCTL_DSP_SUBDIVIDE' type-id='type-id-211' mangled-name='_ZN11__sanitizer26IOCTL_SNDCTL_DSP_SUBDIVIDEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='548' column='1'/>
      <var-decl name='IOCTL_SNDCTL_DSP_SYNC' type-id='type-id-211' mangled-name='_ZN11__sanitizer21IOCTL_SNDCTL_DSP_SYNCE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='549' column='1'/>
      <var-decl name='IOCTL_SNDCTL_FM_4OP_ENABLE' type-id='type-id-211' mangled-name='_ZN11__sanitizer26IOCTL_SNDCTL_FM_4OP_ENABLEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='550' column='1'/>
      <var-decl name='IOCTL_SNDCTL_FM_LOAD_INSTR' type-id='type-id-211' mangled-name='_ZN11__sanitizer26IOCTL_SNDCTL_FM_LOAD_INSTRE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='551' column='1'/>
      <var-decl name='IOCTL_SNDCTL_MIDI_INFO' type-id='type-id-211' mangled-name='_ZN11__sanitizer22IOCTL_SNDCTL_MIDI_INFOE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='552' column='1'/>
      <var-decl name='IOCTL_SNDCTL_MIDI_PRETIME' type-id='type-id-211' mangled-name='_ZN11__sanitizer25IOCTL_SNDCTL_MIDI_PRETIMEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='553' column='1'/>
      <var-decl name='IOCTL_SNDCTL_SEQ_CTRLRATE' type-id='type-id-211' mangled-name='_ZN11__sanitizer25IOCTL_SNDCTL_SEQ_CTRLRATEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='554' column='1'/>
      <var-decl name='IOCTL_SNDCTL_SEQ_GETINCOUNT' type-id='type-id-211' mangled-name='_ZN11__sanitizer27IOCTL_SNDCTL_SEQ_GETINCOUNTE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='555' column='1'/>
      <var-decl name='IOCTL_SNDCTL_SEQ_GETOUTCOUNT' type-id='type-id-211' mangled-name='_ZN11__sanitizer28IOCTL_SNDCTL_SEQ_GETOUTCOUNTE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='556' column='1'/>
      <var-decl name='IOCTL_SNDCTL_SEQ_NRMIDIS' type-id='type-id-211' mangled-name='_ZN11__sanitizer24IOCTL_SNDCTL_SEQ_NRMIDISE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='557' column='1'/>
      <var-decl name='IOCTL_SNDCTL_SEQ_NRSYNTHS' type-id='type-id-211' mangled-name='_ZN11__sanitizer25IOCTL_SNDCTL_SEQ_NRSYNTHSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='558' column='1'/>
      <var-decl name='IOCTL_SNDCTL_SEQ_OUTOFBAND' type-id='type-id-211' mangled-name='_ZN11__sanitizer26IOCTL_SNDCTL_SEQ_OUTOFBANDE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='559' column='1'/>
      <var-decl name='IOCTL_SNDCTL_SEQ_PANIC' type-id='type-id-211' mangled-name='_ZN11__sanitizer22IOCTL_SNDCTL_SEQ_PANICE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='560' column='1'/>
      <var-decl name='IOCTL_SNDCTL_SEQ_PERCMODE' type-id='type-id-211' mangled-name='_ZN11__sanitizer25IOCTL_SNDCTL_SEQ_PERCMODEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='561' column='1'/>
      <var-decl name='IOCTL_SNDCTL_SEQ_RESET' type-id='type-id-211' mangled-name='_ZN11__sanitizer22IOCTL_SNDCTL_SEQ_RESETE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='562' column='1'/>
      <var-decl name='IOCTL_SNDCTL_SEQ_RESETSAMPLES' type-id='type-id-211' mangled-name='_ZN11__sanitizer29IOCTL_SNDCTL_SEQ_RESETSAMPLESE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='563' column='1'/>
      <var-decl name='IOCTL_SNDCTL_SEQ_SYNC' type-id='type-id-211' mangled-name='_ZN11__sanitizer21IOCTL_SNDCTL_SEQ_SYNCE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='564' column='1'/>
      <var-decl name='IOCTL_SNDCTL_SEQ_TESTMIDI' type-id='type-id-211' mangled-name='_ZN11__sanitizer25IOCTL_SNDCTL_SEQ_TESTMIDIE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='565' column='1'/>
      <var-decl name='IOCTL_SNDCTL_SEQ_THRESHOLD' type-id='type-id-211' mangled-name='_ZN11__sanitizer26IOCTL_SNDCTL_SEQ_THRESHOLDE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='566' column='1'/>
      <var-decl name='IOCTL_SNDCTL_SYNTH_INFO' type-id='type-id-211' mangled-name='_ZN11__sanitizer23IOCTL_SNDCTL_SYNTH_INFOE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='567' column='1'/>
      <var-decl name='IOCTL_SNDCTL_SYNTH_MEMAVL' type-id='type-id-211' mangled-name='_ZN11__sanitizer25IOCTL_SNDCTL_SYNTH_MEMAVLE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='568' column='1'/>
      <var-decl name='IOCTL_SNDCTL_TMR_CONTINUE' type-id='type-id-211' mangled-name='_ZN11__sanitizer25IOCTL_SNDCTL_TMR_CONTINUEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='569' column='1'/>
      <var-decl name='IOCTL_SNDCTL_TMR_METRONOME' type-id='type-id-211' mangled-name='_ZN11__sanitizer26IOCTL_SNDCTL_TMR_METRONOMEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='570' column='1'/>
      <var-decl name='IOCTL_SNDCTL_TMR_SELECT' type-id='type-id-211' mangled-name='_ZN11__sanitizer23IOCTL_SNDCTL_TMR_SELECTE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='571' column='1'/>
      <var-decl name='IOCTL_SNDCTL_TMR_SOURCE' type-id='type-id-211' mangled-name='_ZN11__sanitizer23IOCTL_SNDCTL_TMR_SOURCEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='572' column='1'/>
      <var-decl name='IOCTL_SNDCTL_TMR_START' type-id='type-id-211' mangled-name='_ZN11__sanitizer22IOCTL_SNDCTL_TMR_STARTE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='573' column='1'/>
      <var-decl name='IOCTL_SNDCTL_TMR_STOP' type-id='type-id-211' mangled-name='_ZN11__sanitizer21IOCTL_SNDCTL_TMR_STOPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='574' column='1'/>
      <var-decl name='IOCTL_SNDCTL_TMR_TEMPO' type-id='type-id-211' mangled-name='_ZN11__sanitizer22IOCTL_SNDCTL_TMR_TEMPOE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='575' column='1'/>
      <var-decl name='IOCTL_SNDCTL_TMR_TIMEBASE' type-id='type-id-211' mangled-name='_ZN11__sanitizer25IOCTL_SNDCTL_TMR_TIMEBASEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='576' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_ALTPCM' type-id='type-id-211' mangled-name='_ZN11__sanitizer29IOCTL_SOUND_MIXER_READ_ALTPCME' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='577' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_BASS' type-id='type-id-211' mangled-name='_ZN11__sanitizer27IOCTL_SOUND_MIXER_READ_BASSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='578' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_CAPS' type-id='type-id-211' mangled-name='_ZN11__sanitizer27IOCTL_SOUND_MIXER_READ_CAPSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='579' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_CD' type-id='type-id-211' mangled-name='_ZN11__sanitizer25IOCTL_SOUND_MIXER_READ_CDE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='580' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_DEVMASK' type-id='type-id-211' mangled-name='_ZN11__sanitizer30IOCTL_SOUND_MIXER_READ_DEVMASKE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='581' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_ENHANCE' type-id='type-id-211' mangled-name='_ZN11__sanitizer30IOCTL_SOUND_MIXER_READ_ENHANCEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='582' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_IGAIN' type-id='type-id-211' mangled-name='_ZN11__sanitizer28IOCTL_SOUND_MIXER_READ_IGAINE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='583' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_IMIX' type-id='type-id-211' mangled-name='_ZN11__sanitizer27IOCTL_SOUND_MIXER_READ_IMIXE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='584' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_LINE1' type-id='type-id-211' mangled-name='_ZN11__sanitizer28IOCTL_SOUND_MIXER_READ_LINE1E' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='586' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_LINE2' type-id='type-id-211' mangled-name='_ZN11__sanitizer28IOCTL_SOUND_MIXER_READ_LINE2E' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='587' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_LINE3' type-id='type-id-211' mangled-name='_ZN11__sanitizer28IOCTL_SOUND_MIXER_READ_LINE3E' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='588' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_LINE' type-id='type-id-211' mangled-name='_ZN11__sanitizer27IOCTL_SOUND_MIXER_READ_LINEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='585' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_LOUD' type-id='type-id-211' mangled-name='_ZN11__sanitizer27IOCTL_SOUND_MIXER_READ_LOUDE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='589' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_MIC' type-id='type-id-211' mangled-name='_ZN11__sanitizer26IOCTL_SOUND_MIXER_READ_MICE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='590' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_MUTE' type-id='type-id-211' mangled-name='_ZN11__sanitizer27IOCTL_SOUND_MIXER_READ_MUTEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='591' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_OGAIN' type-id='type-id-211' mangled-name='_ZN11__sanitizer28IOCTL_SOUND_MIXER_READ_OGAINE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='592' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_PCM' type-id='type-id-211' mangled-name='_ZN11__sanitizer26IOCTL_SOUND_MIXER_READ_PCME' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='593' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_RECLEV' type-id='type-id-211' mangled-name='_ZN11__sanitizer29IOCTL_SOUND_MIXER_READ_RECLEVE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='594' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_RECMASK' type-id='type-id-211' mangled-name='_ZN11__sanitizer30IOCTL_SOUND_MIXER_READ_RECMASKE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='595' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_RECSRC' type-id='type-id-211' mangled-name='_ZN11__sanitizer29IOCTL_SOUND_MIXER_READ_RECSRCE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='596' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_SPEAKER' type-id='type-id-211' mangled-name='_ZN11__sanitizer30IOCTL_SOUND_MIXER_READ_SPEAKERE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='597' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_STEREODEVS' type-id='type-id-211' mangled-name='_ZN11__sanitizer33IOCTL_SOUND_MIXER_READ_STEREODEVSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='598' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_SYNTH' type-id='type-id-211' mangled-name='_ZN11__sanitizer28IOCTL_SOUND_MIXER_READ_SYNTHE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='599' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_TREBLE' type-id='type-id-211' mangled-name='_ZN11__sanitizer29IOCTL_SOUND_MIXER_READ_TREBLEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='600' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_READ_VOLUME' type-id='type-id-211' mangled-name='_ZN11__sanitizer29IOCTL_SOUND_MIXER_READ_VOLUMEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='601' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_WRITE_ALTPCM' type-id='type-id-211' mangled-name='_ZN11__sanitizer30IOCTL_SOUND_MIXER_WRITE_ALTPCME' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='602' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_WRITE_BASS' type-id='type-id-211' mangled-name='_ZN11__sanitizer28IOCTL_SOUND_MIXER_WRITE_BASSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='603' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_WRITE_CD' type-id='type-id-211' mangled-name='_ZN11__sanitizer26IOCTL_SOUND_MIXER_WRITE_CDE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='604' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_WRITE_ENHANCE' type-id='type-id-211' mangled-name='_ZN11__sanitizer31IOCTL_SOUND_MIXER_WRITE_ENHANCEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='605' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_WRITE_IGAIN' type-id='type-id-211' mangled-name='_ZN11__sanitizer29IOCTL_SOUND_MIXER_WRITE_IGAINE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='606' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_WRITE_IMIX' type-id='type-id-211' mangled-name='_ZN11__sanitizer28IOCTL_SOUND_MIXER_WRITE_IMIXE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='607' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_WRITE_LINE1' type-id='type-id-211' mangled-name='_ZN11__sanitizer29IOCTL_SOUND_MIXER_WRITE_LINE1E' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='609' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_WRITE_LINE2' type-id='type-id-211' mangled-name='_ZN11__sanitizer29IOCTL_SOUND_MIXER_WRITE_LINE2E' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='610' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_WRITE_LINE3' type-id='type-id-211' mangled-name='_ZN11__sanitizer29IOCTL_SOUND_MIXER_WRITE_LINE3E' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='611' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_WRITE_LINE' type-id='type-id-211' mangled-name='_ZN11__sanitizer28IOCTL_SOUND_MIXER_WRITE_LINEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='608' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_WRITE_LOUD' type-id='type-id-211' mangled-name='_ZN11__sanitizer28IOCTL_SOUND_MIXER_WRITE_LOUDE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='612' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_WRITE_MIC' type-id='type-id-211' mangled-name='_ZN11__sanitizer27IOCTL_SOUND_MIXER_WRITE_MICE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='613' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_WRITE_MUTE' type-id='type-id-211' mangled-name='_ZN11__sanitizer28IOCTL_SOUND_MIXER_WRITE_MUTEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='614' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_WRITE_OGAIN' type-id='type-id-211' mangled-name='_ZN11__sanitizer29IOCTL_SOUND_MIXER_WRITE_OGAINE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='615' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_WRITE_PCM' type-id='type-id-211' mangled-name='_ZN11__sanitizer27IOCTL_SOUND_MIXER_WRITE_PCME' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='616' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_WRITE_RECLEV' type-id='type-id-211' mangled-name='_ZN11__sanitizer30IOCTL_SOUND_MIXER_WRITE_RECLEVE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='617' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_WRITE_RECSRC' type-id='type-id-211' mangled-name='_ZN11__sanitizer30IOCTL_SOUND_MIXER_WRITE_RECSRCE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='618' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_WRITE_SPEAKER' type-id='type-id-211' mangled-name='_ZN11__sanitizer31IOCTL_SOUND_MIXER_WRITE_SPEAKERE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='619' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_WRITE_SYNTH' type-id='type-id-211' mangled-name='_ZN11__sanitizer29IOCTL_SOUND_MIXER_WRITE_SYNTHE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='620' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_WRITE_TREBLE' type-id='type-id-211' mangled-name='_ZN11__sanitizer30IOCTL_SOUND_MIXER_WRITE_TREBLEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='621' column='1'/>
      <var-decl name='IOCTL_SOUND_MIXER_WRITE_VOLUME' type-id='type-id-211' mangled-name='_ZN11__sanitizer30IOCTL_SOUND_MIXER_WRITE_VOLUMEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='622' column='1'/>
      <var-decl name='IOCTL_SOUND_PCM_READ_BITS' type-id='type-id-211' mangled-name='_ZN11__sanitizer25IOCTL_SOUND_PCM_READ_BITSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='532' column='1'/>
      <var-decl name='IOCTL_SOUND_PCM_READ_CHANNELS' type-id='type-id-211' mangled-name='_ZN11__sanitizer29IOCTL_SOUND_PCM_READ_CHANNELSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='533' column='1'/>
      <var-decl name='IOCTL_SOUND_PCM_READ_FILTER' type-id='type-id-211' mangled-name='_ZN11__sanitizer27IOCTL_SOUND_PCM_READ_FILTERE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='534' column='1'/>
      <var-decl name='IOCTL_SOUND_PCM_READ_RATE' type-id='type-id-211' mangled-name='_ZN11__sanitizer25IOCTL_SOUND_PCM_READ_RATEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='535' column='1'/>
      <var-decl name='IOCTL_SOUND_PCM_WRITE_CHANNELS' type-id='type-id-211' mangled-name='_ZN11__sanitizer30IOCTL_SOUND_PCM_WRITE_CHANNELSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='536' column='1'/>
      <var-decl name='IOCTL_SOUND_PCM_WRITE_FILTER' type-id='type-id-211' mangled-name='_ZN11__sanitizer28IOCTL_SOUND_PCM_WRITE_FILTERE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='537' column='1'/>
      <var-decl name='IOCTL_TCFLSH' type-id='type-id-211' mangled-name='_ZN11__sanitizer12IOCTL_TCFLSHE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='623' column='1'/>
      <var-decl name='IOCTL_TCGETA' type-id='type-id-211' mangled-name='_ZN11__sanitizer12IOCTL_TCGETAE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='624' column='1'/>
      <var-decl name='IOCTL_TCGETS' type-id='type-id-211' mangled-name='_ZN11__sanitizer12IOCTL_TCGETSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='625' column='1'/>
      <var-decl name='IOCTL_TCSBRK' type-id='type-id-211' mangled-name='_ZN11__sanitizer12IOCTL_TCSBRKE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='626' column='1'/>
      <var-decl name='IOCTL_TCSBRKP' type-id='type-id-211' mangled-name='_ZN11__sanitizer13IOCTL_TCSBRKPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='627' column='1'/>
      <var-decl name='IOCTL_TCSETA' type-id='type-id-211' mangled-name='_ZN11__sanitizer12IOCTL_TCSETAE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='628' column='1'/>
      <var-decl name='IOCTL_TCSETAF' type-id='type-id-211' mangled-name='_ZN11__sanitizer13IOCTL_TCSETAFE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='629' column='1'/>
      <var-decl name='IOCTL_TCSETAW' type-id='type-id-211' mangled-name='_ZN11__sanitizer13IOCTL_TCSETAWE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='630' column='1'/>
      <var-decl name='IOCTL_TCSETS' type-id='type-id-211' mangled-name='_ZN11__sanitizer12IOCTL_TCSETSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='631' column='1'/>
      <var-decl name='IOCTL_TCSETSF' type-id='type-id-211' mangled-name='_ZN11__sanitizer13IOCTL_TCSETSFE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='632' column='1'/>
      <var-decl name='IOCTL_TCSETSW' type-id='type-id-211' mangled-name='_ZN11__sanitizer13IOCTL_TCSETSWE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='633' column='1'/>
      <var-decl name='IOCTL_TCXONC' type-id='type-id-211' mangled-name='_ZN11__sanitizer12IOCTL_TCXONCE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='634' column='1'/>
      <var-decl name='IOCTL_TIOCGLCKTRMIOS' type-id='type-id-211' mangled-name='_ZN11__sanitizer20IOCTL_TIOCGLCKTRMIOSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='635' column='1'/>
      <var-decl name='IOCTL_TIOCGSOFTCAR' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_TIOCGSOFTCARE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='636' column='1'/>
      <var-decl name='IOCTL_TIOCINQ' type-id='type-id-211' mangled-name='_ZN11__sanitizer13IOCTL_TIOCINQE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='637' column='1'/>
      <var-decl name='IOCTL_TIOCLINUX' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_TIOCLINUXE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='638' column='1'/>
      <var-decl name='IOCTL_TIOCSERCONFIG' type-id='type-id-211' mangled-name='_ZN11__sanitizer19IOCTL_TIOCSERCONFIGE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='639' column='1'/>
      <var-decl name='IOCTL_TIOCSERGETLSR' type-id='type-id-211' mangled-name='_ZN11__sanitizer19IOCTL_TIOCSERGETLSRE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='640' column='1'/>
      <var-decl name='IOCTL_TIOCSERGWILD' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_TIOCSERGWILDE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='641' column='1'/>
      <var-decl name='IOCTL_TIOCSERSWILD' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_TIOCSERSWILDE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='642' column='1'/>
      <var-decl name='IOCTL_TIOCSLCKTRMIOS' type-id='type-id-211' mangled-name='_ZN11__sanitizer20IOCTL_TIOCSLCKTRMIOSE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='643' column='1'/>
      <var-decl name='IOCTL_TIOCSSOFTCAR' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_TIOCSSOFTCARE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='644' column='1'/>
      <var-decl name='IOCTL_VT_ACTIVATE' type-id='type-id-211' mangled-name='_ZN11__sanitizer17IOCTL_VT_ACTIVATEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='645' column='1'/>
      <var-decl name='IOCTL_VT_DISALLOCATE' type-id='type-id-211' mangled-name='_ZN11__sanitizer20IOCTL_VT_DISALLOCATEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='646' column='1'/>
      <var-decl name='IOCTL_VT_GETMODE' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_VT_GETMODEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='647' column='1'/>
      <var-decl name='IOCTL_VT_GETSTATE' type-id='type-id-211' mangled-name='_ZN11__sanitizer17IOCTL_VT_GETSTATEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='648' column='1'/>
      <var-decl name='IOCTL_VT_OPENQRY' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_VT_OPENQRYE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='649' column='1'/>
      <var-decl name='IOCTL_VT_RELDISP' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_VT_RELDISPE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='650' column='1'/>
      <var-decl name='IOCTL_VT_RESIZE' type-id='type-id-211' mangled-name='_ZN11__sanitizer15IOCTL_VT_RESIZEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='651' column='1'/>
      <var-decl name='IOCTL_VT_RESIZEX' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_VT_RESIZEXE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='652' column='1'/>
      <var-decl name='IOCTL_VT_SENDSIG' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_VT_SENDSIGE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='653' column='1'/>
      <var-decl name='IOCTL_VT_SETMODE' type-id='type-id-211' mangled-name='_ZN11__sanitizer16IOCTL_VT_SETMODEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='654' column='1'/>
      <var-decl name='IOCTL_VT_WAITACTIVE' type-id='type-id-211' mangled-name='_ZN11__sanitizer19IOCTL_VT_WAITACTIVEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='655' column='1'/>
      <var-decl name='IOCTL_CYGETDEFTHRESH' type-id='type-id-211' mangled-name='_ZN11__sanitizer20IOCTL_CYGETDEFTHRESHE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='658' column='1'/>
      <var-decl name='IOCTL_CYGETDEFTIMEOUT' type-id='type-id-211' mangled-name='_ZN11__sanitizer21IOCTL_CYGETDEFTIMEOUTE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='659' column='1'/>
      <var-decl name='IOCTL_CYGETMON' type-id='type-id-211' mangled-name='_ZN11__sanitizer14IOCTL_CYGETMONE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='660' column='1'/>
      <var-decl name='IOCTL_CYGETTHRESH' type-id='type-id-211' mangled-name='_ZN11__sanitizer17IOCTL_CYGETTHRESHE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='661' column='1'/>
      <var-decl name='IOCTL_CYGETTIMEOUT' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_CYGETTIMEOUTE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='662' column='1'/>
      <var-decl name='IOCTL_CYSETDEFTHRESH' type-id='type-id-211' mangled-name='_ZN11__sanitizer20IOCTL_CYSETDEFTHRESHE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='663' column='1'/>
      <var-decl name='IOCTL_CYSETDEFTIMEOUT' type-id='type-id-211' mangled-name='_ZN11__sanitizer21IOCTL_CYSETDEFTIMEOUTE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='664' column='1'/>
      <var-decl name='IOCTL_CYSETTHRESH' type-id='type-id-211' mangled-name='_ZN11__sanitizer17IOCTL_CYSETTHRESHE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='665' column='1'/>
      <var-decl name='IOCTL_CYSETTIMEOUT' type-id='type-id-211' mangled-name='_ZN11__sanitizer18IOCTL_CYSETTIMEOUTE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='666' column='1'/>
      <var-decl name='IOCTL_EQL_EMANCIPATE' type-id='type-id-211' mangled-name='_ZN11__sanitizer20IOCTL_EQL_EMANCIPATEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='667' column='1'/>
      <var-decl name='IOCTL_EQL_ENSLAVE' type-id='type-id-211' mangled-name='_ZN11__sanitizer17IOCTL_EQL_ENSLAVEE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='668' column='1'/>
      <var-decl name='IOCTL_EQL_GETMASTRCFG' type-id='type-id-211' mangled-name='_ZN11__sanitizer21IOCTL_EQL_GETMASTRCFGE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='669' column='1'/>
      <var-decl name='IOCTL_EQL_GETSLAVECFG' type-id='type-id-211' mangled-name='_ZN11__sanitizer21IOCTL_EQL_GETSLAVECFGE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='670' column='1'/>
      <var-decl name='IOCTL_EQL_SETMASTRCFG' type-id='type-id-211' mangled-name='_ZN11__sanitizer21IOCTL_EQL_SETMASTRCFGE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='671' column='1'/>
      <var-decl name='IOCTL_EQL_SETSLAVECFG' type-id='type-id-211' mangled-name='_ZN11__sanitizer21IOCTL_EQL_SETSLAVECFGE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='672' column='1'/>
