#ifndef HIDL_GENERATED_ANDROID_HARDWARE_AUDIO_EFFECT_V6_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_AUDIO_EFFECT_V6_0_TYPES_H

#include <android/hardware/audio/common/6.0/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace audio {
namespace effect {
namespace V6_0 {

// Forward declaration for forward reference support:
enum class Result : int32_t;
enum class EffectFlags : int32_t;
struct EffectDescriptor;
struct AudioBuffer;
enum class EffectBufferAccess : int32_t;
enum class EffectConfigParameters : int32_t;
struct EffectBufferConfig;
struct EffectConfig;
enum class EffectFeature : int32_t;
struct EffectAuxChannelsConfig;
struct EffectOffloadParameter;
enum class MessageQueueFlagBits : uint32_t;

enum class Result : int32_t {
    OK = 0,
    NOT_INITIALIZED = 1 /* ::android::hardware::audio::effect::V6_0::Result.OK implicitly + 1 */,
    INVALID_ARGUMENTS = 2 /* ::android::hardware::audio::effect::V6_0::Result.NOT_INITIALIZED implicitly + 1 */,
    INVALID_STATE = 3 /* ::android::hardware::audio::effect::V6_0::Result.INVALID_ARGUMENTS implicitly + 1 */,
    NOT_SUPPORTED = 4 /* ::android::hardware::audio::effect::V6_0::Result.INVALID_STATE implicitly + 1 */,
    RESULT_TOO_BIG = 5 /* ::android::hardware::audio::effect::V6_0::Result.NOT_SUPPORTED implicitly + 1 */,
};

/**
 * Effect engine capabilities/requirements flags.
 *
 * Definitions for flags field of effect descriptor.
 *
 * +----------------+--------+--------------------------------------------------
 * | description    | bits   | values
 * +----------------+--------+--------------------------------------------------
 * | connection     | 0..2   | 0 insert: after track process
 * | mode           |        | 1 auxiliary: connect to track auxiliary
 * |                |        |  output and use send level
 * |                |        | 2 replace: replaces track process function;
 * |                |        |   must implement SRC, volume and mono to stereo.
 * |                |        | 3 pre processing: applied below audio HAL on in
 * |                |        | 4 post processing: applied below audio HAL on out
 * |                |        | 5 - 7 reserved
 * +----------------+--------+--------------------------------------------------
 * | insertion      | 3..5   | 0 none
 * | preference     |        | 1 first of the chain
 * |                |        | 2 last of the chain
 * |                |        | 3 exclusive (only effect in the insert chain)
 * |                |        | 4..7 reserved
 * +----------------+--------+--------------------------------------------------
 * | Volume         | 6..8   | 0 none
 * | management     |        | 1 implements volume control
 * |                |        | 2 requires volume indication
 * |                |        | 3 monitors requested volume
 * |                |        | 4 reserved
 * +----------------+--------+--------------------------------------------------
 * | Device         | 9..11  | 0 none
 * | indication     |        | 1 requires device updates
 * |                |        | 2, 4 reserved
 * +----------------+--------+--------------------------------------------------
 * | Sample input   | 12..13 | 1 direct: process() function or
 * | mode           |        |   EFFECT_CMD_SET_CONFIG command must specify
 * |                |        |   a buffer descriptor
 * |                |        | 2 provider: process() function uses the
 * |                |        |   bufferProvider indicated by the
 * |                |        |   EFFECT_CMD_SET_CONFIG command to request input.
 * |                |        |   buffers.
 * |                |        | 3 both: both input modes are supported
 * +----------------+--------+--------------------------------------------------
 * | Sample output  | 14..15 | 1 direct: process() function or
 * | mode           |        |   EFFECT_CMD_SET_CONFIG command must specify
 * |                |        |   a buffer descriptor
 * |                |        | 2 provider: process() function uses the
 * |                |        |   bufferProvider indicated by the
 * |                |        |   EFFECT_CMD_SET_CONFIG command to request output
 * |                |        |   buffers.
 * |                |        | 3 both: both output modes are supported
 * +----------------+--------+--------------------------------------------------
 * | Hardware       | 16..17 | 0 No hardware acceleration
 * | acceleration   |        | 1 non tunneled hw acceleration: the process()
 * |                |        |   function reads the samples, send them to HW
 * |                |        |   accelerated effect processor, reads back
 * |                |        |   the processed samples and returns them
 * |                |        |   to the output buffer.
 * |                |        | 2 tunneled hw acceleration: the process()
 * |                |        |   function is transparent. The effect interface
 * |                |        |   is only used to control the effect engine.
 * |                |        |   This mode is relevant for global effects
 * |                |        |   actually applied by the audio hardware on
 * |                |        |   the output stream.
 * +----------------+--------+--------------------------------------------------
 * | Audio Mode     | 18..19 | 0 none
 * | indication     |        | 1 requires audio mode updates
 * |                |        | 2..3 reserved
 * +----------------+--------+--------------------------------------------------
 * | Audio source   | 20..21 | 0 none
 * | indication     |        | 1 requires audio source updates
 * |                |        | 2..3 reserved
 * +----------------+--------+--------------------------------------------------
 * | Effect offload | 22     | 0 The effect cannot be offloaded to an audio DSP
 * | supported      |        | 1 The effect can be offloaded to an audio DSP
 * +----------------+--------+--------------------------------------------------
 * | Process        | 23     | 0 The effect implements a process function.
 * | function       |        | 1 The effect does not implement a process
 * | not            |        |   function: enabling the effect has no impact
 * | implemented    |        |   on latency or CPU load.
 * |                |        |   Effect implementations setting this flag do not
 * |                |        |   have to implement a process function.
 * +----------------+--------+--------------------------------------------------
 */
enum class EffectFlags : int32_t {
    TYPE_SHIFT = 0,
    TYPE_SIZE = 3,
    TYPE_MASK = 7 /* ((1 << TYPE_SIZE) - 1) << TYPE_SHIFT */,
    TYPE_INSERT = 0 /* 0 << TYPE_SHIFT */,
    TYPE_AUXILIARY = 1 /* 1 << TYPE_SHIFT */,
    TYPE_REPLACE = 2 /* 2 << TYPE_SHIFT */,
    TYPE_PRE_PROC = 3 /* 3 << TYPE_SHIFT */,
    TYPE_POST_PROC = 4 /* 4 << TYPE_SHIFT */,
    INSERT_SHIFT = 3 /* TYPE_SHIFT + TYPE_SIZE */,
    INSERT_SIZE = 3,
    INSERT_MASK = 56 /* ((1 << INSERT_SIZE) - 1) << INSERT_SHIFT */,
    INSERT_ANY = 0 /* 0 << INSERT_SHIFT */,
    INSERT_FIRST = 8 /* 1 << INSERT_SHIFT */,
    INSERT_LAST = 16 /* 2 << INSERT_SHIFT */,
    INSERT_EXCLUSIVE = 24 /* 3 << INSERT_SHIFT */,
    VOLUME_SHIFT = 6 /* INSERT_SHIFT + INSERT_SIZE */,
    VOLUME_SIZE = 3,
    VOLUME_MASK = 448 /* ((1 << VOLUME_SIZE) - 1) << VOLUME_SHIFT */,
    VOLUME_CTRL = 64 /* 1 << VOLUME_SHIFT */,
    VOLUME_IND = 128 /* 2 << VOLUME_SHIFT */,
    VOLUME_MONITOR = 192 /* 3 << VOLUME_SHIFT */,
    VOLUME_NONE = 0 /* 0 << VOLUME_SHIFT */,
    DEVICE_SHIFT = 9 /* VOLUME_SHIFT + VOLUME_SIZE */,
    DEVICE_SIZE = 3,
    DEVICE_MASK = 3584 /* ((1 << DEVICE_SIZE) - 1) << DEVICE_SHIFT */,
    DEVICE_IND = 512 /* 1 << DEVICE_SHIFT */,
    DEVICE_NONE = 0 /* 0 << DEVICE_SHIFT */,
    INPUT_SHIFT = 12 /* DEVICE_SHIFT + DEVICE_SIZE */,
    INPUT_SIZE = 2,
    INPUT_MASK = 12288 /* ((1 << INPUT_SIZE) - 1) << INPUT_SHIFT */,
    INPUT_DIRECT = 4096 /* 1 << INPUT_SHIFT */,
    INPUT_PROVIDER = 8192 /* 2 << INPUT_SHIFT */,
    INPUT_BOTH = 12288 /* 3 << INPUT_SHIFT */,
    OUTPUT_SHIFT = 14 /* INPUT_SHIFT + INPUT_SIZE */,
    OUTPUT_SIZE = 2,
    OUTPUT_MASK = 49152 /* ((1 << OUTPUT_SIZE) - 1) << OUTPUT_SHIFT */,
    OUTPUT_DIRECT = 16384 /* 1 << OUTPUT_SHIFT */,
    OUTPUT_PROVIDER = 32768 /* 2 << OUTPUT_SHIFT */,
    OUTPUT_BOTH = 49152 /* 3 << OUTPUT_SHIFT */,
    HW_ACC_SHIFT = 16 /* OUTPUT_SHIFT + OUTPUT_SIZE */,
    HW_ACC_SIZE = 2,
    HW_ACC_MASK = 196608 /* ((1 << HW_ACC_SIZE) - 1) << HW_ACC_SHIFT */,
    HW_ACC_SIMPLE = 65536 /* 1 << HW_ACC_SHIFT */,
    HW_ACC_TUNNEL = 131072 /* 2 << HW_ACC_SHIFT */,
    AUDIO_MODE_SHIFT = 18 /* HW_ACC_SHIFT + HW_ACC_SIZE */,
    AUDIO_MODE_SIZE = 2,
    AUDIO_MODE_MASK = 786432 /* ((1 << AUDIO_MODE_SIZE) - 1) << AUDIO_MODE_SHIFT */,
    AUDIO_MODE_IND = 262144 /* 1 << AUDIO_MODE_SHIFT */,
    AUDIO_MODE_NONE = 0 /* 0 << AUDIO_MODE_SHIFT */,
    AUDIO_SOURCE_SHIFT = 20 /* AUDIO_MODE_SHIFT + AUDIO_MODE_SIZE */,
    AUDIO_SOURCE_SIZE = 2,
    AUDIO_SOURCE_MASK = 3145728 /* ((1 << AUDIO_SOURCE_SIZE) - 1) << AUDIO_SOURCE_SHIFT */,
    AUDIO_SOURCE_IND = 1048576 /* 1 << AUDIO_SOURCE_SHIFT */,
    AUDIO_SOURCE_NONE = 0 /* 0 << AUDIO_SOURCE_SHIFT */,
    OFFLOAD_SHIFT = 22 /* AUDIO_SOURCE_SHIFT + AUDIO_SOURCE_SIZE */,
    OFFLOAD_SIZE = 1,
    OFFLOAD_MASK = 4194304 /* ((1 << OFFLOAD_SIZE) - 1) << OFFLOAD_SHIFT */,
    OFFLOAD_SUPPORTED = 4194304 /* 1 << OFFLOAD_SHIFT */,
    NO_PROCESS_SHIFT = 23 /* OFFLOAD_SHIFT + OFFLOAD_SIZE */,
    NO_PROCESS_SIZE = 1,
    NO_PROCESS_MASK = 8388608 /* ((1 << NO_PROCESS_SIZE) - 1) << NO_PROCESS_SHIFT */,
    NO_PROCESS = 8388608 /* 1 << NO_PROCESS_SHIFT */,
};

/**
 * The effect descriptor contains necessary information to facilitate the
 * enumeration of the effect engines present in a library.
 */
struct EffectDescriptor final {
    ::android::hardware::audio::common::V6_0::Uuid type __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::Uuid uuid __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::audio::effect::V6_0::EffectFlags> flags __attribute__ ((aligned(4)));
    uint16_t cpuLoad __attribute__ ((aligned(2)));
    uint16_t memoryUsage __attribute__ ((aligned(2)));
    ::android::hardware::hidl_array<uint8_t, 64> name __attribute__ ((aligned(1)));
    ::android::hardware::hidl_array<uint8_t, 64> implementor __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::audio::effect::V6_0::EffectDescriptor, type) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::effect::V6_0::EffectDescriptor, uuid) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::audio::effect::V6_0::EffectDescriptor, flags) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::audio::effect::V6_0::EffectDescriptor, cpuLoad) == 36, "wrong offset");
static_assert(offsetof(::android::hardware::audio::effect::V6_0::EffectDescriptor, memoryUsage) == 38, "wrong offset");
static_assert(offsetof(::android::hardware::audio::effect::V6_0::EffectDescriptor, name) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::audio::effect::V6_0::EffectDescriptor, implementor) == 104, "wrong offset");
static_assert(sizeof(::android::hardware::audio::effect::V6_0::EffectDescriptor) == 168, "wrong size");
static_assert(__alignof(::android::hardware::audio::effect::V6_0::EffectDescriptor) == 4, "wrong alignment");

/**
 * A buffer is a chunk of audio data for processing.  Multi-channel audio is
 * always interleaved. The channel order is from LSB to MSB with regard to the
 * channel mask definition in audio.h, audio_channel_mask_t, e.g.:
 * Stereo: L, R; 5.1: FL, FR, FC, LFE, BL, BR.
 *
 * The buffer size is expressed in frame count, a frame being composed of
 * samples for all channels at a given time. Frame size for unspecified format
 * (AUDIO_FORMAT_OTHER) is 8 bit by definition.
 */
struct AudioBuffer final {
    uint64_t id __attribute__ ((aligned(8)));
    uint32_t frameCount __attribute__ ((aligned(4)));
    ::android::hardware::hidl_memory data __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::audio::effect::V6_0::AudioBuffer, id) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::effect::V6_0::AudioBuffer, frameCount) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::audio::effect::V6_0::AudioBuffer, data) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::audio::effect::V6_0::AudioBuffer) == 56, "wrong size");
static_assert(__alignof(::android::hardware::audio::effect::V6_0::AudioBuffer) == 8, "wrong alignment");

enum class EffectBufferAccess : int32_t {
    ACCESS_WRITE = 0,
    ACCESS_READ = 1 /* ::android::hardware::audio::effect::V6_0::EffectBufferAccess.ACCESS_WRITE implicitly + 1 */,
    ACCESS_ACCUMULATE = 2 /* ::android::hardware::audio::effect::V6_0::EffectBufferAccess.ACCESS_READ implicitly + 1 */,
};

/**
 * Determines what fields of EffectBufferConfig need to be considered.
 */
enum class EffectConfigParameters : int32_t {
    BUFFER = 1 /* 0x0001 */,
    SMP_RATE = 2 /* 0x0002 */,
    CHANNELS = 4 /* 0x0004 */,
    FORMAT = 8 /* 0x0008 */,
    ACC_MODE = 16 /* 0x0010 */,
};

/**
 * The buffer config structure specifies the input or output audio format
 * to be used by the effect engine.
 */
struct EffectBufferConfig final {
    ::android::hardware::audio::effect::V6_0::AudioBuffer buffer __attribute__ ((aligned(8)));
    uint32_t samplingRateHz __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::audio::common::V6_0::AudioChannelMask> channels __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V6_0::AudioFormat format __attribute__ ((aligned(4)));
    ::android::hardware::audio::effect::V6_0::EffectBufferAccess accessMode __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::audio::effect::V6_0::EffectConfigParameters> mask __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::effect::V6_0::EffectBufferConfig, buffer) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::effect::V6_0::EffectBufferConfig, samplingRateHz) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::audio::effect::V6_0::EffectBufferConfig, channels) == 60, "wrong offset");
static_assert(offsetof(::android::hardware::audio::effect::V6_0::EffectBufferConfig, format) == 64, "wrong offset");
static_assert(offsetof(::android::hardware::audio::effect::V6_0::EffectBufferConfig, accessMode) == 68, "wrong offset");
static_assert(offsetof(::android::hardware::audio::effect::V6_0::EffectBufferConfig, mask) == 72, "wrong offset");
static_assert(sizeof(::android::hardware::audio::effect::V6_0::EffectBufferConfig) == 80, "wrong size");
static_assert(__alignof(::android::hardware::audio::effect::V6_0::EffectBufferConfig) == 8, "wrong alignment");

struct EffectConfig final {
    ::android::hardware::audio::effect::V6_0::EffectBufferConfig inputCfg __attribute__ ((aligned(8)));
    ::android::hardware::audio::effect::V6_0::EffectBufferConfig outputCfg __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::audio::effect::V6_0::EffectConfig, inputCfg) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::effect::V6_0::EffectConfig, outputCfg) == 80, "wrong offset");
static_assert(sizeof(::android::hardware::audio::effect::V6_0::EffectConfig) == 160, "wrong size");
static_assert(__alignof(::android::hardware::audio::effect::V6_0::EffectConfig) == 8, "wrong alignment");

enum class EffectFeature : int32_t {
    AUX_CHANNELS = 0,
    CNT = 1 /* ::android::hardware::audio::effect::V6_0::EffectFeature.AUX_CHANNELS implicitly + 1 */,
};

struct EffectAuxChannelsConfig final {
    ::android::hardware::hidl_bitfield<::android::hardware::audio::common::V6_0::AudioChannelMask> mainChannels __attribute__ ((aligned(4)));
    ::android::hardware::hidl_bitfield<::android::hardware::audio::common::V6_0::AudioChannelMask> auxChannels __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::effect::V6_0::EffectAuxChannelsConfig, mainChannels) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::effect::V6_0::EffectAuxChannelsConfig, auxChannels) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::audio::effect::V6_0::EffectAuxChannelsConfig) == 8, "wrong size");
static_assert(__alignof(::android::hardware::audio::effect::V6_0::EffectAuxChannelsConfig) == 4, "wrong alignment");

struct EffectOffloadParameter final {
    bool isOffload __attribute__ ((aligned(1)));
    int32_t ioHandle __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::audio::effect::V6_0::EffectOffloadParameter, isOffload) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::audio::effect::V6_0::EffectOffloadParameter, ioHandle) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::audio::effect::V6_0::EffectOffloadParameter) == 8, "wrong size");
static_assert(__alignof(::android::hardware::audio::effect::V6_0::EffectOffloadParameter) == 4, "wrong alignment");

/**
 * The message queue flags used to synchronize reads and writes from
 * the status message queue used by effects.
 */
enum class MessageQueueFlagBits : uint32_t {
    DONE_PROCESSING = 1u /* 1 << 0 */,
    REQUEST_PROCESS = 2u /* 1 << 1 */,
    REQUEST_PROCESS_REVERSE = 4u /* 1 << 2 */,
    REQUEST_QUIT = 8u /* 1 << 3 */,
    REQUEST_PROCESS_ALL = 14u /* REQUEST_PROCESS | REQUEST_PROCESS_REVERSE | REQUEST_QUIT */,
};

//
// type declarations for package
//

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::android::hardware::audio::effect::V6_0::Result o);
static inline void PrintTo(::android::hardware::audio::effect::V6_0::Result o, ::std::ostream* os);
constexpr int32_t operator|(const ::android::hardware::audio::effect::V6_0::Result lhs, const ::android::hardware::audio::effect::V6_0::Result rhs) {
