#ifndef HIDL_GENERATED_ANDROID_HARDWARE_AUTOMOTIVE_SV_V1_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_AUTOMOTIVE_SV_V1_0_TYPES_H

#include <android/hardware/graphics/common/1.2/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace automotive {
namespace sv {
namespace V1_0 {

// Forward declaration for forward reference support:
struct Translation;
struct RotationQuat;
struct Point2dInt;
struct Point2dFloat;
struct Point3dFloat;
struct Pose;
struct View3d;
struct SvBuffer;
struct SvFramesDesc;
enum class SvResult : uint32_t;
enum class SvEvent : uint32_t;
struct Sv2dMappingInfo;
enum class SvQuality : uint32_t;
struct Sv2dConfig;
struct Sv3dConfig;
enum class OverlayPrimitive : uint32_t;
struct OverlayMemoryDesc;
struct OverlaysData;

/**
 * Structure for translation with x, y and z units.
 */
struct Translation final {
    float x __attribute__ ((aligned(4)));
    float y __attribute__ ((aligned(4)));
    float z __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::automotive::sv::V1_0::Translation, x) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::Translation, y) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::Translation, z) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::sv::V1_0::Translation) == 12, "wrong size");
static_assert(__alignof(::android::hardware::automotive::sv::V1_0::Translation) == 4, "wrong alignment");

/**
 * Structure for rotation expressed as quaternions.
 * Convention used: Unit quaternion with hamilton convention.
 */
struct RotationQuat final {
    float x __attribute__ ((aligned(4)));
    float y __attribute__ ((aligned(4)));
    float z __attribute__ ((aligned(4)));
    float w __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::automotive::sv::V1_0::RotationQuat, x) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::RotationQuat, y) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::RotationQuat, z) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::RotationQuat, w) == 12, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::sv::V1_0::RotationQuat) == 16, "wrong size");
static_assert(__alignof(::android::hardware::automotive::sv::V1_0::RotationQuat) == 4, "wrong alignment");

/**
 * Structure representing a 2D point with integers. Units are pixels.
 */
struct Point2dInt final {
    uint32_t x __attribute__ ((aligned(4)));
    uint32_t y __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::automotive::sv::V1_0::Point2dInt, x) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::Point2dInt, y) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::sv::V1_0::Point2dInt) == 8, "wrong size");
static_assert(__alignof(::android::hardware::automotive::sv::V1_0::Point2dInt) == 4, "wrong alignment");

/**
 * Structure representing a 2D point with floats.
 */
struct Point2dFloat final {
    /**
     * Boolean flag to indicate the (x, y) data is valid.
     */
    bool isValid __attribute__ ((aligned(1)));
    /**
     * (x, y) data is only valid if isValid is true. Units are pixels or milli-meters.
     */
    float x __attribute__ ((aligned(4)));
    float y __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::automotive::sv::V1_0::Point2dFloat, isValid) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::Point2dFloat, x) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::Point2dFloat, y) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::sv::V1_0::Point2dFloat) == 12, "wrong size");
static_assert(__alignof(::android::hardware::automotive::sv::V1_0::Point2dFloat) == 4, "wrong alignment");

/**
 * Structure representing a 3D point with floats.
 */
struct Point3dFloat final {
    /**
     * Boolean flag to indicate the (x, y, z) data is valid.
     */
    bool isValid __attribute__ ((aligned(1)));
    /**
     * (x, y, z) data is only valid if isValid is true. Units are milli-meters.
     */
    float x __attribute__ ((aligned(4)));
    float y __attribute__ ((aligned(4)));
    float z __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::automotive::sv::V1_0::Point3dFloat, isValid) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::Point3dFloat, x) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::Point3dFloat, y) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::Point3dFloat, z) == 12, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::sv::V1_0::Point3dFloat) == 16, "wrong size");
static_assert(__alignof(::android::hardware::automotive::sv::V1_0::Point3dFloat) == 4, "wrong alignment");

/**
 * Structure defining the pose in 3D space.
 */
struct Pose final {
    /**
     * Rotation part of the pose, expressed as a unit quaternion.
     */
    ::android::hardware::automotive::sv::V1_0::RotationQuat rotation __attribute__ ((aligned(4)));
    /**
     * Translation part of the pose, in (x, y, z) format with milli-meter units.
     */
    ::android::hardware::automotive::sv::V1_0::Translation translation __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::automotive::sv::V1_0::Pose, rotation) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::Pose, translation) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::sv::V1_0::Pose) == 28, "wrong size");
static_assert(__alignof(::android::hardware::automotive::sv::V1_0::Pose) == 4, "wrong alignment");

/**
 * Struct defining a virtual view in the 3d space around the car.
 */
struct View3d final {
    /**
     * Id to identify each custom view, this is passed along in each result SvBuffer.
     * Recommend client to have a unique id for each different view.
     */
    uint32_t viewId __attribute__ ((aligned(4)));
    /**
     * Pose of the view. Describes the orientation and location of a virtual view relative to the
     * android automotive coordinate system:
     * https://source.android.com/devices/sensors/sensor-types#auto_axes
     * The virtual view axes are defined as +Y as look-at direction, +X as right direction and
     * +Z as up direction.
     * The rotation and translation of the virtual view axes w.r.t the android automotive axes is
     * specified by the rotation and tranlation component of the pose respectively.
     * Example: A virtual view points to the right face of the car, located on right side of
     * the car at (4, 2, 0) and is upright w.r.t the ground :
     *         ______
     *  front |      |
     *        | car  |    ↑X
     *        |  ↑Y  |  Y←∘  view
     *  rear  |  ∘→X |  (4,2)
     *        |(0,0) |
     *        |______|
     *
     * Here the view axes are rotated by 90 counter-clockwise w.r.t android automotive axes.
     * For this example the rotation and translation will be:
     * Rotation = + 90 degrees around Z axis = (0.7071, 0, 0, 0.7071) as a unit quaternion.
     * Translation = (4, 2, 0) in meters = (2000, 4000, 0) in milli-meters.
     */
    ::android::hardware::automotive::sv::V1_0::Pose pose __attribute__ ((aligned(4)));
    /**
     * Horizontal field of view of the virtual view in degrees. Vertical fov is scaled accordingly
     * to maintain the aspect ratio of the output frame. Must be in range (20,
     */
    float horizontalFov __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::automotive::sv::V1_0::View3d, viewId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::View3d, pose) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::View3d, horizontalFov) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::sv::V1_0::View3d) == 36, "wrong size");
static_assert(__alignof(::android::hardware::automotive::sv::V1_0::View3d) == 4, "wrong alignment");

/**
 * Memory Buffer that stores the output of a single view from 2d/3d surround view.
 */
struct SvBuffer final {
    /**
     * viewId identifying the view as passed by the client in setViews() call for
     * surround view 3d. Id value is 0 for 2d surround view frame.
     */
    uint32_t viewId __attribute__ ((aligned(4)));
    /**
     * Hardware buffer containing the surround view 2d/3d result.
     */
    ::android::hardware::graphics::common::V1_2::HardwareBuffer hardwareBuffer __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::automotive::sv::V1_0::SvBuffer, viewId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::SvBuffer, hardwareBuffer) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::sv::V1_0::SvBuffer) == 64, "wrong size");
static_assert(__alignof(::android::hardware::automotive::sv::V1_0::SvBuffer) == 8, "wrong alignment");

/**
 * Structure describing a set of frames to be returned as output from 2d/3d surround view.
 */
struct SvFramesDesc final {
    /**
     * Elapsed real-time nanoseconds of earliest camera frame from the set of camera
     * frames used to generate the view.
     */
    uint64_t timestampNs __attribute__ ((aligned(8)));
    /**
     * Incremental counter for client to keep track of frames.
     */
    uint32_t sequenceId __attribute__ ((aligned(4)));
    /**
     * Frames generated with different views.
     * 2d surround view has only a single svBuffer with Id 0.
     */
    ::android::hardware::hidl_vec<::android::hardware::automotive::sv::V1_0::SvBuffer> svBuffers __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::automotive::sv::V1_0::SvFramesDesc, timestampNs) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::SvFramesDesc, sequenceId) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::SvFramesDesc, svBuffers) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::sv::V1_0::SvFramesDesc) == 32, "wrong size");
static_assert(__alignof(::android::hardware::automotive::sv::V1_0::SvFramesDesc) == 8, "wrong alignment");

/**
 * Enumerator for list of result returns by surround view .
 */
enum class SvResult : uint32_t {
    /**
     * Operation was successful.
     */
    OK = 0u,
    /**
     * Invalid argument to function was provided.
     */
    INVALID_ARG = 1u /* ::android::hardware::automotive::sv::V1_0::SvResult.OK implicitly + 1 */,
    /**
     * Error indicating the particular operation is not supported.
     */
    NOT_SUPPORTED = 2u /* ::android::hardware::automotive::sv::V1_0::SvResult.INVALID_ARG implicitly + 1 */,
    /**
     * Error indicating view not set before starting stream.
     */
    VIEW_NOT_SET = 3u /* ::android::hardware::automotive::sv::V1_0::SvResult.NOT_SUPPORTED implicitly + 1 */,
    /**
     * Error indicating system does not currently have enough resources to
     * allocate for a new requested session.
     * Clients may retry request for session if resources become available.
     */
    NO_RESOURCE = 4u /* ::android::hardware::automotive::sv::V1_0::SvResult.VIEW_NOT_SET implicitly + 1 */,
    /**
     * Internal error in surround view service.
     */
    INTERNAL_ERROR = 5u /* ::android::hardware::automotive::sv::V1_0::SvResult.NO_RESOURCE implicitly + 1 */,
};

/**
 * Enumerator listing events for surround view.
 */
enum class SvEvent : uint32_t {
    STREAM_STARTED = 1u,
    STREAM_STOPPED = 2u /* ::android::hardware::automotive::sv::V1_0::SvEvent.STREAM_STARTED implicitly + 1 */,
    /**
     * Event sent after service switches to an updated config, all frames
     * streamed after this event are of the updated config.
     */
    CONFIG_UPDATED = 3u /* ::android::hardware::automotive::sv::V1_0::SvEvent.STREAM_STOPPED implicitly + 1 */,
    /**
     * Each frame dropped will be notified with this event.
     */
    FRAME_DROPPED = 4u /* ::android::hardware::automotive::sv::V1_0::SvEvent.CONFIG_UPDATED implicitly + 1 */,
    /**
     * Timeout event occurs if any individual camera stream has a timeout.
     * Frames will not be delivered and clients must stop the stream.
     */
    TIMEOUT = 5u /* ::android::hardware::automotive::sv::V1_0::SvEvent.FRAME_DROPPED implicitly + 1 */,
};

/**
 * Structure defining the mapping information for 2d surround view.
 *
 * Mapping information provides the area on ground (width and height) and
 * position w.r.t the car that the surround view 2d covers. This can be used for
 * mapping (linear transformation) with other sensors whose data is available in
 * the car coordinate system (eg. Ultrasonics).
 * Axes and origin are as per the android automotive axes:
 * https://source.android.com/devices/sensors/sensor-types#auto_axes
 */
struct Sv2dMappingInfo final {
    /**
     * Width in milli-meters of the 2d surround view along the ground plane.
     */
    float width __attribute__ ((aligned(4)));
    /**
     * Height in milli-meters of the 2d surround view along the ground plane.
     */
    float height __attribute__ ((aligned(4)));
    /**
     * Coordinates (x, y) of the center of the view in android automotive coordinate system on the
     * ground plane. Units are milli-meters.
     */
    ::android::hardware::automotive::sv::V1_0::Point2dFloat center __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::automotive::sv::V1_0::Sv2dMappingInfo, width) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::Sv2dMappingInfo, height) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::Sv2dMappingInfo, center) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::sv::V1_0::Sv2dMappingInfo) == 20, "wrong size");
static_assert(__alignof(::android::hardware::automotive::sv::V1_0::Sv2dMappingInfo) == 4, "wrong alignment");

/**
 * Enumerator for quality presets for 2d/3d surround view.
 * Details of each preset are specified in the respective 2d/3d config structures.
 */
enum class SvQuality : uint32_t {
    HIGH = 0u,
    LOW = 1u /* ::android::hardware::automotive::sv::V1_0::SvQuality.HIGH implicitly + 1 */,
};

/**
 * Structure for surround view 2d configuration.
 */
struct Sv2dConfig final {
    /**
     * Desired output width in pixels. Must be in range (0, 4096].
     * Height is computed keeping the aspect ratio of the mapping info,
     * Example: If width = 1080 px and mapping_width = 5000 mm, mapping_height = 10000 mm.
     *          then, height = width * (mapping_height / mapping_width) = 2160 px.
     * Height is set to the floor value in case of (mapping_height / mapping_width) is not integer.
     * Mapping width, height is fixed for a car and is based on camera parameters and their ground
     * coverage.
     */
    uint32_t width __attribute__ ((aligned(4)));
    /**
     * Blending quality preset to use.
     * HIGH: High quality blending (eg. multiband blending) that consumes more resources.
     * LOW: Low quality blending (eg. alpha blending) that consumes less resources.
     */
    ::android::hardware::automotive::sv::V1_0::SvQuality blending __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::automotive::sv::V1_0::Sv2dConfig, width) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::Sv2dConfig, blending) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::sv::V1_0::Sv2dConfig) == 8, "wrong size");
static_assert(__alignof(::android::hardware::automotive::sv::V1_0::Sv2dConfig) == 4, "wrong alignment");

/**
 * Structure for surround view 3d configuration.
 */
struct Sv3dConfig final {
    /**
     * Desired output width in pixels. Must be in range (0, 4096].
     */
    uint32_t width __attribute__ ((aligned(4)));
    /**
     * Desired output height in pixels. Must be in range (0, 4096].
     */
    uint32_t height __attribute__ ((aligned(4)));
    /**
     * Car model rendering details level.
     * HIGH: Rendering includes shadows and reflections. Default option.
     * LOW: Rendering with no shadows and reflections.
     */
    ::android::hardware::automotive::sv::V1_0::SvQuality carDetails __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::automotive::sv::V1_0::Sv3dConfig, width) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::Sv3dConfig, height) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::Sv3dConfig, carDetails) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::sv::V1_0::Sv3dConfig) == 12, "wrong size");
static_assert(__alignof(::android::hardware::automotive::sv::V1_0::Sv3dConfig) == 4, "wrong alignment");

/**
 * Enumerator for a list of overlay primitives.
 *
 * Given a list of vertices for an overlay, a primitive type defines which vertices are used to form
 * the surfaces of the overlay object.
 */
enum class OverlayPrimitive : uint32_t {
    /**
     * Consecutive vertices picked in order 3 at a time form a triangle.
     * Eg: In a list of vertices (V1, V2, V3, V4, V5, V6)
     * (V1, V2, V3) form a triangle and (V4, V5, V6) form a triangle.
     */
    TRIANGLES = 0u,
    /**
     * Every 3 consecutive vertices form a triangle.
     * Example in a list of vertices V1, V2, V3, V4, V5, V6
     * (V1, V2, V3), (V2, V3, V4), (V3, V4, V5) and (V4, V5, V6) form triangles.
     */
    TRIANGLES_STRIP = 1u /* ::android::hardware::automotive::sv::V1_0::OverlayPrimitive.TRIANGLES implicitly + 1 */,
};

/**
 * Structure identifying an overlay and describing the size and arrangement of its data in
 * shared memory.
 */
struct OverlayMemoryDesc final {
    /**
     * Identifier of the overlay.
     */
    uint16_t id __attribute__ ((aligned(2)));
    /**
     * Number of vertices in the overlay.
     */
    uint32_t verticesCount __attribute__ ((aligned(4)));
    /**
     * Primitive for the overlay.
     */
    ::android::hardware::automotive::sv::V1_0::OverlayPrimitive overlayPrimitive __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::automotive::sv::V1_0::OverlayMemoryDesc, id) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::OverlayMemoryDesc, verticesCount) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::OverlayMemoryDesc, overlayPrimitive) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::sv::V1_0::OverlayMemoryDesc) == 12, "wrong size");
static_assert(__alignof(::android::hardware::automotive::sv::V1_0::OverlayMemoryDesc) == 4, "wrong alignment");

/**
 *  Structure containing the overlays data in shared memory.
 */
struct OverlaysData final {
    /**
     * List of overlay memory descriptors, describing the data in the shared memory
     */
    ::android::hardware::hidl_vec<::android::hardware::automotive::sv::V1_0::OverlayMemoryDesc> overlaysMemoryDesc __attribute__ ((aligned(8)));
    /**
     * Shared memory object containing a list of vertices for each overlay as described by
     * overlaysMemoryDesc.
     *
     * Each vertex comprises of:
     * | PositionX | PositionY | PositionZ |   RGBA       |
     * |   float   |   float   |   float   |  4 * uint8_t |
     *
     * Each vertex is of 3 floats and 4 bytes = 16 bytes.
     *
     * Layout of vertices in shared memory is in order:
     *
     * Bytes: | 0-1 | 2-18 | 19-34 | 35-50 | 51-66 | 67-68 | 69-84 | 85-100 | 101-116  |...
     * Data:  | id1 |  V1  |  V2   |   V3  |   V4  |  id2  |   V1  |   V2   |  V3      |...
     *        |           overlay1                 |          overlay 2                |
     *
     * The order of overlays must match the order as specified in the overlaysMemoryDesc.
     * The number of vertices each overlay has must match the verticesCount in overlaysMemoryDesc.
     * The id must match the id specificed in the OverlayMemoryDesc. This is used for verification.
     * For each overlay the number of vertices must be 3 or greater.
     * For TRIANGLES primitive the number of vertices must be a multiple of 3.
     * The overlay vertices are grouped as per the overlayPrimitive specified in overlaysMemoryDesc,
     * eg: If primitive is TRIANGLES, (V1, V2, V3) and (V4, V5, V6) form a triangle.
     */
    ::android::hardware::hidl_memory overlaysMemory __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::automotive::sv::V1_0::OverlaysData, overlaysMemoryDesc) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::automotive::sv::V1_0::OverlaysData, overlaysMemory) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::automotive::sv::V1_0::OverlaysData) == 56, "wrong size");
static_assert(__alignof(::android::hardware::automotive::sv::V1_0::OverlaysData) == 8, "wrong alignment");

//
// type declarations for package
//

static inline std::string toString(const ::android::hardware::automotive::sv::V1_0::Translation& o);
static inline void PrintTo(const ::android::hardware::automotive::sv::V1_0::Translation& o, ::std::ostream*);
static inline bool operator==(const ::android::hardware::automotive::sv::V1_0::Translation& lhs, const ::android::hardware::automotive::sv::V1_0::Translation& rhs);
static inline bool operator!=(const ::android::hardware::automotive::sv::V1_0::Translation& lhs, const ::android::hardware::automotive::sv::V1_0::Translation& rhs);

static inline std::string toString(const ::android::hardware::automotive::sv::V1_0::RotationQuat& o);
static inline void PrintTo(const ::android::hardware::automotive::sv::V1_0::RotationQuat& o, ::std::ostream*);
