{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA10_i",
   "name" : "int [10]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA10_i",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA1_h",
   "name" : "unsigned char [1]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA1_h",
   "size" : 1,
   "source_file" : "external/llvm/lib/Support/regex2.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA1_i",
   "name" : "int [1]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA1_i",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA2_i",
   "name" : "int [2]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA2_i",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA32_m",
   "name" : "unsigned long [32]",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIA32_m",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA8_i",
   "name" : "int [8]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA8_i",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIl",
   "name" : "long",
   "referenced_type" : "_ZTIl",
   "self_type" : "_ZTIl",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIm",
   "name" : "unsigned long",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIm",
   "size" : 4
  },
  {
   "linker_set_key" : "_ZTIv",
   "name" : "void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIv"
  },
  {
   "alignment" : 8,
   "is_integral" : true,
   "linker_set_key" : "_ZTIx",
   "name" : "long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIx",
   "size" : 8
  }
 ],
 "elf_functions" : [],
 "elf_objects" : [],
 "enum_types" :
 [
  {
   "alignment" : 4,
   "enum_fields" :
   [
    {
     "enum_field_value" : 0,
     "name" : "M_HEAP_TAGGING_LEVEL_NONE"
    },
    {
     "enum_field_value" : 1,
     "name" : "M_HEAP_TAGGING_LEVEL_TBI"
    },
    {
     "enum_field_value" : 2,
     "name" : "M_HEAP_TAGGING_LEVEL_ASYNC"
    },
    {
     "enum_field_value" : 3,
     "name" : "M_HEAP_TAGGING_LEVEL_SYNC"
    }
   ],
   "linker_set_key" : "_ZTI16HeapTaggingLevel",
   "name" : "HeapTaggingLevel",
   "referenced_type" : "_ZTI16HeapTaggingLevel",
   "self_type" : "_ZTI16HeapTaggingLevel",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h",
   "underlying_type" : "_ZTIj"
  }
 ],
 "function_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFPvS_jPKvE",
   "name" : "void *(void *, unsigned int, const void *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPv"
    },
    {
     "referenced_type" : "_ZTIj"
    },
    {
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "referenced_type" : "_ZTIFPvS_jPKvE",
   "return_type" : "_ZTIPv",
   "self_type" : "_ZTIFPvS_jPKvE",
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFPvjPKvE",
   "name" : "void *(unsigned int, const void *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIj"
    },
    {
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "referenced_type" : "_ZTIFPvjPKvE",
   "return_type" : "_ZTIPv",
   "self_type" : "_ZTIFPvjPKvE",
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFPvjjPKvE",
   "name" : "void *(unsigned int, unsigned int, const void *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIj"
    },
    {
     "referenced_type" : "_ZTIj"
    },
    {
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "referenced_type" : "_ZTIFPvjjPKvE",
   "return_type" : "_ZTIPv",
   "self_type" : "_ZTIFPvjjPKvE",
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIFvPvPKvE",
   "name" : "void (void *, const void *)",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPv"
    },
    {
     "referenced_type" : "_ZTIPKv"
    }
   ],
   "referenced_type" : "_ZTIFvPvPKvE",
   "return_type" : "_ZTIv",
   "self_type" : "_ZTIFvPvPKvE",
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  }
 ],
 "functions" :
 [
  {
   "function_name" : "llvm_regexec",
   "linker_set_key" : "llvm_regexec",
   "parameters" :
   [
    {
     "referenced_type" : "_ZTIPK10llvm_regex"
    },
    {
     "referenced_type" : "_ZTIPKc"
    },
    {
     "referenced_type" : "_ZTIj"
    },
    {
     "referenced_type" : "_ZTIP15llvm_regmatch_t"
    },
    {
     "referenced_type" : "_ZTIi"
    }
   ],
   "return_type" : "_ZTIi",
   "source_file" : "external/llvm/lib/Support/regex_impl.h"
  }
 ],
 "global_vars" :
 [
  {
   "linker_set_key" : "__free_hook",
   "name" : "__free_hook",
   "referenced_type" : "_ZTIVPFvPvPKvE",
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "linker_set_key" : "__malloc_hook",
   "name" : "__malloc_hook",
   "referenced_type" : "_ZTIVPFPvjPKvE",
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "linker_set_key" : "__memalign_hook",
   "name" : "__memalign_hook",
   "referenced_type" : "_ZTIVPFPvjjPKvE",
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "linker_set_key" : "__realloc_hook",
   "name" : "__realloc_hook",
   "referenced_type" : "_ZTIVPFPvS_jPKvE",
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "linker_set_key" : "_ctype_",
   "name" : "_ctype_",
   "referenced_type" : "_ZTIPKc",
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/ctype_inlines.h"
  },
  {
   "linker_set_key" : "stderr",
   "name" : "stderr",
   "referenced_type" : "_ZTIP7__sFILE",
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/stdio.h"
  },
  {
   "linker_set_key" : "stdin",
   "name" : "stdin",
   "referenced_type" : "_ZTIP7__sFILE",
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/stdio.h"
  },
  {
   "linker_set_key" : "stdout",
   "name" : "stdout",
   "referenced_type" : "_ZTIP7__sFILE",
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/stdio.h"
  }
 ],
 "lvalue_reference_types" : [],
 "pointer_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP15llvm_regmatch_t",
   "name" : "llvm_regmatch_t *",
   "referenced_type" : "_ZTI15llvm_regmatch_t",
   "self_type" : "_ZTIP15llvm_regmatch_t",
   "size" : 4,
   "source_file" : "external/llvm/lib/Support/regex_impl.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP4cset",
   "name" : "cset *",
   "referenced_type" : "_ZTI4cset",
   "self_type" : "_ZTIP4cset",
   "size" : 4,
   "source_file" : "external/llvm/lib/Support/regex2.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP7__sFILE",
   "name" : "__sFILE *",
   "referenced_type" : "_ZTI7__sFILE",
   "self_type" : "_ZTIP7__sFILE",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/stdio.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIP7re_guts",
   "name" : "re_guts *",
   "referenced_type" : "_ZTI7re_guts",
   "self_type" : "_ZTIP7re_guts",
   "size" : 4,
   "source_file" : "external/llvm/lib/Support/regex_impl.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFPvS_jPKvE",
   "name" : "void *(*)(void *, unsigned int, const void *)",
   "referenced_type" : "_ZTIFPvS_jPKvE",
   "self_type" : "_ZTIPFPvS_jPKvE",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFPvjPKvE",
   "name" : "void *(*)(unsigned int, const void *)",
   "referenced_type" : "_ZTIFPvjPKvE",
   "self_type" : "_ZTIPFPvjPKvE",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFPvjjPKvE",
   "name" : "void *(*)(unsigned int, unsigned int, const void *)",
   "referenced_type" : "_ZTIFPvjjPKvE",
   "self_type" : "_ZTIPFPvjjPKvE",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvPvPKvE",
   "name" : "void (*)(void *, const void *)",
   "referenced_type" : "_ZTIFvPvPKvE",
   "self_type" : "_ZTIPFvPvPKvE",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPK10llvm_regex",
   "name" : "const llvm_regex *",
   "referenced_type" : "_ZTIK10llvm_regex",
   "self_type" : "_ZTIPK10llvm_regex",
   "size" : 4,
   "source_file" : "external/llvm/lib/Support/regex_impl.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKc",
   "name" : "const char *",
   "referenced_type" : "_ZTIKc",
   "self_type" : "_ZTIPKc",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/ctype_inlines.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKv",
   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "self_type" : "_ZTIPKv",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPKc",
   "name" : "const char **",
   "referenced_type" : "_ZTIPKc",
   "self_type" : "_ZTIPPKc",
   "size" : 4,
   "source_file" : "external/llvm/lib/Support/regengine.inc"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 4,
   "source_file" : "external/llvm/lib/Support/regex2.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPh",
   "name" : "unsigned char *",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIPh",
   "size" : 4,
   "source_file" : "external/llvm/lib/Support/regex2.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPm",
   "name" : "unsigned long *",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIPm",
   "size" : 4,
   "source_file" : "external/llvm/lib/Support/regex2.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK10llvm_regex",
   "name" : "const llvm_regex",
   "referenced_type" : "_ZTI10llvm_regex",
   "self_type" : "_ZTIK10llvm_regex",
   "size" : 16,
   "source_file" : "external/llvm/lib/Support/regex_impl.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/ctype_inlines.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvS_jPKvE",
   "name" : "void *(*volatile)(void *, unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvS_jPKvE",
   "self_type" : "_ZTIVPFPvS_jPKvE",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvjPKvE",
   "name" : "void *(*volatile)(unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvjPKvE",
   "self_type" : "_ZTIVPFPvjPKvE",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFPvjjPKvE",
   "name" : "void *(*volatile)(unsigned int, unsigned int, const void *)",
   "referenced_type" : "_ZTIPFPvjjPKvE",
   "self_type" : "_ZTIVPFPvjjPKvE",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "_ZTIVPFvPvPKvE",
   "name" : "void (*volatile)(void *, const void *)",
   "referenced_type" : "_ZTIPFvPvPKvE",
   "self_type" : "_ZTIVPFvPvPKvE",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "re_magic",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "re_nsub",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "re_endp",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "re_g",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP7re_guts"
    }
   ],
   "linker_set_key" : "_ZTI10llvm_regex",
   "name" : "llvm_regex",
   "referenced_type" : "_ZTI10llvm_regex",
   "self_type" : "_ZTI10llvm_regex",
   "size" : 16,
   "source_file" : "external/llvm/lib/Support/regex_impl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "stack_base",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "stack_size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "guard_size",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "sched_policy",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sched_priority",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_attr_t",
   "name" : "pthread_attr_t",
   "referenced_type" : "_ZTI14pthread_attr_t",
   "self_type" : "_ZTI14pthread_attr_t",
   "size" : 24,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTI14pthread_cond_t",
   "name" : "pthread_cond_t",
   "referenced_type" : "_ZTI14pthread_cond_t",
   "self_type" : "_ZTI14pthread_cond_t",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "fds_bits",
     "referenced_type" : "_ZTIA32_m"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fd_set",
   "name" : "__kernel_fd_set",
   "referenced_type" : "_ZTI15__kernel_fd_set",
   "self_type" : "_ZTI15__kernel_fd_set",
   "size" : 128,
   "source_file" : "bionic/libc/kernel/uapi/linux/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "val",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI15__kernel_fsid_t",
   "name" : "__kernel_fsid_t",
   "referenced_type" : "_ZTI15__kernel_fsid_t",
   "self_type" : "_ZTI15__kernel_fsid_t",
   "size" : 8,
   "source_file" : "bionic/libc/kernel/uapi/asm-generic/posix_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "rm_so",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "rm_eo",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI15llvm_regmatch_t",
   "name" : "llvm_regmatch_t",
   "referenced_type" : "_ZTI15llvm_regmatch_t",
   "self_type" : "_ZTI15llvm_regmatch_t",
   "size" : 8,
   "source_file" : "external/llvm/lib/Support/regex_impl.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA1_i"
    }
   ],
   "linker_set_key" : "_ZTI15pthread_mutex_t",
   "name" : "pthread_mutex_t",
   "referenced_type" : "_ZTI15pthread_mutex_t",
   "self_type" : "_ZTI15pthread_mutex_t",
   "size" : 4,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA10_i"
    }
   ],
   "linker_set_key" : "_ZTI16pthread_rwlock_t",
   "name" : "pthread_rwlock_t",
   "referenced_type" : "_ZTI16pthread_rwlock_t",
   "self_type" : "_ZTI16pthread_rwlock_t",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA8_i"
    }
   ],
   "linker_set_key" : "_ZTI17pthread_barrier_t",
   "name" : "pthread_barrier_t",
   "referenced_type" : "_ZTI17pthread_barrier_t",
   "self_type" : "_ZTI17pthread_barrier_t",
   "size" : 32,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "__private",
     "referenced_type" : "_ZTIA2_i"
    }
   ],
   "linker_set_key" : "_ZTI18pthread_spinlock_t",
   "name" : "pthread_spinlock_t",
   "referenced_type" : "_ZTI18pthread_spinlock_t",
   "self_type" : "_ZTI18pthread_spinlock_t",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/bits/pthread_types.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "ptr",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "mask",
     "field_offset" : 32,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "hash",
     "field_offset" : 40,
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "smultis",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "multis",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTI4cset",
   "name" : "cset",
   "referenced_type" : "_ZTI4cset",
   "self_type" : "_ZTI4cset",
   "size" : 16,
   "source_file" : "external/llvm/lib/Support/regex2.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "g",
     "referenced_type" : "_ZTIP7re_guts"
    },
    {
     "field_name" : "eflags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "pmatch",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP15llvm_regmatch_t"
    },
    {
     "field_name" : "offp",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "beginp",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "endp",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "coldp",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "lastpos",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPPKc"
    },
    {
     "field_name" : "vn",
     "field_offset" : 256,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "space",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "st",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "fresh",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "tmp",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "empty",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPc"
    }
   ],
   "linker_set_key" : "_ZTI4lmat",
   "name" : "lmat",
   "referenced_type" : "_ZTI4lmat",
   "self_type" : "_ZTI4lmat",
   "size" : 56,
   "source_file" : "external/llvm/lib/Support/regengine.inc"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "g",
     "referenced_type" : "_ZTIP7re_guts"
    },
    {
     "field_name" : "eflags",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "pmatch",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP15llvm_regmatch_t"
    },
    {
     "field_name" : "offp",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "beginp",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "endp",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "coldp",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "lastpos",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPPKc"
    },
    {
     "field_name" : "dummy",
     "field_offset" : 256,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "st",
     "field_offset" : 288,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "fresh",
     "field_offset" : 320,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "tmp",
     "field_offset" : 352,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "empty",
     "field_offset" : 384,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI4smat",
   "name" : "smat",
   "referenced_type" : "_ZTI4smat",
   "self_type" : "_ZTI4smat",
   "size" : 52,
   "source_file" : "external/llvm/lib/Support/regengine.inc"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5div_t",
   "name" : "div_t",
   "referenced_type" : "_ZTI5div_t",
   "self_type" : "_ZTI5div_t",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "rem",
     "field_offset" : 32,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI6ldiv_t",
   "name" : "ldiv_t",
   "referenced_type" : "_ZTI6ldiv_t",
   "self_type" : "_ZTI6ldiv_t",
   "size" : 8,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/stdlib.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "quot",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "rem",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI7lldiv_t",
   "name" : "lldiv_t",
   "referenced_type" : "_ZTI7lldiv_t",
   "self_type" : "_ZTI7lldiv_t",
   "size" : 16,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/stdlib.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "magic",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "strip",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPm"
    },
    {
     "field_name" : "csetsize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ncsets",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "sets",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP4cset"
    },
    {
     "field_name" : "setbits",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "cflags",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nstates",
     "field_offset" : 224,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "firststate",
     "field_offset" : 256,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "laststate",
     "field_offset" : 288,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "iflags",
     "field_offset" : 320,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nbol",
     "field_offset" : 352,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "neol",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "ncategories",
     "field_offset" : 416,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "categories",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "must",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "mlen",
     "field_offset" : 512,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nsub",
     "field_offset" : 544,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "backrefs",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nplus",
     "field_offset" : 608,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "catspace",
     "field_offset" : 640,
     "referenced_type" : "_ZTIA1_h"
    }
   ],
   "linker_set_key" : "_ZTI7re_guts",
   "name" : "re_guts",
   "referenced_type" : "_ZTI7re_guts",
   "self_type" : "_ZTI7re_guts",
   "size" : 84,
   "source_file" : "external/llvm/lib/Support/regex2.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "arena",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ordblks",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "smblks",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hblks",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "hblkhd",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "usmblks",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fsmblks",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "uordblks",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "fordblks",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "keepcost",
     "field_offset" : 288,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI8mallinfo",
   "name" : "mallinfo",
   "referenced_type" : "_ZTI8mallinfo",
   "self_type" : "_ZTI8mallinfo",
   "size" : 40,
   "source_file" : "out/soong/.intermediates/bionic/libc/libc/android_vendor.32_arm_armv8-a_shared/gen/include/malloc.h"
  }
 ],
 "rvalue_reference_types" : []
}
