#ifndef HIDL_GENERATED_ANDROID_HARDWARE_RADIO_V1_5_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_RADIO_V1_5_TYPES_H

#include <android/hardware/radio/1.0/types.h>
#include <android/hardware/radio/1.1/types.h>
#include <android/hardware/radio/1.2/types.h>
#include <android/hardware/radio/1.4/types.h>
#include <android/hidl/safe_union/1.0/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace radio {
namespace V1_5 {

// Forward declaration for forward reference support:
enum class SignalMeasurementType : int32_t;
struct SignalThresholdInfo;
enum class AccessNetwork : int32_t;
enum class RadioAccessNetworks : int32_t;
struct RadioAccessSpecifier;
enum class NgranBands : int32_t;
enum class UtranBands : int32_t;
enum class EutranBands : int32_t;
struct NetworkScanRequest;
enum class ApnTypes : int32_t;
struct DataProfileInfo;
enum class AddressProperty : int32_t;
struct LinkAddress;
struct SetupDataCallResult;
enum class Domain : int32_t;
struct ClosedSubscriberGroupInfo;
struct OptionalCsgInfo;
struct CellIdentityGsm;
struct CellIdentityWcdma;
struct CellIdentityTdscdma;
struct CellIdentityLte;
struct CellIdentityNr;
struct CellInfoGsm;
struct CellInfoWcdma;
struct CellInfoTdscdma;
struct CellInfoLte;
struct CellInfoNr;
struct CellInfo;
struct CellIdentity;
struct BarringInfo;
enum class IndicationFilter : int32_t;
enum class RegistrationFailCause : int32_t;
enum class PrlIndicator : int32_t;
struct RegStateResult;
struct NetworkScanResult;
enum class PersoSubstate : int32_t;
struct AppStatus;
struct CardStatus;

/**
 * Defining signal strength type.
 */
enum class SignalMeasurementType : int32_t {
    /**
     * Received Signal Strength Indication.
     * Range: -113 dBm and -51 dBm
     * Used RAN: GERAN, CDMA2000
     * Reference: 3GPP TS 27.007 section 8.5.
     */
    RSSI = 1,
    /**
     * Received Signal Code Power.
     * Range: -120 dBm to -25 dBm;
     * Used RAN: UTRAN
     * Reference: 3GPP TS 25.123, section 9.1.1.1
     */
    RSCP = 2,
    /**
     * Reference Signal Received Power.
     * Range: -140 dBm to -44 dBm;
     * Used RAN: EUTRAN
     * Reference: 3GPP TS 36.133 9.1.4
     */
    RSRP = 3,
    /**
     * Reference Signal Received Quality
     * Range: -34 dB to 3 dB;
     * Used RAN: EUTRAN
     * Reference: 3GPP TS 36.133 v12.6.0 section 9.1.7
     */
    RSRQ = 4,
    /**
     * Reference Signal Signal to Noise Ratio
     * Range: -20 dB to 30 dB;
     * Used RAN: EUTRAN
     * Note: this field is optional; how to support it can be decided by the
     * corresponding vendor. Though the response code is not enforced,
     * vendor's implementation must ensure this interface not crashing.
     */
    RSSNR = 5,
    /**
     * 5G SS reference signal received power.
     * Range: -140 dBm to -44 dBm.
     * Used RAN: NGRAN
     * Reference: 3GPP TS 38.215.
     */
    SSRSRP = 6,
    /**
     * 5G SS reference signal received quality.
     * Range: -20 dB to -3 dB.
     * Used RAN: NGRAN
     * Reference: 3GPP TS 38.215.
     */
    SSRSRQ = 7,
    /**
     * 5G SS signal-to-noise and interference ratio.
     * Range: -23 dB to 40 dB
     * Used RAN: NGRAN
     * Reference: 3GPP TS 38.215 section 5.1.*, 3GPP TS 38.133 section 10.1.16.1.
     */
    SSSINR = 8,
};

/**
 * Contains the threshold values of each signal measurement type.
 */
struct SignalThresholdInfo final {
    /**
     * Signal Measurement Type
     */
    ::android::hardware::radio::V1_5::SignalMeasurementType signalMeasurement __attribute__ ((aligned(4)));
    /**
     * A hysteresis time in milliseconds to prevent flapping. A value of 0 disables hysteresis.
     */
    int32_t hysteresisMs __attribute__ ((aligned(4)));
    /**
     * An interval in dB defining the required magnitude change between reports.
     * hysteresisDb must be smaller than the smallest threshold delta.
     * An interval value of 0 disables hysteresis.
     */
    int32_t hysteresisDb __attribute__ ((aligned(4)));
    /**
     * List of threshold values.
     * Range and unit must reference specific @1.5::SignalMeasurementType.
     * The threshold values for which to apply criteria.
     * A vector size of 0 disables the use of thresholds for reporting.
     */
    ::android::hardware::hidl_vec<int32_t> thresholds __attribute__ ((aligned(8)));
    /**
     * Indicates whether the reporting criteria of the corresponding measurement is enabled
     * (isEnabled==true) or disabled (isEnabled==false).
     *
     * If enabled, modem must trigger the report based on the criteria.
     * If disabled, modem must not trigger the report based on the criteria.
     */
    bool isEnabled __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::radio::V1_5::SignalThresholdInfo, signalMeasurement) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::SignalThresholdInfo, hysteresisMs) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::SignalThresholdInfo, hysteresisDb) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::SignalThresholdInfo, thresholds) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::SignalThresholdInfo, isEnabled) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_5::SignalThresholdInfo) == 40, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::SignalThresholdInfo) == 8, "wrong alignment");

enum class AccessNetwork : int32_t {
    /**
     * GSM EDGE Radio Access Network
     */
    GERAN = 1,
    /**
     * Universal Terrestrial Radio Access Network
     */
    UTRAN = 2,
    /**
     * Evolved Universal Terrestrial Radio Access Network
     */
    EUTRAN = 3,
    /**
     * CDMA 2000 network
     */
    CDMA2000 = 4,
    /**
     * Interworking Wireless LAN
     */
    IWLAN = 5,
    /**
     * Unknown access network
     */
    UNKNOWN = 0,
    /**
     * Next-Generation Radio Access Network (NGRAN).
     * Note NGRAN is only for standalone mode. Non-standalone mode uses AccessNetwork EUTRAN.
     */
    NGRAN = 6,
};

enum class RadioAccessNetworks : int32_t {
    GERAN = 1,
    UTRAN = 2,
    EUTRAN = 3,
    UNKNOWN = 0,
    /**
     * Next Generation Radio Access Network
     */
    NGRAN = 4,
    /**
     * CDMA 2000 Network
     */
    CDMA2000 = 5,
};

/**
 * Overwritten from @1.1::RadioAccessSpecifier to add NGRAN and NgranBands.
 */
struct RadioAccessSpecifier final {
    // Forward declaration for forward reference support:
    struct Bands;

    struct Bands final {
        enum class hidl_discriminator : uint8_t {
            /**
             * Valid only if radioAccessNetwork = GERAN.
             */
            geranBands = 0,  // ::android::hardware::hidl_vec<::android::hardware::radio::V1_1::GeranBands>
            /**
             * Valid only if radioAccessNetwork = UTRAN.
             */
            utranBands = 1,  // ::android::hardware::hidl_vec<::android::hardware::radio::V1_5::UtranBands>
            /**
             * Valid only if radioAccessNetwork = EUTRAN.
             */
            eutranBands = 2,  // ::android::hardware::hidl_vec<::android::hardware::radio::V1_5::EutranBands>
            /**
             * Valid only if radioAccessNetwork = NGRAN.
             */
            ngranBands = 3,  // ::android::hardware::hidl_vec<::android::hardware::radio::V1_5::NgranBands>
        };

        Bands();
        ~Bands();
        Bands(Bands&&);
        Bands(const Bands&);
        Bands& operator=(Bands&&);
        Bands& operator=(const Bands&);

        void geranBands(const ::android::hardware::hidl_vec<::android::hardware::radio::V1_1::GeranBands>&);
        void geranBands(::android::hardware::hidl_vec<::android::hardware::radio::V1_1::GeranBands>&&);
        ::android::hardware::hidl_vec<::android::hardware::radio::V1_1::GeranBands>& geranBands();
        const ::android::hardware::hidl_vec<::android::hardware::radio::V1_1::GeranBands>& geranBands() const;

        void utranBands(const ::android::hardware::hidl_vec<::android::hardware::radio::V1_5::UtranBands>&);
        void utranBands(::android::hardware::hidl_vec<::android::hardware::radio::V1_5::UtranBands>&&);
        ::android::hardware::hidl_vec<::android::hardware::radio::V1_5::UtranBands>& utranBands();
        const ::android::hardware::hidl_vec<::android::hardware::radio::V1_5::UtranBands>& utranBands() const;

        void eutranBands(const ::android::hardware::hidl_vec<::android::hardware::radio::V1_5::EutranBands>&);
        void eutranBands(::android::hardware::hidl_vec<::android::hardware::radio::V1_5::EutranBands>&&);
        ::android::hardware::hidl_vec<::android::hardware::radio::V1_5::EutranBands>& eutranBands();
        const ::android::hardware::hidl_vec<::android::hardware::radio::V1_5::EutranBands>& eutranBands() const;

        void ngranBands(const ::android::hardware::hidl_vec<::android::hardware::radio::V1_5::NgranBands>&);
        void ngranBands(::android::hardware::hidl_vec<::android::hardware::radio::V1_5::NgranBands>&&);
        ::android::hardware::hidl_vec<::android::hardware::radio::V1_5::NgranBands>& ngranBands();
        const ::android::hardware::hidl_vec<::android::hardware::radio::V1_5::NgranBands>& ngranBands() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::radio::V1_5::RadioAccessSpecifier::Bands, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hardware::hidl_vec<::android::hardware::radio::V1_1::GeranBands> geranBands __attribute__ ((aligned(8)));
            ::android::hardware::hidl_vec<::android::hardware::radio::V1_5::UtranBands> utranBands __attribute__ ((aligned(8)));
            ::android::hardware::hidl_vec<::android::hardware::radio::V1_5::EutranBands> eutranBands __attribute__ ((aligned(8)));
            ::android::hardware::hidl_vec<::android::hardware::radio::V1_5::NgranBands> ngranBands __attribute__ ((aligned(8)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::radio::V1_5::RadioAccessSpecifier::Bands::hidl_union) == 16, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_5::RadioAccessSpecifier::Bands::hidl_union) == 8, "wrong alignment");
        static_assert(sizeof(::android::hardware::radio::V1_5::RadioAccessSpecifier::Bands::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_5::RadioAccessSpecifier::Bands::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::radio::V1_5::RadioAccessSpecifier::Bands) == 24, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_5::RadioAccessSpecifier::Bands) == 8, "wrong alignment");

    /**
     * The type of network to scan.
     */
    ::android::hardware::radio::V1_5::RadioAccessNetworks radioAccessNetwork __attribute__ ((aligned(4)));
    /**
     * The frequency bands to scan.
     * Maximum length of the vector is 8.
     */
    ::android::hardware::radio::V1_5::RadioAccessSpecifier::Bands bands __attribute__ ((aligned(8)));
    /**
     * The radio channels to scan as defined in 3GPP TS 25.101 and 36.101.
     * Maximum length of the vector is 32.
     */
    ::android::hardware::hidl_vec<int32_t> channels __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_5::RadioAccessSpecifier, radioAccessNetwork) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::RadioAccessSpecifier, bands) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::RadioAccessSpecifier, channels) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_5::RadioAccessSpecifier) == 48, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::RadioAccessSpecifier) == 8, "wrong alignment");

/**
 * IRadio 1.5 supports NGRAN bands up to V16.2.0
 */
enum class NgranBands : int32_t {
    /**
     * 3GPP TS 38.101-1, Table 5.2-1: FR1 bands
     */
    BAND_1 = 1,
    BAND_2 = 2,
    BAND_3 = 3,
    BAND_5 = 5,
    BAND_7 = 7,
    BAND_8 = 8,
    BAND_12 = 12,
    BAND_14 = 14,
    BAND_18 = 18,
    BAND_20 = 20,
    BAND_25 = 25,
    BAND_28 = 28,
    BAND_29 = 29,
    BAND_30 = 30,
    BAND_34 = 34,
    BAND_38 = 38,
    BAND_39 = 39,
    BAND_40 = 40,
    BAND_41 = 41,
    BAND_48 = 48,
    BAND_50 = 50,
    BAND_51 = 51,
    BAND_65 = 65,
    BAND_66 = 66,
    BAND_70 = 70,
    BAND_71 = 71,
    BAND_74 = 74,
    BAND_75 = 75,
    BAND_76 = 76,
    BAND_77 = 77,
    BAND_78 = 78,
    BAND_79 = 79,
    BAND_80 = 80,
    BAND_81 = 81,
    BAND_82 = 82,
    BAND_83 = 83,
    BAND_84 = 84,
    BAND_86 = 86,
    BAND_89 = 89,
    BAND_90 = 90,
    BAND_91 = 91,
    BAND_92 = 92,
    BAND_93 = 93,
    BAND_94 = 94,
    BAND_95 = 95,
    /**
     * 3GPP TS 38.101-2, Table 5.2-1: FR2 bands
     */
    BAND_257 = 257,
    BAND_258 = 258,
    BAND_260 = 260,
    BAND_261 = 261,
};

/**
 * Extended from @1.1 UtranBands to add TD-SCDMA bands
 * IRadio 1.5 supports UTRAN bands up to V15.0.0
 */
enum class UtranBands : int32_t {
    BAND_1 = 1,
    BAND_2 = 2,
    BAND_3 = 3,
    BAND_4 = 4,
    BAND_5 = 5,
    BAND_6 = 6,
    BAND_7 = 7,
    BAND_8 = 8,
    BAND_9 = 9,
    BAND_10 = 10,
    BAND_11 = 11,
    BAND_12 = 12,
    BAND_13 = 13,
    BAND_14 = 14,
    BAND_19 = 19,
    BAND_20 = 20,
    BAND_21 = 21,
    BAND_22 = 22,
    BAND_25 = 25,
    BAND_26 = 26,
    /**
     * TD-SCDMA bands. 3GPP TS 25.102, Table 5.2: Frequency bands
     */
    BAND_A = 101,
    BAND_B = 102,
    BAND_C = 103,
    BAND_D = 104,
    BAND_E = 105,
    BAND_F = 106,
};

/**
 * Extended from @1.1 EutranBands to add more bands from 3GPP TS 36.101, Table 5.5: Operating bands
 * IRadio 1.5 supports EUTRAN bands up to V16.4.0
 */
enum class EutranBands : int32_t {
    BAND_1 = 1,
    BAND_2 = 2,
    BAND_3 = 3,
    BAND_4 = 4,
    BAND_5 = 5,
    BAND_6 = 6,
    BAND_7 = 7,
    BAND_8 = 8,
    BAND_9 = 9,
    BAND_10 = 10,
    BAND_11 = 11,
    BAND_12 = 12,
    BAND_13 = 13,
    BAND_14 = 14,
    BAND_17 = 17,
    BAND_18 = 18,
    BAND_19 = 19,
    BAND_20 = 20,
    BAND_21 = 21,
    BAND_22 = 22,
    BAND_23 = 23,
    BAND_24 = 24,
    BAND_25 = 25,
    BAND_26 = 26,
    BAND_27 = 27,
    BAND_28 = 28,
    BAND_30 = 30,
    BAND_31 = 31,
    BAND_33 = 33,
    BAND_34 = 34,
    BAND_35 = 35,
    BAND_36 = 36,
    BAND_37 = 37,
    BAND_38 = 38,
    BAND_39 = 39,
    BAND_40 = 40,
    BAND_41 = 41,
    BAND_42 = 42,
    BAND_43 = 43,
    BAND_44 = 44,
    BAND_45 = 45,
    BAND_46 = 46,
    BAND_47 = 47,
    BAND_48 = 48,
    BAND_65 = 65,
    BAND_66 = 66,
    BAND_68 = 68,
    BAND_70 = 70,
    BAND_49 = 49,
    BAND_50 = 50,
    BAND_51 = 51,
    BAND_52 = 52,
    BAND_53 = 53,
    BAND_71 = 71,
    BAND_72 = 72,
    BAND_73 = 73,
    BAND_74 = 74,
    BAND_85 = 85,
    BAND_87 = 87,
    BAND_88 = 88,
};

/**
 * Overwritten from @1.2::NetworkScanRequest to update RadioAccessSpecifier to 1.5 version.
 */
struct NetworkScanRequest final {
    ::android::hardware::radio::V1_1::ScanType type __attribute__ ((aligned(4)));
    /**
     * Time interval in seconds between the completion of one scan and the start of
     * a subsequent scan.
     * Implementations may ignore this field unless the 'type' is 'PERIODIC'.
     * Range: ScanIntervalRange:MIN to ScanIntervalRange:MAX
     */
    int32_t interval __attribute__ ((aligned(4)));
    /**
     * Networks with bands/channels to scan
     * Maximum length of the vector is RadioConst:RADIO_ACCESS_SPECIFIER_MAX_SIZE
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_5::RadioAccessSpecifier> specifiers __attribute__ ((aligned(8)));
    /**
     * Maximum duration of the periodic search (in seconds).
     * If the search lasts maxSearchTime, it must be terminated.
     * Range: MaxSearchTimeRange:MIN to MaxSearchTimeRange:MAX
     */
    int32_t maxSearchTime __attribute__ ((aligned(4)));
    /**
     * Indicates whether the modem must report incremental results of the network scan
     * to the client.
     * FALSE – Incremental results must not be reported.
     * TRUE  – Incremental must be reported.
     */
    bool incrementalResults __attribute__ ((aligned(1)));
    /**
     * Indicates the periodicity with which the modem must report incremental results to
     * the client (in seconds).
     * Implementations may ignore this value if the incremental results are not requested.
     * This value must be less than or equal to maxSearchTime.
     * Range: IncrementalResultsPeriodicityRange:MIN to IncrementalResultsPeriodicityRange:MAX
     */
    int32_t incrementalResultsPeriodicity __attribute__ ((aligned(4)));
    /**
     * Describes the List of PLMN ids (MCC-MNC)
     * If any PLMN of this list is found, search must end at that point and results with all
     * PLMN found until that point should be sent as response.
     * If the list is not sent, search to be completed until end and all PLMNs found to be
     * reported.
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> mccMncs __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_5::NetworkScanRequest, type) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::NetworkScanRequest, interval) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::NetworkScanRequest, specifiers) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::NetworkScanRequest, maxSearchTime) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::NetworkScanRequest, incrementalResults) == 28, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::NetworkScanRequest, incrementalResultsPeriodicity) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::NetworkScanRequest, mccMncs) == 40, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_5::NetworkScanRequest) == 56, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::NetworkScanRequest) == 8, "wrong alignment");

enum class ApnTypes : int32_t {
    NONE = 0,
    DEFAULT = 1 /* 1 << 0 */,
    MMS = 2 /* 1 << 1 */,
    SUPL = 4 /* 1 << 2 */,
    DUN = 8 /* 1 << 3 */,
    HIPRI = 16 /* 1 << 4 */,
    FOTA = 32 /* 1 << 5 */,
    IMS = 64 /* 1 << 6 */,
    CBS = 128 /* 1 << 7 */,
    IA = 256 /* 1 << 8 */,
    EMERGENCY = 512 /* 1 << 9 */,
    ALL = 1023 /* DEFAULT | MMS | SUPL | DUN | HIPRI | FOTA | IMS | CBS | IA | EMERGENCY */,
    /**
     * Due to the addition of this new value, the value ALL defined in 1.0::ApnTypes is now
     * deprecated and should not be used.
     */
    MCX = 1024 /* 1 << 10 */,
    /**
     * APN type for XCAP
     * NOTE: Due to the addition of this new value, the value ALL defined in
     * 1.0::ApnTypes is deprecated and should not be used.
     */
    XCAP = 2048 /* 1 << 11 */,
};

/**
 * Overwritten from @1.4::DataProfileInfo to update ApnTypes to 1.5 version and replace mtu with
 * mtuV4 and mtuV6. In the future, this must be extended instead of overwritten.
 */
struct DataProfileInfo final {
    /**
     * ID of the data profile.
     */
    ::android::hardware::radio::V1_0::DataProfileId profileId __attribute__ ((aligned(4)));
    /**
     * The APN name.
     */
    ::android::hardware::hidl_string apn __attribute__ ((aligned(8)));
    /**
     * PDP_type values.
     */
    ::android::hardware::radio::V1_4::PdpProtocolType protocol __attribute__ ((aligned(4)));
    /**
     * PDP_type values used on roaming network.
     */
    ::android::hardware::radio::V1_4::PdpProtocolType roamingProtocol __attribute__ ((aligned(4)));
    /**
     * APN authentication type.
     */
    ::android::hardware::radio::V1_0::ApnAuthType authType __attribute__ ((aligned(4)));
    /**
     * The username for APN, or empty string.
     */
    ::android::hardware::hidl_string user __attribute__ ((aligned(8)));
    /**
     * The password for APN, or empty string.
     */
    ::android::hardware::hidl_string password __attribute__ ((aligned(8)));
    /**
     * Data profile technology type.
     */
    ::android::hardware::radio::V1_0::DataProfileInfoType type __attribute__ ((aligned(4)));
    /**
     * The period in seconds to limit the maximum connections.
     */
    int32_t maxConnsTime __attribute__ ((aligned(4)));
    /**
     * The maximum connections during maxConnsTime.
     */
    int32_t maxConns __attribute__ ((aligned(4)));
    /**
     * The required wait time in seconds after a successful UE initiated disconnect of a given PDN
     * connection before the device can send a new PDN connection request for that given PDN.
     */
    int32_t waitTime __attribute__ ((aligned(4)));
    /**
     * True to enable the profile, false to disable.
     */
    bool enabled __attribute__ ((aligned(1)));
    /**
     * Supported APN types bitmap. See ApnTypes for the value of each bit.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::radio::V1_5::ApnTypes> supportedApnTypesBitmap __attribute__ ((aligned(4)));
    /**
     * The bearer bitmap. See RadioAccessFamily for the value of each bit.
     */
    ::android::hardware::hidl_bitfield<::android::hardware::radio::V1_4::RadioAccessFamily> bearerBitmap __attribute__ ((aligned(4)));
    /**
     * Maximum transmission unit (MTU) size in bytes for IPv4.
     */
    int32_t mtuV4 __attribute__ ((aligned(4)));
    /**
     * Maximum transmission unit (MTU) size in bytes for IPv6.
     */
    int32_t mtuV6 __attribute__ ((aligned(4)));
    /**
     * True if this data profile was used to bring up the last default (i.e internet) data
     * connection successfully.
     */
    bool preferred __attribute__ ((aligned(1)));
    /**
     * If true, modem must persist this data profile and profileId must not be
     * set to DataProfileId.INVALID. If the same data profile exists, this data profile must
     * overwrite it.
     */
    bool persistent __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::radio::V1_5::DataProfileInfo, profileId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::DataProfileInfo, apn) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::DataProfileInfo, protocol) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::DataProfileInfo, roamingProtocol) == 28, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::DataProfileInfo, authType) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::DataProfileInfo, user) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::DataProfileInfo, password) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::DataProfileInfo, type) == 72, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::DataProfileInfo, maxConnsTime) == 76, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::DataProfileInfo, maxConns) == 80, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::DataProfileInfo, waitTime) == 84, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::DataProfileInfo, enabled) == 88, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::DataProfileInfo, supportedApnTypesBitmap) == 92, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::DataProfileInfo, bearerBitmap) == 96, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::DataProfileInfo, mtuV4) == 100, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::DataProfileInfo, mtuV6) == 104, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::DataProfileInfo, preferred) == 108, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::DataProfileInfo, persistent) == 109, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_5::DataProfileInfo) == 112, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::DataProfileInfo) == 8, "wrong alignment");

/**
 * The properties of the link address. This enum reflects the definition in
 * if_addr.h in Linux kernel.
 */
enum class AddressProperty : int32_t {
    NONE = 0,
    /**
     * Indicates this address is deprecated
     */
    DEPRECATED = 32 /* 0x20 */,
};

/**
 * Describes a data link address for mobile data connection.
 */
struct LinkAddress final {
    /**
     * The format is IP address with optional "/"
     * prefix length (The format is defined in RFC-4291 section 2.3). For example, "192.0.1.3",
     * "192.0.1.11/16", or "2001:db8::1/64". Typically one IPv4 or one IPv6 or one of each. If
     * the prefix length is absent, then the addresses are assumed to be point to point with
     * IPv4 with prefix length 32 or IPv6 with prefix length 128.
     */
    ::android::hardware::hidl_string address __attribute__ ((aligned(8)));
    /**
     * The properties of the link address
     */
    ::android::hardware::hidl_bitfield<::android::hardware::radio::V1_5::AddressProperty> properties __attribute__ ((aligned(4)));
    /**
     * The time, as reported by SystemClock.elapsedRealtime(), when this link address will be or
     * was deprecated. -1 indicates this information is not available. At the time existing
     * connections can still use this address until it expires, but new connections should use the
     * new address. LONG_MAX(0x7FFFFFFFFFFFFFFF) indicates this link address will never be
     * deprecated.
     */
    uint64_t deprecationTime __attribute__ ((aligned(8)));
    /**
     * The time, as reported by SystemClock.elapsedRealtime(), when this link address will expire
     * and be removed from the interface. -1 indicates this information is not available.
     * LONG_MAX(0x7FFFFFFFFFFFFFFF) indicates this link address will never expire.
     */
    uint64_t expirationTime __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_5::LinkAddress, address) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::LinkAddress, properties) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::LinkAddress, deprecationTime) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::LinkAddress, expirationTime) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_5::LinkAddress) == 40, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::LinkAddress) == 8, "wrong alignment");

/**
 * Overwritten from @1.4::SetupDataCallResult in order to update the addresses to 1.5 version.
 * In 1.5 the type of addresses changes to vector of LinkAddress, and mtu is replaced by
 * mtuV4 and mtuV6.
 */
struct SetupDataCallResult final {
    /**
     * Data call fail cause. DataCallFailCause.NONE if no error.
     */
    ::android::hardware::radio::V1_4::DataCallFailCause cause __attribute__ ((aligned(4)));
    /**
     * If status != DataCallFailCause.NONE, this field indicates the suggested retry back-off timer
     * value RIL wants to override the one pre-configured in FW. The unit is milliseconds.
     * The value < 0 means no value is suggested.
     * The value 0 means retry must be done ASAP.
     * The value of INT_MAX(0x7fffffff) means no retry.
     */
    int32_t suggestedRetryTime __attribute__ ((aligned(4)));
    /**
     * Context ID, uniquely identifies this call.
     */
    int32_t cid __attribute__ ((aligned(4)));
    /**
     * Data connection active status.
     */
    ::android::hardware::radio::V1_4::DataConnActiveStatus active __attribute__ ((aligned(4)));
    /**
     * PDP_type values. If cause is DataCallFailCause.ONLY_SINGLE_BEARER_ALLOWED, this is the type
     * supported such as "IP" or "IPV6".
     */
    ::android::hardware::radio::V1_4::PdpProtocolType type __attribute__ ((aligned(4)));
    /**
     * The network interface name.
     */
    ::android::hardware::hidl_string ifname __attribute__ ((aligned(8)));
    /**
     * List of link address.
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_5::LinkAddress> addresses __attribute__ ((aligned(8)));
    /**
     * List of DNS server addresses, e.g., "192.0.1.3" or "192.0.1.11 2001:db8::1". Empty if no dns
     * server addresses returned.
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> dnses __attribute__ ((aligned(8)));
    /**
     * List of default gateway addresses, e.g., "192.0.1.3" or "192.0.1.11 2001:db8::1".
     * When empty, the addresses represent point to point connections.
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> gateways __attribute__ ((aligned(8)));
    /**
     * List of P-CSCF(Proxy Call State Control Function) addresses via PCO(Protocol Configuration
     * Option), e.g., "2001:db8::1 2001:db8::2 2001:db8::3". Empty if not IMS client.
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> pcscf __attribute__ ((aligned(8)));
    /**
     * MTU received from network for IPv4.
     * Value <= 0 means network has either not sent a value or sent an invalid value.
     */
    int32_t mtuV4 __attribute__ ((aligned(4)));
    /**
     * MTU received from network for IPv6.
     * Value <= 0 means network has either not sent a value or sent an invalid value.
     */
    int32_t mtuV6 __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_5::SetupDataCallResult, cause) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::SetupDataCallResult, suggestedRetryTime) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::SetupDataCallResult, cid) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::SetupDataCallResult, active) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::SetupDataCallResult, type) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::SetupDataCallResult, ifname) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::SetupDataCallResult, addresses) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::SetupDataCallResult, dnses) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::SetupDataCallResult, gateways) == 72, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::SetupDataCallResult, pcscf) == 88, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::SetupDataCallResult, mtuV4) == 104, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::SetupDataCallResult, mtuV6) == 108, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_5::SetupDataCallResult) == 112, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::SetupDataCallResult) == 8, "wrong alignment");

enum class Domain : int32_t {
    /**
     * Circuit-switched
     */
    CS = 1 /* 1 << 0 */,
    /**
     * Packet-switched
     */
    PS = 2 /* 1 << 1 */,
};

struct ClosedSubscriberGroupInfo final {
    /**
     * Indicates whether the cell is restricted to only CSG members. A cell not broadcasting the
     * CSG Indication but reporting CSG information is considered a Hybrid Cell.
     * Refer to the "csg-Indication" field in 3GPP TS 36.331 section 6.2.2
     * SystemInformationBlockType1.
     * Also refer to "CSG Indicator" in 3GPP TS 25.331 section 10.2.48.8.1 and TS 25.304.
     */
    bool csgIndication __attribute__ ((aligned(1)));
    /**
     * The human-readable name of the closed subscriber group operating this cell.
     * Refer to "hnb-Name" in TS 36.331 section 6.2.2 SystemInformationBlockType9.
     * Also refer to "HNB Name" in 3GPP TS25.331 section 10.2.48.8.23 and TS 23.003 section 4.8.
     */
    ::android::hardware::hidl_string homeNodebName __attribute__ ((aligned(8)));
    /**
     * The identity of the closed subscriber group that the cell belongs to.
     * Refer to "CSG-Identity" in TS 36.336 section 6.3.4.
     * Also refer to "CSG Identity" in 3GPP TS 25.331 section 10.3.2.8 and TS 23.003 section 4.7.
     */
    int32_t csgIdentity __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_5::ClosedSubscriberGroupInfo, csgIndication) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::ClosedSubscriberGroupInfo, homeNodebName) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::ClosedSubscriberGroupInfo, csgIdentity) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_5::ClosedSubscriberGroupInfo) == 32, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::ClosedSubscriberGroupInfo) == 8, "wrong alignment");

struct OptionalCsgInfo final {
    enum class hidl_discriminator : uint8_t {
        /**
         * If no CSG info is provided by the cell, then this structure shall be present.
         */
        noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
        /**
         * If CSG info is provided by the cell, this structure shall be present.
         */
        csgInfo = 1,  // ::android::hardware::radio::V1_5::ClosedSubscriberGroupInfo
    };

    OptionalCsgInfo();
    ~OptionalCsgInfo();
    OptionalCsgInfo(OptionalCsgInfo&&);
    OptionalCsgInfo(const OptionalCsgInfo&);
    OptionalCsgInfo& operator=(OptionalCsgInfo&&);
    OptionalCsgInfo& operator=(const OptionalCsgInfo&);

    void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
    void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
    ::android::hidl::safe_union::V1_0::Monostate& noinit();
    const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

    void csgInfo(const ::android::hardware::radio::V1_5::ClosedSubscriberGroupInfo&);
    void csgInfo(::android::hardware::radio::V1_5::ClosedSubscriberGroupInfo&&);
    ::android::hardware::radio::V1_5::ClosedSubscriberGroupInfo& csgInfo();
    const ::android::hardware::radio::V1_5::ClosedSubscriberGroupInfo& csgInfo() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::android::hardware::radio::V1_5::OptionalCsgInfo, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
        ::android::hardware::radio::V1_5::ClosedSubscriberGroupInfo csgInfo __attribute__ ((aligned(8)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::android::hardware::radio::V1_5::OptionalCsgInfo::hidl_union) == 32, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_5::OptionalCsgInfo::hidl_union) == 8, "wrong alignment");
    static_assert(sizeof(::android::hardware::radio::V1_5::OptionalCsgInfo::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_5::OptionalCsgInfo::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::android::hardware::radio::V1_5::OptionalCsgInfo) == 40, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::OptionalCsgInfo) == 8, "wrong alignment");

struct CellIdentityGsm final {
    /**
     * The fields "mcc" and "mnc" must contain the PLMN-ID of the primary PLMN of this cell.
     */
    ::android::hardware::radio::V1_2::CellIdentityGsm base __attribute__ ((aligned(8)));
    /**
     * Additional PLMN-IDs beyond the primary PLMN broadcast for this cell
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> additionalPlmns __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_5::CellIdentityGsm, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::CellIdentityGsm, additionalPlmns) == 80, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_5::CellIdentityGsm) == 96, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::CellIdentityGsm) == 8, "wrong alignment");

struct CellIdentityWcdma final {
    /**
     * The fields "mcc" and "mnc" must contain the PLMN-ID of the primary PLMN of this cell.
     */
    ::android::hardware::radio::V1_2::CellIdentityWcdma base __attribute__ ((aligned(8)));
    /**
     * Additional PLMN-IDs beyond the primary PLMN broadcast for this cell
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> additionalPlmns __attribute__ ((aligned(8)));
    /**
     * Information about any closed subscriber group ID for this cell
     */
    ::android::hardware::radio::V1_5::OptionalCsgInfo optionalCsgInfo __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_5::CellIdentityWcdma, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::CellIdentityWcdma, additionalPlmns) == 80, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::CellIdentityWcdma, optionalCsgInfo) == 96, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_5::CellIdentityWcdma) == 136, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::CellIdentityWcdma) == 8, "wrong alignment");

struct CellIdentityTdscdma final {
    /**
     * The fields "mcc" and "mnc" must contain the PLMN-ID of the primary PLMN of this cell.
     */
    ::android::hardware::radio::V1_2::CellIdentityTdscdma base __attribute__ ((aligned(8)));
    /**
     * Additional PLMN-IDs beyond the primary PLMN broadcast for this cell
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> additionalPlmns __attribute__ ((aligned(8)));
    /**
     * Information about any closed subscriber group ID for this cell
     */
    ::android::hardware::radio::V1_5::OptionalCsgInfo optionalCsgInfo __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_5::CellIdentityTdscdma, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::CellIdentityTdscdma, additionalPlmns) == 88, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::CellIdentityTdscdma, optionalCsgInfo) == 104, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_5::CellIdentityTdscdma) == 144, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::CellIdentityTdscdma) == 8, "wrong alignment");

struct CellIdentityLte final {
    /**
     * The fields "mcc" and "mnc" must contain the PLMN-ID of the primary PLMN of this cell.
     */
    ::android::hardware::radio::V1_2::CellIdentityLte base __attribute__ ((aligned(8)));
    /**
     * Additional PLMN-IDs beyond the primary PLMN broadcast for this cell
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> additionalPlmns __attribute__ ((aligned(8)));
    /**
     * Information about any closed subscriber group ID for this cell
     */
    ::android::hardware::radio::V1_5::OptionalCsgInfo optionalCsgInfo __attribute__ ((aligned(8)));
    /**
     * Bands used by the cell.
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_5::EutranBands> bands __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_5::CellIdentityLte, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::CellIdentityLte, additionalPlmns) == 88, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::CellIdentityLte, optionalCsgInfo) == 104, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::CellIdentityLte, bands) == 144, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_5::CellIdentityLte) == 160, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::CellIdentityLte) == 8, "wrong alignment");

/**
 * The CellIdentity structure should be reported once for each element of the PLMN-IdentityInfoList
 * broadcast in SIB1 CellAccessRelatedInfo as per 3GPP TS 38.331 Section 6.3.2.
 */
struct CellIdentityNr final {
    /**
     * The fields "mcc" and "mnc" must contain the PLMN-ID of the primary PLMN of this cell.
     */
    ::android::hardware::radio::V1_4::CellIdentityNr base __attribute__ ((aligned(8)));
    /**
     * Additional PLMN-IDs beyond the primary PLMN broadcast for this cell
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> additionalPlmns __attribute__ ((aligned(8)));
    /**
     * Bands used by the cell.
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_5::NgranBands> bands __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_5::CellIdentityNr, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::CellIdentityNr, additionalPlmns) == 88, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::CellIdentityNr, bands) == 104, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_5::CellIdentityNr) == 120, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::CellIdentityNr) == 8, "wrong alignment");

struct CellInfoGsm final {
    ::android::hardware::radio::V1_5::CellIdentityGsm cellIdentityGsm __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::GsmSignalStrength signalStrengthGsm __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_5::CellInfoGsm, cellIdentityGsm) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::CellInfoGsm, signalStrengthGsm) == 96, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_5::CellInfoGsm) == 112, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::CellInfoGsm) == 8, "wrong alignment");

struct CellInfoWcdma final {
    ::android::hardware::radio::V1_5::CellIdentityWcdma cellIdentityWcdma __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_2::WcdmaSignalStrength signalStrengthWcdma __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_5::CellInfoWcdma, cellIdentityWcdma) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::CellInfoWcdma, signalStrengthWcdma) == 136, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_5::CellInfoWcdma) == 152, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::CellInfoWcdma) == 8, "wrong alignment");

struct CellInfoTdscdma final {
    ::android::hardware::radio::V1_5::CellIdentityTdscdma cellIdentityTdscdma __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_2::TdscdmaSignalStrength signalStrengthTdscdma __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_5::CellInfoTdscdma, cellIdentityTdscdma) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::CellInfoTdscdma, signalStrengthTdscdma) == 144, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_5::CellInfoTdscdma) == 160, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::CellInfoTdscdma) == 8, "wrong alignment");

struct CellInfoLte final {
    ::android::hardware::radio::V1_5::CellIdentityLte cellIdentityLte __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::LteSignalStrength signalStrengthLte __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_5::CellInfoLte, cellIdentityLte) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::CellInfoLte, signalStrengthLte) == 160, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_5::CellInfoLte) == 184, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::CellInfoLte) == 8, "wrong alignment");

struct CellInfoNr final {
    ::android::hardware::radio::V1_5::CellIdentityNr cellIdentityNr __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_4::NrSignalStrength signalStrengthNr __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_5::CellInfoNr, cellIdentityNr) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::CellInfoNr, signalStrengthNr) == 120, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_5::CellInfoNr) == 144, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::CellInfoNr) == 8, "wrong alignment");

struct CellInfo final {
    // Forward declaration for forward reference support:
    struct CellInfoRatSpecificInfo;

    struct CellInfoRatSpecificInfo final {
        enum class hidl_discriminator : uint8_t {
            /**
             * 3gpp CellInfo types.
             */
            gsm = 0,  // ::android::hardware::radio::V1_5::CellInfoGsm
            wcdma = 1,  // ::android::hardware::radio::V1_5::CellInfoWcdma
            tdscdma = 2,  // ::android::hardware::radio::V1_5::CellInfoTdscdma
            lte = 3,  // ::android::hardware::radio::V1_5::CellInfoLte
            nr = 4,  // ::android::hardware::radio::V1_5::CellInfoNr
            /**
             * 3gpp2 CellInfo types;
             */
            cdma = 5,  // ::android::hardware::radio::V1_2::CellInfoCdma
        };

        CellInfoRatSpecificInfo();
        ~CellInfoRatSpecificInfo();
        CellInfoRatSpecificInfo(CellInfoRatSpecificInfo&&);
        CellInfoRatSpecificInfo(const CellInfoRatSpecificInfo&);
        CellInfoRatSpecificInfo& operator=(CellInfoRatSpecificInfo&&);
        CellInfoRatSpecificInfo& operator=(const CellInfoRatSpecificInfo&);

        void gsm(const ::android::hardware::radio::V1_5::CellInfoGsm&);
        void gsm(::android::hardware::radio::V1_5::CellInfoGsm&&);
        ::android::hardware::radio::V1_5::CellInfoGsm& gsm();
        const ::android::hardware::radio::V1_5::CellInfoGsm& gsm() const;

        void wcdma(const ::android::hardware::radio::V1_5::CellInfoWcdma&);
        void wcdma(::android::hardware::radio::V1_5::CellInfoWcdma&&);
        ::android::hardware::radio::V1_5::CellInfoWcdma& wcdma();
        const ::android::hardware::radio::V1_5::CellInfoWcdma& wcdma() const;

        void tdscdma(const ::android::hardware::radio::V1_5::CellInfoTdscdma&);
        void tdscdma(::android::hardware::radio::V1_5::CellInfoTdscdma&&);
        ::android::hardware::radio::V1_5::CellInfoTdscdma& tdscdma();
        const ::android::hardware::radio::V1_5::CellInfoTdscdma& tdscdma() const;

        void lte(const ::android::hardware::radio::V1_5::CellInfoLte&);
        void lte(::android::hardware::radio::V1_5::CellInfoLte&&);
        ::android::hardware::radio::V1_5::CellInfoLte& lte();
        const ::android::hardware::radio::V1_5::CellInfoLte& lte() const;

        void nr(const ::android::hardware::radio::V1_5::CellInfoNr&);
        void nr(::android::hardware::radio::V1_5::CellInfoNr&&);
        ::android::hardware::radio::V1_5::CellInfoNr& nr();
        const ::android::hardware::radio::V1_5::CellInfoNr& nr() const;

        void cdma(const ::android::hardware::radio::V1_2::CellInfoCdma&);
        void cdma(::android::hardware::radio::V1_2::CellInfoCdma&&);
        ::android::hardware::radio::V1_2::CellInfoCdma& cdma();
        const ::android::hardware::radio::V1_2::CellInfoCdma& cdma() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::radio::V1_5::CellInfo::CellInfoRatSpecificInfo, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hardware::radio::V1_5::CellInfoGsm gsm __attribute__ ((aligned(8)));
            ::android::hardware::radio::V1_5::CellInfoWcdma wcdma __attribute__ ((aligned(8)));
            ::android::hardware::radio::V1_5::CellInfoTdscdma tdscdma __attribute__ ((aligned(8)));
            ::android::hardware::radio::V1_5::CellInfoLte lte __attribute__ ((aligned(8)));
            ::android::hardware::radio::V1_5::CellInfoNr nr __attribute__ ((aligned(8)));
            ::android::hardware::radio::V1_2::CellInfoCdma cdma __attribute__ ((aligned(8)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::radio::V1_5::CellInfo::CellInfoRatSpecificInfo::hidl_union) == 184, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_5::CellInfo::CellInfoRatSpecificInfo::hidl_union) == 8, "wrong alignment");
        static_assert(sizeof(::android::hardware::radio::V1_5::CellInfo::CellInfoRatSpecificInfo::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_5::CellInfo::CellInfoRatSpecificInfo::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::radio::V1_5::CellInfo::CellInfoRatSpecificInfo) == 192, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_5::CellInfo::CellInfoRatSpecificInfo) == 8, "wrong alignment");

    /**
     * True if this cell is registered false if not registered.
     */
    bool registered __attribute__ ((aligned(1)));
    /**
     * Type of time stamp represented by timeStamp.
     */
    ::android::hardware::radio::V1_0::TimeStampType timeStampType __attribute__ ((aligned(4)));
    /**
     * Time in nanos as returned by ril_nano_time.
     */
    uint64_t timeStamp __attribute__ ((aligned(8)));
    /**
     * Connection status for the cell.
     */
    ::android::hardware::radio::V1_2::CellConnectionStatus connectionStatus __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_5::CellInfo::CellInfoRatSpecificInfo ratSpecificInfo __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_5::CellInfo, registered) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::CellInfo, timeStampType) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::CellInfo, timeStamp) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::CellInfo, connectionStatus) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::CellInfo, ratSpecificInfo) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_5::CellInfo) == 216, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::CellInfo) == 8, "wrong alignment");

/**
 * A union representing the CellIdentity of a single cell.
 */
struct CellIdentity final {
    enum class hidl_discriminator : uint8_t {
        noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
        gsm = 1,  // ::android::hardware::radio::V1_5::CellIdentityGsm
        wcdma = 2,  // ::android::hardware::radio::V1_5::CellIdentityWcdma
        tdscdma = 3,  // ::android::hardware::radio::V1_5::CellIdentityTdscdma
        cdma = 4,  // ::android::hardware::radio::V1_2::CellIdentityCdma
        lte = 5,  // ::android::hardware::radio::V1_5::CellIdentityLte
        nr = 6,  // ::android::hardware::radio::V1_5::CellIdentityNr
    };

    CellIdentity();
    ~CellIdentity();
    CellIdentity(CellIdentity&&);
    CellIdentity(const CellIdentity&);
    CellIdentity& operator=(CellIdentity&&);
    CellIdentity& operator=(const CellIdentity&);

    void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
    void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
    ::android::hidl::safe_union::V1_0::Monostate& noinit();
    const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

    void gsm(const ::android::hardware::radio::V1_5::CellIdentityGsm&);
    void gsm(::android::hardware::radio::V1_5::CellIdentityGsm&&);
    ::android::hardware::radio::V1_5::CellIdentityGsm& gsm();
    const ::android::hardware::radio::V1_5::CellIdentityGsm& gsm() const;

    void wcdma(const ::android::hardware::radio::V1_5::CellIdentityWcdma&);
    void wcdma(::android::hardware::radio::V1_5::CellIdentityWcdma&&);
    ::android::hardware::radio::V1_5::CellIdentityWcdma& wcdma();
    const ::android::hardware::radio::V1_5::CellIdentityWcdma& wcdma() const;

    void tdscdma(const ::android::hardware::radio::V1_5::CellIdentityTdscdma&);
    void tdscdma(::android::hardware::radio::V1_5::CellIdentityTdscdma&&);
    ::android::hardware::radio::V1_5::CellIdentityTdscdma& tdscdma();
    const ::android::hardware::radio::V1_5::CellIdentityTdscdma& tdscdma() const;

    void cdma(const ::android::hardware::radio::V1_2::CellIdentityCdma&);
    void cdma(::android::hardware::radio::V1_2::CellIdentityCdma&&);
    ::android::hardware::radio::V1_2::CellIdentityCdma& cdma();
    const ::android::hardware::radio::V1_2::CellIdentityCdma& cdma() const;

    void lte(const ::android::hardware::radio::V1_5::CellIdentityLte&);
    void lte(::android::hardware::radio::V1_5::CellIdentityLte&&);
    ::android::hardware::radio::V1_5::CellIdentityLte& lte();
    const ::android::hardware::radio::V1_5::CellIdentityLte& lte() const;

    void nr(const ::android::hardware::radio::V1_5::CellIdentityNr&);
    void nr(::android::hardware::radio::V1_5::CellIdentityNr&&);
    ::android::hardware::radio::V1_5::CellIdentityNr& nr();
    const ::android::hardware::radio::V1_5::CellIdentityNr& nr() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::android::hardware::radio::V1_5::CellIdentity, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
        ::android::hardware::radio::V1_5::CellIdentityGsm gsm __attribute__ ((aligned(8)));
        ::android::hardware::radio::V1_5::CellIdentityWcdma wcdma __attribute__ ((aligned(8)));
        ::android::hardware::radio::V1_5::CellIdentityTdscdma tdscdma __attribute__ ((aligned(8)));
        ::android::hardware::radio::V1_2::CellIdentityCdma cdma __attribute__ ((aligned(8)));
        ::android::hardware::radio::V1_5::CellIdentityLte lte __attribute__ ((aligned(8)));
        ::android::hardware::radio::V1_5::CellIdentityNr nr __attribute__ ((aligned(8)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::android::hardware::radio::V1_5::CellIdentity::hidl_union) == 160, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_5::CellIdentity::hidl_union) == 8, "wrong alignment");
    static_assert(sizeof(::android::hardware::radio::V1_5::CellIdentity::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_5::CellIdentity::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::android::hardware::radio::V1_5::CellIdentity) == 168, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::CellIdentity) == 8, "wrong alignment");

struct BarringInfo final {
    // Forward declaration for forward reference support:
    enum class ServiceType : int32_t;
    enum class BarringType : int32_t;
    struct BarringTypeSpecificInfo;

    enum class ServiceType : int32_t {
        /**
         * Applicable to UTRAN
         *
         *
         * Barring for all CS services, including registration
         */
        CS_SERVICE = 0,
        /**
         * Barring for all PS services, including registration
         */
        PS_SERVICE = 1 /* ::android::hardware::radio::V1_5::BarringInfo::ServiceType.CS_SERVICE implicitly + 1 */,
        /**
         * Barring for mobile-originated circuit-switched voice calls
         */
        CS_VOICE = 2 /* ::android::hardware::radio::V1_5::BarringInfo::ServiceType.PS_SERVICE implicitly + 1 */,
        /**
         * Applicable to EUTRAN, NGRAN
         *
         *
         * Barring for mobile-originated signalling for any purpose
         */
        MO_SIGNALLING = 3 /* ::android::hardware::radio::V1_5::BarringInfo::ServiceType.CS_VOICE implicitly + 1 */,
        /**
         * Barring for mobile-originated internet or other interactive data
         */
        MO_DATA = 4 /* ::android::hardware::radio::V1_5::BarringInfo::ServiceType.MO_SIGNALLING implicitly + 1 */,
        /**
         * Barring for circuit-switched fallback calling
         */
        CS_FALLBACK = 5 /* ::android::hardware::radio::V1_5::BarringInfo::ServiceType.MO_DATA implicitly + 1 */,
        /**
         * Barring for IMS voice calling
         */
        MMTEL_VOICE = 6 /* ::android::hardware::radio::V1_5::BarringInfo::ServiceType.CS_FALLBACK implicitly + 1 */,
        /**
         * Barring for IMS video calling
         */
        MMTEL_VIDEO = 7 /* ::android::hardware::radio::V1_5::BarringInfo::ServiceType.MMTEL_VOICE implicitly + 1 */,
        /**
         * Applicable to UTRAN, EUTRAN, NGRAN
         *
         *
         * Barring for emergency services, either CS or emergency MMTEL
         */
        EMERGENCY = 8 /* ::android::hardware::radio::V1_5::BarringInfo::ServiceType.MMTEL_VIDEO implicitly + 1 */,
        /**
         * Barring for short message services
         */
        SMS = 9 /* ::android::hardware::radio::V1_5::BarringInfo::ServiceType.EMERGENCY implicitly + 1 */,
        /**
         * Operator-specific barring codes; applicable to NGRAN
         */
        OPERATOR_1 = 1001,
        OPERATOR_2 = 1002,
        OPERATOR_3 = 1003,
        OPERATOR_4 = 1004,
        OPERATOR_5 = 1005,
        OPERATOR_6 = 1006,
        OPERATOR_7 = 1007,
        OPERATOR_8 = 1008,
        OPERATOR_9 = 1009,
        OPERATOR_10 = 1010,
        OPERATOR_11 = 1011,
        OPERATOR_12 = 1012,
        OPERATOR_13 = 1013,
        OPERATOR_14 = 1014,
        OPERATOR_15 = 1015,
        OPERATOR_16 = 1016,
        OPERATOR_17 = 1017,
        OPERATOR_18 = 1018,
        OPERATOR_19 = 1019,
        OPERATOR_20 = 1020,
        OPERATOR_21 = 1021,
        OPERATOR_22 = 1022,
        OPERATOR_23 = 1023,
        OPERATOR_24 = 1024,
        OPERATOR_25 = 1025,
        OPERATOR_26 = 1026,
        OPERATOR_27 = 1027,
        OPERATOR_28 = 1028,
        OPERATOR_29 = 1029,
        OPERATOR_30 = 1030,
        OPERATOR_31 = 1031,
        OPERATOR_32 = 1032,
    };

    enum class BarringType : int32_t {
        /**
         * Device is not barred for the given service
         */
        NONE = 0,
        /**
         * Device may be barred based on time and probability factors
         */
        CONDITIONAL = 1 /* ::android::hardware::radio::V1_5::BarringInfo::BarringType.NONE implicitly + 1 */,
        /*
         * Device is unconditionally barred
         */
        UNCONDITIONAL = 2 /* ::android::hardware::radio::V1_5::BarringInfo::BarringType.CONDITIONAL implicitly + 1 */,
    };

    struct BarringTypeSpecificInfo final {
        // Forward declaration for forward reference support:
        struct Conditional;

        struct Conditional final {
            /**
             * The barring factor as a percentage 0-100
             */
            int32_t factor __attribute__ ((aligned(4)));
            /**
             * The number of seconds between re-evaluations of barring
             */
            int32_t timeSeconds __attribute__ ((aligned(4)));
            /**
             * Indicates whether barring is currently being applied.
             *
             * <p>True if the UE applies barring to a conditionally barred
             * service based on the conditional barring parameters.
             *
             * <p>False if the service is conditionally barred but barring
             * is not currently applied, which could be due to either the
             * barring criteria not having been evaluated (if the UE has not
             * attempted to use the service) or due to the criteria being
             * evaluated and the UE being permitted to use the service
             * despite conditional barring.
             */
            bool isBarred __attribute__ ((aligned(1)));
        };

        static_assert(offsetof(::android::hardware::radio::V1_5::BarringInfo::BarringTypeSpecificInfo::Conditional, factor) == 0, "wrong offset");
        static_assert(offsetof(::android::hardware::radio::V1_5::BarringInfo::BarringTypeSpecificInfo::Conditional, timeSeconds) == 4, "wrong offset");
        static_assert(offsetof(::android::hardware::radio::V1_5::BarringInfo::BarringTypeSpecificInfo::Conditional, isBarred) == 8, "wrong offset");
        static_assert(sizeof(::android::hardware::radio::V1_5::BarringInfo::BarringTypeSpecificInfo::Conditional) == 12, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_5::BarringInfo::BarringTypeSpecificInfo::Conditional) == 4, "wrong alignment");

        enum class hidl_discriminator : uint8_t {
            /**
             * Barring type is either none or unconditional
             */
            noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
            /**
             * Must be included if barring is conditional
             */
            conditional = 1,  // ::android::hardware::radio::V1_5::BarringInfo::BarringTypeSpecificInfo::Conditional
        };

        BarringTypeSpecificInfo();
        ~BarringTypeSpecificInfo();
        BarringTypeSpecificInfo(BarringTypeSpecificInfo&&);
        BarringTypeSpecificInfo(const BarringTypeSpecificInfo&);
        BarringTypeSpecificInfo& operator=(BarringTypeSpecificInfo&&);
        BarringTypeSpecificInfo& operator=(const BarringTypeSpecificInfo&);

        void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
        void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
        ::android::hidl::safe_union::V1_0::Monostate& noinit();
        const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

        void conditional(const ::android::hardware::radio::V1_5::BarringInfo::BarringTypeSpecificInfo::Conditional&);
        void conditional(::android::hardware::radio::V1_5::BarringInfo::BarringTypeSpecificInfo::Conditional&&);
        ::android::hardware::radio::V1_5::BarringInfo::BarringTypeSpecificInfo::Conditional& conditional();
        const ::android::hardware::radio::V1_5::BarringInfo::BarringTypeSpecificInfo::Conditional& conditional() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::radio::V1_5::BarringInfo::BarringTypeSpecificInfo, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
            ::android::hardware::radio::V1_5::BarringInfo::BarringTypeSpecificInfo::Conditional conditional __attribute__ ((aligned(4)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::radio::V1_5::BarringInfo::BarringTypeSpecificInfo::hidl_union) == 12, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_5::BarringInfo::BarringTypeSpecificInfo::hidl_union) == 4, "wrong alignment");
        static_assert(sizeof(::android::hardware::radio::V1_5::BarringInfo::BarringTypeSpecificInfo::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_5::BarringInfo::BarringTypeSpecificInfo::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::radio::V1_5::BarringInfo::BarringTypeSpecificInfo) == 16, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_5::BarringInfo::BarringTypeSpecificInfo) == 4, "wrong alignment");

    /**
     * Combined list of barring services for UTRAN, EUTRAN, and NGRAN.
     *
     * Barring information is defined in:
     * -UTRAN - 3gpp 25.331 Sec 10.2.48.8.6.
     * -EUTRAN - 3gpp 36.331 Sec 6.3.1 SystemInformationBlockType2
     * -NGRAN - 3gpp 38.331 Sec 6.3.2 UAC-BarringInfo and 22.261 Sec 6.22.2.[2-3]
     */
    ::android::hardware::radio::V1_5::BarringInfo::ServiceType serviceType __attribute__ ((aligned(4)));
    /**
     * The type of barring applied to the service
     */
    ::android::hardware::radio::V1_5::BarringInfo::BarringType barringType __attribute__ ((aligned(4)));
    /**
     * Type-specific barring info if applicable
     */
    ::android::hardware::radio::V1_5::BarringInfo::BarringTypeSpecificInfo barringTypeSpecificInfo __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_5::BarringInfo, serviceType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::BarringInfo, barringType) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::BarringInfo, barringTypeSpecificInfo) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_5::BarringInfo) == 24, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::BarringInfo) == 4, "wrong alignment");

enum class IndicationFilter : int32_t {
    NONE = 0,
    ALL = -1 /* ~0 */,
    /**
     * When this bit is set, modem must send the signal strength update through
     * IRadioIndication.currentSignalStrength() when all criteria specified by
     * IRadio.setSignalStrengthReportingCriteria() are met.
     */
    SIGNAL_STRENGTH = 1 /* 1 << 0 */,
    /**
     * When this bit is set, modem must invoke IRadioIndication.networkStateChanged() when any field
     * in VoiceRegStateResult or DataRegStateResult changes. When this bit is not set, modem must
     * suppress IRadioIndication.networkStateChanged() when there are only changes from
     * insignificant fields. Modem must invoke IRadioIndication.networkStateChanged() when
     * significant fields are updated regardless of whether this bit is set.
     *
     * The following fields are considered significant: VoiceRegStateResult.regState,
     * VoiceRegStateResult.rat, DataRegStateResult.regState, DataRegStateResult.rat.
     */
    FULL_NETWORK_STATE = 2 /* 1 << 1 */,
    /**
     * When this bit is set, modem must send IRadioIndication.dataCallListChanged() whenever any
     * field in ITypes.SetupDataCallResult changes. When this bit is not set, modem must suppress
     * the indication when the only changed field is 'active' (for data dormancy). For all other
     * field changes, the modem must send IRadioIndication.dataCallListChanged() regardless of
     * whether this bit is set.
     */
    DATA_CALL_DORMANCY_CHANGED = 4 /* 1 << 2 */,
    /**
     * When this bit is set, modem must send the link capacity update through
     * IRadioIndication.currentLinkCapacityEstimate() when all criteria specified by
     * IRadio.setLinkCapacityReportingCriteria() are met.
     */
    LINK_CAPACITY_ESTIMATE = 8 /* 1 << 3 */,
    /**
     * When this bit is set, the modem must send the physical channel configuration update through
     * IRadioIndication.currentPhysicalChannelConfigs() when the configuration has changed. It is
     * recommended that this be reported whenever link capacity or signal strength is reported.
     */
    PHYSICAL_CHANNEL_CONFIG = 16 /* 1 << 4 */,
    /**
     * Control the unsolicited sending of registration failure reports via onRegistrationFailed
     */
    REGISTRATION_FAILURE = 32 /* 1 << 5 */,
    /**
     * Control the unsolicited sending of barring info updates via onBarringInfo
     */
    BARRING_INFO = 64 /* 1 << 6 */,
};

/**
 * Call fail causes for Circuit-switched service enumerated in 3GPP TS 24.008, 10.5.3.6 and
 * 10.5.147. Additional detail is available in 3GPP TS 24.008 Annex G.
 */
enum class RegistrationFailCause : int32_t {
    /**
     * 0 - None
     */
    NONE = 0,
    /**
     * 2 - IMSI unknown in HLR
     */
    IMSI_UNKNOWN_IN_HLR = 2,
    /**
     * 3 - Illegal MS
     */
    ILLEGAL_MS = 3,
    /**
     * 4 - Illegal ME
     */
    IMSI_UNKNOWN_IN_VLR = 4,
    /**
     * 5 - PLMN not allowed
     */
    IMEI_NOT_ACCEPTED = 5,
    /**
     * 6 - Location area not allowed
     */
    ILLEGAL_ME = 6,
    /**
     * 7 - Roaming not allowed
     */
    GPRS_SERVICES_NOT_ALLOWED = 7,
    /**
     * 8 - No Suitable Cells in this Location Area
     */
    GPRS_AND_NON_GPRS_SERVICES_NOT_ALLOWED = 8,
    /**
     * 9 - Network failure
     */
    MS_IDENTITY_CANNOT_BE_DERIVED_BY_NETWORK = 9,
    /**
     * 10 - Persistent location update reject
     */
    IMPLICITLY_DETACHED = 10,
    /**
     * 11 - PLMN not allowed
     */
    PLMN_NOT_ALLOWED = 11,
    /**
     * 12 - Location area not allowed
     */
    LOCATION_AREA_NOT_ALLOWED = 12,
    /**
     * 13 - Roaming not allowed in this Location Area
     */
    ROAMING_NOT_ALLOWED = 13,
    /**
     * 14 - GPRS Services not allowed in this PLMN
     */
    GPRS_SERVICES_NOT_ALLOWED_IN_PLMN = 14,
    /**
     * 15 - No Suitable Cells in this Location Area
     */
    NO_SUITABLE_CELLS = 15,
    /**
     * 16 - MSC temporarily not reachable
     */
    MSC_TEMPORARILY_NOT_REACHABLE = 15,
    /**
     * 17 - Network Failure
     */
    NETWORK_FAILURE = 17,
    /**
     * 20 - MAC Failure
     */
    MAC_FAILURE = 20,
    /**
     * 21 - Sync Failure
     */
    SYNC_FAILURE = 21,
    /**
     * 22 - Congestion
     */
    CONGESTION = 22,
    /**
     * 23 - GSM Authentication unacceptable
     */
    GSM_AUTHENTICATION_UNACCEPTABLE = 23,
    /**
     * 25 - Not Authorized for this CSG
     */
    NOT_AUTHORIZED_FOR_THIS_CSG = 25,
    /**
     * 28 SMS provided via GPRS in this routing area
     */
    SMS_PROVIDED_BY_GPRS_IN_ROUTING_AREA = 26 /* ::android::hardware::radio::V1_5::RegistrationFailCause.NOT_AUTHORIZED_FOR_THIS_CSG implicitly + 1 */,
    /**
     * 32 - Service option not supported
     */
    SERVICE_OPTION_NOT_SUPPORTED = 32,
    /**
     * 33 - Requested service option not subscribed
     */
    SERVICE_OPTION_NOT_SUBSCRIBED = 33,
    /**
     * 34 - Service option temporarily out of order
     */
    SERVICE_OPTION_TEMPORARILY_OUT_OF_ORDER = 34,
    /**
     * 38 - Call cannot be identified
     */
    CALL_CANNOT_BE_IDENTIFIED = 38,
    /**
     * 40 No PDP context activated
     */
    NO_PDP_CONTEXT_ACTIVATED = 40,
    /**
     * 48-63 - Retry upon entry into a new cell
     */
    RETRY_UPON_ENTRY_INTO_NEW_CELL_1 = 48,
    RETRY_UPON_ENTRY_INTO_NEW_CELL_2 = 49,
    RETRY_UPON_ENTRY_INTO_NEW_CELL_3 = 50,
    RETRY_UPON_ENTRY_INTO_NEW_CELL_4 = 51,
    RETRY_UPON_ENTRY_INTO_NEW_CELL_5 = 52,
    RETRY_UPON_ENTRY_INTO_NEW_CELL_6 = 53,
    RETRY_UPON_ENTRY_INTO_NEW_CELL_7 = 54,
    RETRY_UPON_ENTRY_INTO_NEW_CELL_8 = 55,
    RETRY_UPON_ENTRY_INTO_NEW_CELL_9 = 56,
    RETRY_UPON_ENTRY_INTO_NEW_CELL_10 = 57,
    RETRY_UPON_ENTRY_INTO_NEW_CELL_11 = 58,
    RETRY_UPON_ENTRY_INTO_NEW_CELL_12 = 59,
    RETRY_UPON_ENTRY_INTO_NEW_CELL_13 = 60,
    RETRY_UPON_ENTRY_INTO_NEW_CELL_14 = 61,
    RETRY_UPON_ENTRY_INTO_NEW_CELL_15 = 62,
    RETRY_UPON_ENTRY_INTO_NEW_CELL_16 = 63,
    /**
     * 95 - Semantically incorrect message
     */
    SEMANTICALLY_INCORRECT_MESSAGE = 95,
    /**
     * 96 - Invalid mandatory information
     */
    INVALID_MANDATORY_INFORMATION = 96,
    /**
     * 97 - Message type non-existent or not implemented
     */
    MESSAGE_TYPE_NON_EXISTENT_OR_NOT_IMPLEMENTED = 97,
    /**
     * 98 - Message type not compatible with protocol state
     */
    MESSAGE_TYPE_NOT_COMPATIBLE_WITH_PROTOCOL_STATE = 98,
    /**
     * 99 - Information element non-existent or not implemented
     */
    INFORMATION_ELEMENT_NON_EXISTENT_OR_NOT_IMPLEMENTED = 99,
    /**
     * 100 - Conditional IE error
     */
    CONDITIONAL_IE_ERROR = 100,
    /**
     * 101 - Message not compatible with protocol state
     */
    MESSAGE_NOT_COMPATIBLE_WITH_PROTOCOL_STATE = 101,
    /**
     * 111 - Protocol error, unspecified
     */
    PROTOCOL_ERROR_UNSPECIFIED = 111,
};

enum class PrlIndicator : int32_t {
    NOT_REGISTERED = -1 /* -1 */,
    NOT_IN_PRL = 0,
    IN_PRL = 1,
};

struct RegStateResult final {
    // Forward declaration for forward reference support:
    struct AccessTechnologySpecificInfo;

    struct AccessTechnologySpecificInfo final {
        // Forward declaration for forward reference support:
        struct Cdma2000RegistrationInfo;
        struct EutranRegistrationInfo;

        struct Cdma2000RegistrationInfo final {
            /**
             * Concurrent services support indicator. if registered on a CDMA system.
             * false - Concurrent services not supported,
             * true - Concurrent services supported
             */
            bool cssSupported __attribute__ ((aligned(1)));
            /**
             * TSB-58 Roaming Indicator if registered on a CDMA or EVDO system or -1 if not.
             * Valid values are 0-255.
             */
            int32_t roamingIndicator __attribute__ ((aligned(4)));
            /**
             * Indicates whether the current system is in the PRL if registered on a CDMA or EVDO
             * system or -1 if not. 0=not in the PRL, 1=in the PRL.
             */
            ::android::hardware::radio::V1_5::PrlIndicator systemIsInPrl __attribute__ ((aligned(4)));
            /**
             * Default Roaming Indicator from the PRL if registered on a CDMA or EVDO system or -1
             * if not.
             * Valid values are 0-255.
             */
            int32_t defaultRoamingIndicator __attribute__ ((aligned(4)));
        };

        static_assert(offsetof(::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::Cdma2000RegistrationInfo, cssSupported) == 0, "wrong offset");
        static_assert(offsetof(::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::Cdma2000RegistrationInfo, roamingIndicator) == 4, "wrong offset");
        static_assert(offsetof(::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::Cdma2000RegistrationInfo, systemIsInPrl) == 8, "wrong offset");
        static_assert(offsetof(::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::Cdma2000RegistrationInfo, defaultRoamingIndicator) == 12, "wrong offset");
        static_assert(sizeof(::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::Cdma2000RegistrationInfo) == 16, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::Cdma2000RegistrationInfo) == 4, "wrong alignment");

        struct EutranRegistrationInfo final {
            /**
             * Network capabilities for voice over PS services. This info is valid only on LTE
             * network and must be present when device is camped on LTE. VopsInfo must be empty when
             * device is camped only on 2G/3G.
             */
            ::android::hardware::radio::V1_4::LteVopsInfo lteVopsInfo __attribute__ ((aligned(1)));
            /**
             * The parameters of NR 5G Non-Standalone. This value is only valid on E-UTRAN,
             * otherwise must be empty.
             */
            ::android::hardware::radio::V1_4::NrIndicators nrIndicators __attribute__ ((aligned(1)));
        };

        static_assert(offsetof(::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::EutranRegistrationInfo, lteVopsInfo) == 0, "wrong offset");
        static_assert(offsetof(::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::EutranRegistrationInfo, nrIndicators) == 2, "wrong offset");
        static_assert(sizeof(::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::EutranRegistrationInfo) == 5, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::EutranRegistrationInfo) == 1, "wrong alignment");

        enum class hidl_discriminator : uint8_t {
            noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
            cdmaInfo = 1,  // ::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::Cdma2000RegistrationInfo
            eutranInfo = 2,  // ::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::EutranRegistrationInfo
        };

        AccessTechnologySpecificInfo();
        ~AccessTechnologySpecificInfo();
        AccessTechnologySpecificInfo(AccessTechnologySpecificInfo&&);
        AccessTechnologySpecificInfo(const AccessTechnologySpecificInfo&);
        AccessTechnologySpecificInfo& operator=(AccessTechnologySpecificInfo&&);
        AccessTechnologySpecificInfo& operator=(const AccessTechnologySpecificInfo&);

        void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
        void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
        ::android::hidl::safe_union::V1_0::Monostate& noinit();
        const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

        void cdmaInfo(const ::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::Cdma2000RegistrationInfo&);
        void cdmaInfo(::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::Cdma2000RegistrationInfo&&);
        ::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::Cdma2000RegistrationInfo& cdmaInfo();
        const ::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::Cdma2000RegistrationInfo& cdmaInfo() const;

        void eutranInfo(const ::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::EutranRegistrationInfo&);
        void eutranInfo(::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::EutranRegistrationInfo&&);
        ::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::EutranRegistrationInfo& eutranInfo();
        const ::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::EutranRegistrationInfo& eutranInfo() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
            ::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::Cdma2000RegistrationInfo cdmaInfo __attribute__ ((aligned(4)));
            ::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::EutranRegistrationInfo eutranInfo __attribute__ ((aligned(1)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::hidl_union) == 16, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::hidl_union) == 4, "wrong alignment");
        static_assert(sizeof(::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo) == 20, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo) == 4, "wrong alignment");

    /**
     * Registration state
     *
     * If the RAT is indicated as a GERAN, UTRAN, or CDMA2000 technology, this value reports
     * registration in the Circuit-switched domain.
     * If the RAT is indicated as an EUTRAN, NGRAN, or another technology that does not support
     * circuit-switched services, this value reports registration in the Packet-switched domain.
     */
    ::android::hardware::radio::V1_0::RegState regState __attribute__ ((aligned(4)));
    /**
     * Indicates the available voice radio technology, valid values as
     * defined by RadioTechnology.
     */
    ::android::hardware::radio::V1_4::RadioTechnology rat __attribute__ ((aligned(4)));
    /**
     * Cause code reported by the network in case registration fails. This will be a mobility
     * management cause code defined for MM, GMM, MME or equivalent as appropriate for the RAT.
     */
    ::android::hardware::radio::V1_5::RegistrationFailCause reasonForDenial __attribute__ ((aligned(4)));
    /**
     * CellIdentity
     */
    ::android::hardware::radio::V1_5::CellIdentity cellIdentity __attribute__ ((aligned(8)));
    /**
     * The most-recent PLMN-ID upon which the UE registered (or attempted to register if a failure
     * is reported in the reasonForDenial field). This PLMN shall be in standard format consisting
     * of a 3 digit MCC concatenated with a 2 or 3 digit MNC.
     */
    ::android::hardware::hidl_string registeredPlmn __attribute__ ((aligned(8)));
    /**
     * Access-technology-specific registration information, such as for CDMA2000.
     */
    ::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo accessTechnologySpecificInfo __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_5::RegStateResult, regState) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::RegStateResult, rat) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::RegStateResult, reasonForDenial) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::RegStateResult, cellIdentity) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::RegStateResult, registeredPlmn) == 184, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::RegStateResult, accessTechnologySpecificInfo) == 200, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_5::RegStateResult) == 224, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::RegStateResult) == 8, "wrong alignment");

/**
 * Overwritten from @1.4::NetworkScanResult in order to update the CellInfo to 1.5 version.
 */
struct NetworkScanResult final {
    /**
     * The status of the scan.
     */
    ::android::hardware::radio::V1_1::ScanStatus status __attribute__ ((aligned(4)));
    /**
     * The error code of the incremental result.
     */
    ::android::hardware::radio::V1_0::RadioError error __attribute__ ((aligned(4)));
    /**
     * List of network information as CellInfo.
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_5::CellInfo> networkInfos __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_5::NetworkScanResult, status) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::NetworkScanResult, error) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::NetworkScanResult, networkInfos) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_5::NetworkScanResult) == 24, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::NetworkScanResult) == 8, "wrong alignment");

/**
 * Additional personalization categories in addition to those specified in 3GPP TS 22.022 and
 * 3GPP2 C.S0068-0.
 */
enum class PersoSubstate : int32_t {
    UNKNOWN = 0,
    IN_PROGRESS = 1 /* ::android::hardware::radio::V1_0::PersoSubstate.UNKNOWN implicitly + 1 */,
    READY = 2 /* ::android::hardware::radio::V1_0::PersoSubstate.IN_PROGRESS implicitly + 1 */,
    SIM_NETWORK = 3 /* ::android::hardware::radio::V1_0::PersoSubstate.READY implicitly + 1 */,
    SIM_NETWORK_SUBSET = 4 /* ::android::hardware::radio::V1_0::PersoSubstate.SIM_NETWORK implicitly + 1 */,
    SIM_CORPORATE = 5 /* ::android::hardware::radio::V1_0::PersoSubstate.SIM_NETWORK_SUBSET implicitly + 1 */,
    SIM_SERVICE_PROVIDER = 6 /* ::android::hardware::radio::V1_0::PersoSubstate.SIM_CORPORATE implicitly + 1 */,
    SIM_SIM = 7 /* ::android::hardware::radio::V1_0::PersoSubstate.SIM_SERVICE_PROVIDER implicitly + 1 */,
    SIM_NETWORK_PUK = 8 /* ::android::hardware::radio::V1_0::PersoSubstate.SIM_SIM implicitly + 1 */,
    SIM_NETWORK_SUBSET_PUK = 9 /* ::android::hardware::radio::V1_0::PersoSubstate.SIM_NETWORK_PUK implicitly + 1 */,
    SIM_CORPORATE_PUK = 10 /* ::android::hardware::radio::V1_0::PersoSubstate.SIM_NETWORK_SUBSET_PUK implicitly + 1 */,
    SIM_SERVICE_PROVIDER_PUK = 11 /* ::android::hardware::radio::V1_0::PersoSubstate.SIM_CORPORATE_PUK implicitly + 1 */,
    SIM_SIM_PUK = 12 /* ::android::hardware::radio::V1_0::PersoSubstate.SIM_SERVICE_PROVIDER_PUK implicitly + 1 */,
    RUIM_NETWORK1 = 13 /* ::android::hardware::radio::V1_0::PersoSubstate.SIM_SIM_PUK implicitly + 1 */,
    RUIM_NETWORK2 = 14 /* ::android::hardware::radio::V1_0::PersoSubstate.RUIM_NETWORK1 implicitly + 1 */,
    RUIM_HRPD = 15 /* ::android::hardware::radio::V1_0::PersoSubstate.RUIM_NETWORK2 implicitly + 1 */,
    RUIM_CORPORATE = 16 /* ::android::hardware::radio::V1_0::PersoSubstate.RUIM_HRPD implicitly + 1 */,
    RUIM_SERVICE_PROVIDER = 17 /* ::android::hardware::radio::V1_0::PersoSubstate.RUIM_CORPORATE implicitly + 1 */,
    RUIM_RUIM = 18 /* ::android::hardware::radio::V1_0::PersoSubstate.RUIM_SERVICE_PROVIDER implicitly + 1 */,
    RUIM_NETWORK1_PUK = 19 /* ::android::hardware::radio::V1_0::PersoSubstate.RUIM_RUIM implicitly + 1 */,
    RUIM_NETWORK2_PUK = 20 /* ::android::hardware::radio::V1_0::PersoSubstate.RUIM_NETWORK1_PUK implicitly + 1 */,
    RUIM_HRPD_PUK = 21 /* ::android::hardware::radio::V1_0::PersoSubstate.RUIM_NETWORK2_PUK implicitly + 1 */,
    RUIM_CORPORATE_PUK = 22 /* ::android::hardware::radio::V1_0::PersoSubstate.RUIM_HRPD_PUK implicitly + 1 */,
    RUIM_SERVICE_PROVIDER_PUK = 23 /* ::android::hardware::radio::V1_0::PersoSubstate.RUIM_CORPORATE_PUK implicitly + 1 */,
    RUIM_RUIM_PUK = 24 /* ::android::hardware::radio::V1_0::PersoSubstate.RUIM_SERVICE_PROVIDER_PUK implicitly + 1 */,
    /**
     * The device is personalized using the content of the Service Provider Name (SPN) in the SIM
     * card.
     */
    SIM_SPN = 25 /* ::android::hardware::radio::V1_0::PersoSubstate.RUIM_RUIM_PUK implicitly + 1 */,
    SIM_SPN_PUK = 26 /* ::android::hardware::radio::V1_5::PersoSubstate.SIM_SPN implicitly + 1 */,
    /**
     * Service Provider and Equivalent Home PLMN
     * The device is personalized using both the content of the GID1 (equivalent to service provider
     * personalization) and the content of the Equivalent Home PLMN (EHPLMN) in the SIM card.
     * If the GID1 in the SIM is absent, then just the content of the Equivalent Home PLMN
     * is matched.
     */
    SIM_SP_EHPLMN = 27 /* ::android::hardware::radio::V1_5::PersoSubstate.SIM_SPN_PUK implicitly + 1 */,
    SIM_SP_EHPLMN_PUK = 28 /* ::android::hardware::radio::V1_5::PersoSubstate.SIM_SP_EHPLMN implicitly + 1 */,
    /**
     * Device is personalized using the first digits of the ICCID of the SIM card.
     */
    SIM_ICCID = 29 /* ::android::hardware::radio::V1_5::PersoSubstate.SIM_SP_EHPLMN_PUK implicitly + 1 */,
    SIM_ICCID_PUK = 30 /* ::android::hardware::radio::V1_5::PersoSubstate.SIM_ICCID implicitly + 1 */,
    /**
     * Device is personalized using the content of the IMPI in the ISIM.
     */
    SIM_IMPI = 31 /* ::android::hardware::radio::V1_5::PersoSubstate.SIM_ICCID_PUK implicitly + 1 */,
    SIM_IMPI_PUK = 32 /* ::android::hardware::radio::V1_5::PersoSubstate.SIM_IMPI implicitly + 1 */,
    /**
     * Network Subset and Service Provider
     * Device is personalized using both the content of GID1 (equivalent to service provider
     * personalization) and the first digits of the IMSI (equivalent to network subset
     * personalization).
     */
    SIM_NS_SP = 33 /* ::android::hardware::radio::V1_5::PersoSubstate.SIM_IMPI_PUK implicitly + 1 */,
    SIM_NS_SP_PUK = 34 /* ::android::hardware::radio::V1_5::PersoSubstate.SIM_NS_SP implicitly + 1 */,
};

/**
 * Extended from @1.0::AppStatus to update PersoSubstate to 1.5 version.
 */
struct AppStatus final {
    ::android::hardware::radio::V1_0::AppStatus base __attribute__ ((aligned(8)));
    /**
     * Applicable only if appState == SUBSCRIPTION_PERSO
     */
    ::android::hardware::radio::V1_5::PersoSubstate persoSubstate __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_5::AppStatus, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::AppStatus, persoSubstate) == 64, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_5::AppStatus) == 72, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::AppStatus) == 8, "wrong alignment");

/**
 * Extended from @1.4::CardStatus to use 1.5 version of AppStatus.
 */
struct CardStatus final {
    ::android::hardware::radio::V1_4::CardStatus base __attribute__ ((aligned(8)));
    /**
     * size <= RadioConst::CARD_MAX_APPS
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_5::AppStatus> applications __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_5::CardStatus, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_5::CardStatus, applications) == 96, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_5::CardStatus) == 112, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_5::CardStatus) == 8, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::android::hardware::radio::V1_5::SignalMeasurementType o);
static inline void PrintTo(::android::hardware::radio::V1_5::SignalMeasurementType o, ::std::ostream* os);
constexpr int32_t operator|(const ::android::hardware::radio::V1_5::SignalMeasurementType lhs, const ::android::hardware::radio::V1_5::SignalMeasurementType rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const int32_t lhs, const ::android::hardware::radio::V1_5::SignalMeasurementType rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const ::android::hardware::radio::V1_5::SignalMeasurementType lhs, const int32_t rhs) {
