{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA0_c",
   "name" : "char [0]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA0_c",
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA1024_c",
   "name" : "char [1024]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA1024_c",
   "size" : 1024,
   "source_file" : "bionic/libc/system_properties/include/system_properties/system_properties.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA28_j",
   "name" : "unsigned int [28]",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIA28_j",
   "size" : 112,
   "source_file" : "bionic/libc/system_properties/include/system_properties/prop_area.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA32_c",
   "name" : "char [32]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA32_c",
   "size" : 32,
   "source_file" : "bionic/libc/system_properties/include/system_properties/system_properties.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA56_c",
   "name" : "char [56]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA56_c",
   "size" : 56,
   "source_file" : "bionic/libc/system_properties/include/system_properties/prop_info.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA92_c",
   "name" : "char [92]",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIA92_c",

   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 4,
   "source_file" : "bionic/libc/system_properties/include/system_properties/prop_area.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIA0_Kc",
   "name" : "char const[0]",
   "referenced_type" : "_ZTIA0_c",
   "self_type" : "_ZTIA0_Kc",
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK11ContextNode",
   "name" : "const ContextNode",
   "referenced_type" : "_ZTI11ContextNode",
   "self_type" : "_ZTIK11ContextNode",
   "size" : 24,
   "source_file" : "bionic/libc/system_properties/include/system_properties/context_node.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK9prop_area",
   "name" : "const prop_area",
   "referenced_type" : "_ZTI9prop_area",
   "self_type" : "_ZTIK9prop_area",
   "size" : 128,
   "source_file" : "bionic/libc/system_properties/include/system_properties/prop_area.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK9prop_info",
   "name" : "const prop_info",
   "referenced_type" : "_ZTI9prop_info",
   "self_type" : "_ZTIK9prop_info",
   "size" : 96,
   "source_file" : "bionic/libc/system_properties/include/system_properties/prop_info.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android10properties13PropertyEntryE",
   "name" : "const android::properties::PropertyEntry",
   "referenced_type" : "_ZTIN7android10properties13PropertyEntryE",
   "self_type" : "_ZTIKN7android10properties13PropertyEntryE",
   "size" : 16,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android10properties14SerializedDataE",
   "name" : "const android::properties::SerializedData",
   "referenced_type" : "_ZTIN7android10properties14SerializedDataE",
   "self_type" : "_ZTIKN7android10properties14SerializedDataE",
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android10properties16PropertyInfoAreaE",
   "name" : "const android::properties::PropertyInfoArea",
   "referenced_type" : "_ZTIN7android10properties16PropertyInfoAreaE",
   "self_type" : "_ZTIKN7android10properties16PropertyInfoAreaE",
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android10properties16TrieNodeInternalE",
   "name" : "const android::properties::TrieNodeInternal",
   "referenced_type" : "_ZTIN7android10properties16TrieNodeInternalE",
   "self_type" : "_ZTIKN7android10properties16TrieNodeInternalE",
   "size" : 28,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android10properties20PropertyInfoAreaFileE",
   "name" : "const android::properties::PropertyInfoAreaFile",
   "referenced_type" : "_ZTIN7android10properties20PropertyInfoAreaFileE",
   "self_type" : "_ZTIKN7android10properties20PropertyInfoAreaFileE",
   "size" : 8,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android10properties22PropertyInfoAreaHeaderE",
   "name" : "const android::properties::PropertyInfoAreaHeader",
   "referenced_type" : "_ZTIN7android10properties22PropertyInfoAreaHeaderE",
   "self_type" : "_ZTIKN7android10properties22PropertyInfoAreaHeaderE",
   "size" : 24,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKN7android10properties8TrieNodeE",
   "name" : "const android::properties::TrieNode",
   "referenced_type" : "_ZTIN7android10properties8TrieNodeE",
   "self_type" : "_ZTIKN7android10properties8TrieNodeE",
   "size" : 8,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "bionic/libc/system_properties/include/system_properties/system_properties.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKj",
   "name" : "const unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIKj",
   "size" : 4,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "lock_",
     "referenced_type" : "_ZTI4Lock"
    },
    {
     "access" : "private",
     "field_name" : "context_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "pa_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP9prop_area"
    },
    {
     "access" : "private",
     "field_name" : "no_access_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "filename_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI11ContextNode",
   "name" : "ContextNode",
   "record_kind" : "class",
   "referenced_type" : "_ZTI11ContextNode",
   "self_type" : "_ZTI11ContextNode",
   "size" : 24,
   "source_file" : "bionic/libc/system_properties/include/system_properties/context_node.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8Contexts"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "prefixes_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP10PrefixNode"
    },
    {
     "access" : "protected",
     "field_name" : "contexts_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP15ContextListNode"
    },
    {
     "access" : "protected",
     "field_name" : "serial_prop_area_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIP9prop_area"
    },
    {
     "access" : "protected",
     "field_name" : "filename_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI13ContextsSplit",
   "name" : "ContextsSplit",
   "record_kind" : "class",
   "referenced_type" : "_ZTI13ContextsSplit",
   "self_type" : "_ZTI13ContextsSplit",
   "size" : 20,
   "source_file" : "bionic/libc/system_properties/include/system_properties/contexts_split.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI13ContextsSplit"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN13ContextsSplitD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN13ContextsSplitD0Ev"
    },
    {
     "mangled_component_name" : "_ZN13ContextsSplit10InitializeEbPKcPb"
    },
    {
     "mangled_component_name" : "_ZN13ContextsSplit18GetPropAreaForNameEPKc"
    },
    {
     "mangled_component_name" : "_ZN13ContextsSplit17GetSerialPropAreaEv"
    },
    {
     "mangled_component_name" : "_ZN13ContextsSplit7ForEachEPFvPK9prop_infoPvES3_"
    },
    {
     "mangled_component_name" : "_ZN13ContextsSplit11ResetAccessEv"
    },
    {
     "mangled_component_name" : "_ZN13ContextsSplit12FreeAndUnmapEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8Contexts"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "pre_split_prop_area_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIP9prop_area"
    }
   ],
   "linker_set_key" : "_ZTI16ContextsPreSplit",
   "name" : "ContextsPreSplit",
   "record_kind" : "class",
   "referenced_type" : "_ZTI16ContextsPreSplit",
   "self_type" : "_ZTI16ContextsPreSplit",
   "size" : 8,
   "source_file" : "bionic/libc/system_properties/include/system_properties/contexts_pre_split.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI16ContextsPreSplit"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN16ContextsPreSplitD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN16ContextsPreSplitD0Ev"
    },
    {
     "mangled_component_name" : "_ZN16ContextsPreSplit10InitializeEbPKcPb"
    },
    {
     "mangled_component_name" : "_ZN16ContextsPreSplit18GetPropAreaForNameEPKc"
    },
    {
     "mangled_component_name" : "_ZN16ContextsPreSplit17GetSerialPropAreaEv"
    },
    {
     "mangled_component_name" : "_ZN16ContextsPreSplit7ForEachEPFvPK9prop_infoPvES3_"
    },
    {
     "mangled_component_name" : "_ZN16ContextsPreSplit11ResetAccessEv"
    },
    {
     "mangled_component_name" : "_ZN16ContextsPreSplit12FreeAndUnmapEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "contexts_data_",
     "referenced_type" : "_ZTIA32_c"
    },
    {
     "access" : "private",
     "field_name" : "contexts_",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP8Contexts"
    },
    {
     "access" : "private",
     "field_name" : "initialized_",
     "field_offset" : 288,
     "referenced_type" : "_ZTIb"
    },
    {
     "access" : "private",
     "field_name" : "property_filename_",
     "field_offset" : 296,
     "referenced_type" : "_ZTIA1024_c"
    }
   ],
   "linker_set_key" : "_ZTI16SystemProperties",
   "name" : "SystemProperties",
   "record_kind" : "class",
   "referenced_type" : "_ZTI16SystemProperties",
   "self_type" : "_ZTI16SystemProperties",
   "size" : 1064,
   "source_file" : "bionic/libc/system_properties/include/system_properties/system_properties.h"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8Contexts"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "filename_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "access" : "private",
     "field_name" : "property_info_area_file_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN7android10properties20PropertyInfoAreaFileE"
    },
    {
     "access" : "private",
     "field_name" : "context_nodes_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP11ContextNode"
    },
    {
     "access" : "private",
     "field_name" : "num_context_nodes_",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "context_nodes_mmap_size_",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "serial_prop_area_",
     "field_offset" : 224,
     "referenced_type" : "_ZTIP9prop_area"
    }
   ],
   "linker_set_key" : "_ZTI18ContextsSerialized",
   "name" : "ContextsSerialized",
   "record_kind" : "class",
   "referenced_type" : "_ZTI18ContextsSerialized",
   "self_type" : "_ZTI18ContextsSerialized",
   "size" : 32,
   "source_file" : "bionic/libc/system_properties/include/system_properties/contexts_serialized.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI18ContextsSerialized"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN18ContextsSerializedD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN18ContextsSerializedD0Ev"
    },
    {
     "mangled_component_name" : "_ZN18ContextsSerialized10InitializeEbPKcPb"
    },
    {
     "mangled_component_name" : "_ZN18ContextsSerialized18GetPropAreaForNameEPKc"
    },
    {
     "mangled_component_name" : "_ZN18ContextsSerialized17GetSerialPropAreaEv"
    },
    {
     "mangled_component_name" : "_ZN18ContextsSerialized7ForEachEPFvPK9prop_infoPvES3_"
    },
    {
     "mangled_component_name" : "_ZN18ContextsSerialized11ResetAccessEv"
    },
    {
     "mangled_component_name" : "_ZN18ContextsSerialized12FreeAndUnmapEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "namelen",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "prop",
     "field_offset" : 32,
     "referenced_type" : "_ZTIU7_Atomicj"
    },
    {
     "field_name" : "left",
     "field_offset" : 64,
     "referenced_type" : "_ZTIU7_Atomicj"
    },
    {
     "field_name" : "right",
     "field_offset" : 96,
     "referenced_type" : "_ZTIU7_Atomicj"
    },
    {
     "field_name" : "children",
     "field_offset" : 128,
     "referenced_type" : "_ZTIU7_Atomicj"
    },
    {
     "field_name" : "name",
     "field_offset" : 160,
     "referenced_type" : "_ZTIA0_c"
    }
   ],
   "linker_set_key" : "_ZTI7prop_bt",
   "name" : "prop_bt",
   "referenced_type" : "_ZTI7prop_bt",
   "self_type" : "_ZTI7prop_bt",
   "size" : 20,
   "source_file" : "bionic/libc/system_properties/include/system_properties/prop_area.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTI8Contexts",
   "name" : "Contexts",
   "record_kind" : "class",
   "referenced_type" : "_ZTI8Contexts",
   "self_type" : "_ZTI8Contexts",
   "size" : 4,
   "source_file" : "bionic/libc/system_properties/include/system_properties/contexts.h",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTI8Contexts"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN8ContextsD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN8ContextsD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8Contexts10InitializeEbPKcPb"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8Contexts18GetPropAreaForNameEPKc"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8Contexts17GetSerialPropAreaEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8Contexts7ForEachEPFvPK9prop_infoPvES3_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8Contexts11ResetAccessEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN8Contexts12FreeAndUnmapEv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "bytes_used_",
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "serial_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIU7_Atomicj"
    },
    {
     "access" : "private",
     "field_name" : "magic_",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "version_",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "access" : "private",
     "field_name" : "reserved_",
     "field_offset" : 128,
     "referenced_type" : "_ZTIA28_j"
    },
    {
     "access" : "private",
     "field_name" : "data_",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIA0_c"
    }
   ],
   "linker_set_key" : "_ZTI9prop_area",
   "name" : "prop_area",
   "record_kind" : "class",
   "referenced_type" : "_ZTI9prop_area",
   "self_type" : "_ZTI9prop_area",
   "size" : 128,
   "source_file" : "bionic/libc/system_properties/include/system_properties/prop_area.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "serial",
     "referenced_type" : "_ZTIU7_Atomicj"
    },
    {
     "field_offset" : 32,
     "referenced_type" : "_ZTIN9prop_infoUt_E"
    },
    {
     "field_name" : "name",
     "field_offset" : 768,
     "referenced_type" : "_ZTIA0_c"
    }
   ],
   "linker_set_key" : "_ZTI9prop_info",
   "name" : "prop_info",
   "referenced_type" : "_ZTI9prop_info",
   "self_type" : "_ZTI9prop_info",
   "size" : 96,
   "source_file" : "bionic/libc/system_properties/include/system_properties/prop_info.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name_offset",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "namelen",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "context_index",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "type_index",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android10properties13PropertyEntryE",
   "name" : "android::properties::PropertyEntry",
   "referenced_type" : "_ZTIN7android10properties13PropertyEntryE",
   "self_type" : "_ZTIN7android10properties13PropertyEntryE",
   "size" : 16,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "data_base_",
     "referenced_type" : "_ZTIA0_Kc"
    }
   ],
   "linker_set_key" : "_ZTIN7android10properties14SerializedDataE",
   "name" : "android::properties::SerializedData",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10properties14SerializedDataE",
   "self_type" : "_ZTIN7android10properties14SerializedDataE",
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "_ZTIN7android10properties14SerializedDataE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10properties16PropertyInfoAreaE",
   "name" : "android::properties::PropertyInfoArea",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10properties16PropertyInfoAreaE",
   "self_type" : "_ZTIN7android10properties16PropertyInfoAreaE",
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "property_entry",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "num_child_nodes",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "child_nodes",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "num_prefixes",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "prefix_entries",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "num_exact_matches",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "exact_match_entries",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android10properties16TrieNodeInternalE",
   "name" : "android::properties::TrieNodeInternal",
   "referenced_type" : "_ZTIN7android10properties16TrieNodeInternalE",
   "self_type" : "_ZTIN7android10properties16TrieNodeInternalE",
   "size" : 28,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mmap_base_",
     "referenced_type" : "_ZTIPv"
    },
    {
     "access" : "private",
     "field_name" : "mmap_size_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android10properties20PropertyInfoAreaFileE",
   "name" : "android::properties::PropertyInfoAreaFile",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10properties20PropertyInfoAreaFileE",
   "self_type" : "_ZTIN7android10properties20PropertyInfoAreaFileE",
   "size" : 8,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "current_version",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "minimum_supported_version",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "size",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "contexts_offset",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "types_offset",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "root_offset",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTIN7android10properties22PropertyInfoAreaHeaderE",
   "name" : "android::properties::PropertyInfoAreaHeader",
   "referenced_type" : "_ZTIN7android10properties22PropertyInfoAreaHeaderE",
   "self_type" : "_ZTIN7android10properties22PropertyInfoAreaHeaderE",
   "size" : 24,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "serialized_data_",
     "referenced_type" : "_ZTIPKN7android10properties14SerializedDataE"
    },
    {
     "access" : "private",
     "field_name" : "trie_node_base_",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKN7android10properties16TrieNodeInternalE"
    }
   ],
   "linker_set_key" : "_ZTIN7android10properties8TrieNodeE",
   "name" : "android::properties::TrieNode",
   "record_kind" : "class",
   "referenced_type" : "_ZTIN7android10properties8TrieNodeE",
   "self_type" : "_ZTIN7android10properties8TrieNodeE",
   "size" : 8,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "value",
     "referenced_type" : "_ZTIA92_c"
    },
    {
     "field_name" : "long_property",
     "referenced_type" : "_ZTIN9prop_infoUt_Ut_E"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9prop_infoUt_E",
   "name" : "prop_info::(anonymous union at bionic/libc/system_properties/include/system_properties/prop_info.h:61:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN9prop_infoUt_E",
   "self_type" : "_ZTIN9prop_infoUt_E",
   "size" : 92,
   "source_file" : "bionic/libc/system_properties/include/system_properties/prop_info.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "error_message",
     "referenced_type" : "_ZTIA56_c"
    },
    {
     "field_name" : "offset",
     "field_offset" : 448,
     "referenced_type" : "_ZTIj"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN9prop_infoUt_Ut_E",
   "name" : "prop_info::(anonymous union at bionic/libc/system_properties/include/system_properties/prop_info.h:61:3)::(anonymous struct at bionic/libc/system_properties/include/system_properties/prop_info.h:63:5)",
   "referenced_type" : "_ZTIN9prop_infoUt_Ut_E",
   "self_type" : "_ZTIN9prop_infoUt_Ut_E",
   "size" : 60,
   "source_file" : "bionic/libc/system_properties/include/system_properties/prop_info.h"
  }
 ],
 "rvalue_reference_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTION7android10properties20PropertyInfoAreaFileE",
   "name" : "android::properties::PropertyInfoAreaFile &&",
   "referenced_type" : "_ZTIN7android10properties20PropertyInfoAreaFileE",
   "self_type" : "_ZTION7android10properties20PropertyInfoAreaFileE",
   "size" : 4,
   "source_file" : "system/core/property_service/libpropertyinfoparser/include/property_info_parser/property_info_parser.h"
  }
 ]
}
