#ifndef HIDL_GENERATED_ANDROID_HARDWARE_TV_INPUT_V1_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_TV_INPUT_V1_0_TYPES_H

#include <android/hardware/audio/common/2.0/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace tv {
namespace input {
namespace V1_0 {

// Forward declaration for forward reference support:
enum class Result : int32_t;
enum class TvInputType : int32_t;
enum class CableConnectionStatus : int32_t;
struct TvInputDeviceInfo;
enum class TvInputEventType : int32_t;
struct TvInputEvent;
struct TvStreamConfig;

enum class Result : int32_t {
    OK = 0,
    UNKNOWN = 1 /* ::android::hardware::tv::input::V1_0::Result.OK implicitly + 1 */,
    NO_RESOURCE = 2 /* ::android::hardware::tv::input::V1_0::Result.UNKNOWN implicitly + 1 */,
    INVALID_ARGUMENTS = 3 /* ::android::hardware::tv::input::V1_0::Result.NO_RESOURCE implicitly + 1 */,
    INVALID_STATE = 4 /* ::android::hardware::tv::input::V1_0::Result.INVALID_ARGUMENTS implicitly + 1 */,
};

/**
 * Type of physical TV input.
 */
enum class TvInputType : int32_t {
    OTHER = 1,
    TUNER = 2,
    COMPOSITE = 3,
    SVIDEO = 4,
    SCART = 5,
    COMPONENT = 6,
    VGA = 7,
    DVI = 8,
    HDMI = 9,
    DISPLAY_PORT = 10,
};

/**
 * Status of cable connection.
 * This status is for devices having availability to detect the cable in a mechanical way,
 * regardless of whether the connected external device is electrically on or not.
 * If the device does not have such capability, you must use UNKNOWN.
 */
enum class CableConnectionStatus : int32_t {
    UNKNOWN = 0,
    CONNECTED = 1,
    DISCONNECTED = 2,
};

struct TvInputDeviceInfo final {
    int32_t deviceId __attribute__ ((aligned(4)));
    ::android::hardware::tv::input::V1_0::TvInputType type __attribute__ ((aligned(4)));
    uint32_t portId __attribute__ ((aligned(4)));
    ::android::hardware::tv::input::V1_0::CableConnectionStatus cableConnectionStatus __attribute__ ((aligned(4)));
    ::android::hardware::audio::common::V2_0::AudioDevice audioType __attribute__ ((aligned(4)));
    ::android::hardware::hidl_array<uint8_t, 32> audioAddress __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::tv::input::V1_0::TvInputDeviceInfo, deviceId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::input::V1_0::TvInputDeviceInfo, type) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::input::V1_0::TvInputDeviceInfo, portId) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::tv::input::V1_0::TvInputDeviceInfo, cableConnectionStatus) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::tv::input::V1_0::TvInputDeviceInfo, audioType) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::tv::input::V1_0::TvInputDeviceInfo, audioAddress) == 20, "wrong offset");
static_assert(sizeof(::android::hardware::tv::input::V1_0::TvInputDeviceInfo) == 52, "wrong size");
static_assert(__alignof(::android::hardware::tv::input::V1_0::TvInputDeviceInfo) == 4, "wrong alignment");

enum class TvInputEventType : int32_t {
    /**
     * Hardware notifies the framework that a device is available.
     *
     * Note that DEVICE_AVAILABLE and DEVICE_UNAVAILABLE events do not represent
     * hotplug events (i.e. plugging cable into or out of the physical port).
     * These events notify the framework whether the port is available or not.
     * For a concrete example, when a user plugs in or pulls out the HDMI cable
     * from a HDMI port, it does not generate DEVICE_AVAILABLE and/or
     * DEVICE_UNAVAILABLE events. However, if a user inserts a pluggable USB
     * tuner into the Android device, it must generate a DEVICE_AVAILABLE event
     * and when the port is removed, it must generate a DEVICE_UNAVAILABLE
     * event.
     *
     * For hotplug events, please see STREAM_CONFIGURATION_CHANGED for more
     * details.
     *
     * HAL implementation must register devices by using this event when the
     * device boots up. The framework must recognize device reported via this
     * event only.
     */
    DEVICE_AVAILABLE = 1,
    /**
     * Hardware notifies the framework that a device is unavailable.
     *
     * HAL implementation must generate this event when a device registered
     * by DEVICE_AVAILABLE is no longer available. For example,
     * the event can indicate that a USB tuner is plugged out from the Android
     * device.
     *
     * Note that this event is not for indicating cable plugged out of the port;
     * for that purpose, the implementation must use
     * STREAM_CONFIGURATION_CHANGED event. This event represents the port itself
     * being no longer available.
     */
    DEVICE_UNAVAILABLE = 2,
    /**
     * Stream configurations are changed. Client must regard all open streams
     * at the specific device are closed, and must call
     * getStreamConfigurations() again, opening some of them if necessary.
     *
     * HAL implementation must generate this event when the available stream
     * configurations change for any reason. A typical use case of this event
     * is to notify the framework that the input signal has changed resolution,
     * or that the cable is plugged out so that the number of available streams
     * is 0.
     *
     * The implementation must use this event to indicate hotplug status of the
     * port. the framework regards input devices with no available streams as
     * disconnected, so the implementation can generate this event with no
     * available streams to indicate that this device is disconnected, and vice
     * versa.
     */
    STREAM_CONFIGURATIONS_CHANGED = 3,
};

struct TvInputEvent final {
    ::android::hardware::tv::input::V1_0::TvInputEventType type __attribute__ ((aligned(4)));
    /**
     * DEVICE_AVAILABLE: all fields are relevant.
     * DEVICE_UNAVAILABLE: only deviceId is relevant.
     * STREAM_CONFIGURATIONS_CHANGED: only deviceId is relevant.
     */
    ::android::hardware::tv::input::V1_0::TvInputDeviceInfo deviceInfo __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::tv::input::V1_0::TvInputEvent, type) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::input::V1_0::TvInputEvent, deviceInfo) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::tv::input::V1_0::TvInputEvent) == 56, "wrong size");
static_assert(__alignof(::android::hardware::tv::input::V1_0::TvInputEvent) == 4, "wrong alignment");

struct TvStreamConfig final {
    int32_t streamId __attribute__ ((aligned(4)));
    uint32_t maxVideoWidth __attribute__ ((aligned(4)));
    uint32_t maxVideoHeight __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::tv::input::V1_0::TvStreamConfig, streamId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::tv::input::V1_0::TvStreamConfig, maxVideoWidth) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::tv::input::V1_0::TvStreamConfig, maxVideoHeight) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::tv::input::V1_0::TvStreamConfig) == 12, "wrong size");
static_assert(__alignof(::android::hardware::tv::input::V1_0::TvStreamConfig) == 4, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::android::hardware::tv::input::V1_0::Result o);
static inline void PrintTo(::android::hardware::tv::input::V1_0::Result o, ::std::ostream* os);
constexpr int32_t operator|(const ::android::hardware::tv::input::V1_0::Result lhs, const ::android::hardware::tv::input::V1_0::Result rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const int32_t lhs, const ::android::hardware::tv::input::V1_0::Result rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const ::android::hardware::tv::input::V1_0::Result lhs, const int32_t rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | rhs);
}
