{
 "array_types" : [],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "linker_set_key" : "_ZTIa",
   "name" : "signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIa",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTId",
   "name" : "double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTId",
   "size" : 8
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIf",
   "name" : "float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIf",
   "size" : 4
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIj",
   "name" : "unsigned int",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIj",
   "size" : 4
  },
  {
   "alignment" : 2,
   "is_integral" : true,
   "linker_set_key" : "_ZTIs",
   "name" : "short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIs",

   "linker_set_key" : "_ZTIPt",
   "name" : "unsigned short *",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIPt",
   "size" : 4,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPx",
   "name" : "long long *",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIPx",
   "size" : 4,
   "source_file" : "libnativehelper/include_jni/jni.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK15JNINativeMethod",
   "name" : "const JNINativeMethod",
   "referenced_type" : "_ZTI15JNINativeMethod",
   "self_type" : "_ZTIK15JNINativeMethod",
   "size" : 12,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK18JNIInvokeInterface",
   "name" : "const JNIInvokeInterface",
   "referenced_type" : "_ZTI18JNIInvokeInterface",
   "self_type" : "_ZTIK18JNIInvokeInterface",
   "size" : 32,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK18JNINativeInterface",
   "name" : "const JNINativeInterface",
   "referenced_type" : "_ZTI18JNINativeInterface",
   "self_type" : "_ZTIK18JNINativeInterface",
   "size" : 932,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK6jvalue",
   "name" : "const jvalue",
   "referenced_type" : "_ZTI6jvalue",
   "self_type" : "_ZTIK6jvalue",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKa",
   "name" : "const signed char",
   "referenced_type" : "_ZTIa",
   "self_type" : "_ZTIKa",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKd",
   "name" : "const double",
   "referenced_type" : "_ZTId",
   "self_type" : "_ZTIKd",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKf",
   "name" : "const float",
   "referenced_type" : "_ZTIf",
   "self_type" : "_ZTIKf",
   "size" : 4,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIKi",
   "name" : "const int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIKi",
   "size" : 4,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKs",
   "name" : "const short",
   "referenced_type" : "_ZTIs",
   "self_type" : "_ZTIKs",
   "size" : 2,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 2,
   "is_const" : true,
   "linker_set_key" : "_ZTIKt",
   "name" : "const unsigned short",
   "referenced_type" : "_ZTIt",
   "self_type" : "_ZTIKt",
   "size" : 2,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIKx",
   "name" : "const long long",
   "referenced_type" : "_ZTIx",
   "self_type" : "_ZTIKx",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI10_jintArray",
   "name" : "_jintArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI10_jintArray",
   "self_type" : "_ZTI10_jintArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI11_jbyteArray",
   "name" : "_jbyteArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI11_jbyteArray",
   "self_type" : "_ZTI11_jbyteArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI11_jcharArray",
   "name" : "_jcharArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI11_jcharArray",
   "self_type" : "_ZTI11_jcharArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI11_jlongArray",
   "name" : "_jlongArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI11_jlongArray",
   "self_type" : "_ZTI11_jlongArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI11_jthrowable",
   "name" : "_jthrowable",
   "record_kind" : "class",
   "referenced_type" : "_ZTI11_jthrowable",
   "self_type" : "_ZTI11_jthrowable",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "optionString",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "extraInfo",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI12JavaVMOption",
   "name" : "JavaVMOption",
   "referenced_type" : "_ZTI12JavaVMOption",
   "self_type" : "_ZTI12JavaVMOption",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI12_jfloatArray",
   "name" : "_jfloatArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI12_jfloatArray",
   "self_type" : "_ZTI12_jfloatArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI12_jshortArray",
   "name" : "_jshortArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI12_jshortArray",
   "self_type" : "_ZTI12_jshortArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI13_jdoubleArray",
   "name" : "_jdoubleArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI13_jdoubleArray",
   "self_type" : "_ZTI13_jdoubleArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI13_jobjectArray",
   "name" : "_jobjectArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI13_jobjectArray",
   "self_type" : "_ZTI13_jobjectArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "nOptions",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "options",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP12JavaVMOption"
    },
    {
     "field_name" : "ignoreUnrecognized",
     "field_offset" : 96,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI14JavaVMInitArgs",
   "name" : "JavaVMInitArgs",
   "referenced_type" : "_ZTI14JavaVMInitArgs",
   "self_type" : "_ZTI14JavaVMInitArgs",
   "size" : 16,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI7_jarray"
    }
   ],
   "linker_set_key" : "_ZTI14_jbooleanArray",
   "name" : "_jbooleanArray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI14_jbooleanArray",
   "self_type" : "_ZTI14_jbooleanArray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "signature",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "fnPtr",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    }
   ],
   "linker_set_key" : "_ZTI15JNINativeMethod",
   "name" : "JNINativeMethod",
   "referenced_type" : "_ZTI15JNINativeMethod",
   "self_type" : "_ZTI15JNINativeMethod",
   "size" : 12,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "name",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "group",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI16JavaVMAttachArgs",
   "name" : "JavaVMAttachArgs",
   "referenced_type" : "_ZTI16JavaVMAttachArgs",
   "self_type" : "_ZTI16JavaVMAttachArgs",
   "size" : 12,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "DestroyJavaVM",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPFiP7_JavaVME"
    },
    {
     "field_name" : "AttachCurrentThread",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiP7_JavaVMPP7_JNIEnvPvE"
    },
    {
     "field_name" : "DetachCurrentThread",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFiP7_JavaVME"
    },
    {
     "field_name" : "GetEnv",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiP7_JavaVMPPviE"
    },
    {
     "field_name" : "AttachCurrentThreadAsDaemon",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFiP7_JavaVMPP7_JNIEnvPvE"
    }
   ],
   "linker_set_key" : "_ZTI18JNIInvokeInterface",
   "name" : "JNIInvokeInterface",
   "referenced_type" : "_ZTI18JNIInvokeInterface",
   "self_type" : "_ZTI18JNIInvokeInterface",
   "size" : 32,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "reserved0",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved1",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "reserved3",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "GetVersion",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiP7_JNIEnvE"
    },
    {
     "field_name" : "DefineClass",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvPKcP8_jobjectPKaiE"
    },
    {
     "field_name" : "FindClass",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvPKcE"
    },
    {
     "field_name" : "FromReflectedMethod",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFP10_jmethodIDP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "FromReflectedField",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFP9_jfieldIDP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "ToReflectedMethod",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDhE"
    },
    {
     "field_name" : "GetSuperclass",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvS0_E"
    },
    {
     "field_name" : "IsAssignableFrom",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassS2_E"
    },
    {
     "field_name" : "ToReflectedField",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP9_jfieldIDhE"
    },
    {
     "field_name" : "Throw",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP11_jthrowableE"
    },
    {
     "field_name" : "ThrowNew",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassPKcE"
    },
    {
     "field_name" : "ExceptionOccurred",
     "field_offset" : 480,
     "referenced_type" : "_ZTIPFP11_jthrowableP7_JNIEnvE"
    },
    {
     "field_name" : "ExceptionDescribe",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFvP7_JNIEnvE"
    },
    {
     "field_name" : "ExceptionClear",
     "field_offset" : 544,
     "referenced_type" : "_ZTIPFvP7_JNIEnvE"
    },
    {
     "field_name" : "FatalError",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFvP7_JNIEnvPKcE"
    },
    {
     "field_name" : "PushLocalFrame",
     "field_offset" : 608,
     "referenced_type" : "_ZTIPFiP7_JNIEnviE"
    },
    {
     "field_name" : "PopLocalFrame",
     "field_offset" : 640,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "NewGlobalRef",
     "field_offset" : 672,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "DeleteGlobalRef",
     "field_offset" : 704,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "DeleteLocalRef",
     "field_offset" : 736,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "IsSameObject",
     "field_offset" : 768,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectS2_E"
    },
    {
     "field_name" : "NewLocalRef",
     "field_offset" : 800,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "EnsureLocalCapacity",
     "field_offset" : 832,
     "referenced_type" : "_ZTIPFiP7_JNIEnviE"
    },
    {
     "field_name" : "AllocObject",
     "field_offset" : 864,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassE"
    },
    {
     "field_name" : "NewObject",
     "field_offset" : 896,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "NewObjectV",
     "field_offset" : 928,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "NewObjectA",
     "field_offset" : 960,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "GetObjectClass",
     "field_offset" : 992,
     "referenced_type" : "_ZTIPFP7_jclassP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "IsInstanceOf",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassE"
    },
    {
     "field_name" : "GetMethodID",
     "field_offset" : 1056,
     "referenced_type" : "_ZTIPFP10_jmethodIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "CallObjectMethod",
     "field_offset" : 1088,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P10_jmethodIDzE"
    },
    {
     "field_name" : "CallObjectMethodV",
     "field_offset" : 1120,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallObjectMethodA",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallBooleanMethod",
     "field_offset" : 1184,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallBooleanMethodV",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallBooleanMethodA",
     "field_offset" : 1248,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallByteMethod",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallByteMethodV",
     "field_offset" : 1312,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallByteMethodA",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallCharMethod",
     "field_offset" : 1376,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallCharMethodV",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallCharMethodA",
     "field_offset" : 1440,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallShortMethod",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallShortMethodV",
     "field_offset" : 1504,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallShortMethodA",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallIntMethod",
     "field_offset" : 1568,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallIntMethodV",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallIntMethodA",
     "field_offset" : 1632,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallLongMethod",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallLongMethodV",
     "field_offset" : 1696,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallLongMethodA",
     "field_offset" : 1728,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallFloatMethod",
     "field_offset" : 1760,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallFloatMethodV",
     "field_offset" : 1792,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallFloatMethodA",
     "field_offset" : 1824,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallDoubleMethod",
     "field_offset" : 1856,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallDoubleMethodV",
     "field_offset" : 1888,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallDoubleMethodA",
     "field_offset" : 1920,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallVoidMethod",
     "field_offset" : 1952,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP10_jmethodIDzE"
    },
    {
     "field_name" : "CallVoidMethodV",
     "field_offset" : 1984,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallVoidMethodA",
     "field_offset" : 2016,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualObjectMethod",
     "field_offset" : 2048,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodV",
     "field_offset" : 2080,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualObjectMethodA",
     "field_offset" : 2112,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethod",
     "field_offset" : 2144,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodV",
     "field_offset" : 2176,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualBooleanMethodA",
     "field_offset" : 2208,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualByteMethod",
     "field_offset" : 2240,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualByteMethodV",
     "field_offset" : 2272,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualByteMethodA",
     "field_offset" : 2304,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualCharMethod",
     "field_offset" : 2336,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualCharMethodV",
     "field_offset" : 2368,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualCharMethodA",
     "field_offset" : 2400,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualShortMethod",
     "field_offset" : 2432,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualShortMethodV",
     "field_offset" : 2464,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualShortMethodA",
     "field_offset" : 2496,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualIntMethod",
     "field_offset" : 2528,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualIntMethodV",
     "field_offset" : 2560,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualIntMethodA",
     "field_offset" : 2592,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualLongMethod",
     "field_offset" : 2624,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualLongMethodV",
     "field_offset" : 2656,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualLongMethodA",
     "field_offset" : 2688,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualFloatMethod",
     "field_offset" : 2720,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodV",
     "field_offset" : 2752,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualFloatMethodA",
     "field_offset" : 2784,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethod",
     "field_offset" : 2816,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodV",
     "field_offset" : 2848,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualDoubleMethodA",
     "field_offset" : 2880,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallNonvirtualVoidMethod",
     "field_offset" : 2912,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodV",
     "field_offset" : 2944,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallNonvirtualVoidMethodA",
     "field_offset" : 2976,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "GetFieldID",
     "field_offset" : 3008,
     "referenced_type" : "_ZTIPFP9_jfieldIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "GetObjectField",
     "field_offset" : 3040,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_P9_jfieldIDE"
    },
    {
     "field_name" : "GetBooleanField",
     "field_offset" : 3072,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetByteField",
     "field_offset" : 3104,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetCharField",
     "field_offset" : 3136,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetShortField",
     "field_offset" : 3168,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetIntField",
     "field_offset" : 3200,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetLongField",
     "field_offset" : 3232,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetFloatField",
     "field_offset" : 3264,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "GetDoubleField",
     "field_offset" : 3296,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP8_jobjectP9_jfieldIDE"
    },
    {
     "field_name" : "SetObjectField",
     "field_offset" : 3328,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDS2_E"
    },
    {
     "field_name" : "SetBooleanField",
     "field_offset" : 3360,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDhE"
    },
    {
     "field_name" : "SetByteField",
     "field_offset" : 3392,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDaE"
    },
    {
     "field_name" : "SetCharField",
     "field_offset" : 3424,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDtE"
    },
    {
     "field_name" : "SetShortField",
     "field_offset" : 3456,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDsE"
    },
    {
     "field_name" : "SetIntField",
     "field_offset" : 3488,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDiE"
    },
    {
     "field_name" : "SetLongField",
     "field_offset" : 3520,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDxE"
    },
    {
     "field_name" : "SetFloatField",
     "field_offset" : 3552,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDfE"
    },
    {
     "field_name" : "SetDoubleField",
     "field_offset" : 3584,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectP9_jfieldIDdE"
    },
    {
     "field_name" : "GetStaticMethodID",
     "field_offset" : 3616,
     "referenced_type" : "_ZTIPFP10_jmethodIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "CallStaticObjectMethod",
     "field_offset" : 3648,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticObjectMethodV",
     "field_offset" : 3680,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticObjectMethodA",
     "field_offset" : 3712,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticBooleanMethod",
     "field_offset" : 3744,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticBooleanMethodV",
     "field_offset" : 3776,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticBooleanMethodA",
     "field_offset" : 3808,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticByteMethod",
     "field_offset" : 3840,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticByteMethodV",
     "field_offset" : 3872,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticByteMethodA",
     "field_offset" : 3904,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticCharMethod",
     "field_offset" : 3936,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticCharMethodV",
     "field_offset" : 3968,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticCharMethodA",
     "field_offset" : 4000,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticShortMethod",
     "field_offset" : 4032,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticShortMethodV",
     "field_offset" : 4064,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticShortMethodA",
     "field_offset" : 4096,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticIntMethod",
     "field_offset" : 4128,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticIntMethodV",
     "field_offset" : 4160,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticIntMethodA",
     "field_offset" : 4192,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticLongMethod",
     "field_offset" : 4224,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticLongMethodV",
     "field_offset" : 4256,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticLongMethodA",
     "field_offset" : 4288,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticFloatMethod",
     "field_offset" : 4320,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticFloatMethodV",
     "field_offset" : 4352,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticFloatMethodA",
     "field_offset" : 4384,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticDoubleMethod",
     "field_offset" : 4416,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticDoubleMethodV",
     "field_offset" : 4448,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticDoubleMethodA",
     "field_offset" : 4480,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "CallStaticVoidMethod",
     "field_offset" : 4512,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP10_jmethodIDzE"
    },
    {
     "field_name" : "CallStaticVoidMethodV",
     "field_offset" : 4544,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP10_jmethodIDSt9__va_listE"
    },
    {
     "field_name" : "CallStaticVoidMethodA",
     "field_offset" : 4576,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP10_jmethodIDPK6jvalueE"
    },
    {
     "field_name" : "GetStaticFieldID",
     "field_offset" : 4608,
     "referenced_type" : "_ZTIPFP9_jfieldIDP7_JNIEnvP7_jclassPKcS6_E"
    },
    {
     "field_name" : "GetStaticObjectField",
     "field_offset" : 4640,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticBooleanField",
     "field_offset" : 4672,
     "referenced_type" : "_ZTIPFhP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticByteField",
     "field_offset" : 4704,
     "referenced_type" : "_ZTIPFaP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticCharField",
     "field_offset" : 4736,
     "referenced_type" : "_ZTIPFtP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticShortField",
     "field_offset" : 4768,
     "referenced_type" : "_ZTIPFsP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticIntField",
     "field_offset" : 4800,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticLongField",
     "field_offset" : 4832,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticFloatField",
     "field_offset" : 4864,
     "referenced_type" : "_ZTIPFfP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "GetStaticDoubleField",
     "field_offset" : 4896,
     "referenced_type" : "_ZTIPFdP7_JNIEnvP7_jclassP9_jfieldIDE"
    },
    {
     "field_name" : "SetStaticObjectField",
     "field_offset" : 4928,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDP8_jobjectE"
    },
    {
     "field_name" : "SetStaticBooleanField",
     "field_offset" : 4960,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDhE"
    },
    {
     "field_name" : "SetStaticByteField",
     "field_offset" : 4992,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDaE"
    },
    {
     "field_name" : "SetStaticCharField",
     "field_offset" : 5024,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDtE"
    },
    {
     "field_name" : "SetStaticShortField",
     "field_offset" : 5056,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDsE"
    },
    {
     "field_name" : "SetStaticIntField",
     "field_offset" : 5088,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDiE"
    },
    {
     "field_name" : "SetStaticLongField",
     "field_offset" : 5120,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDxE"
    },
    {
     "field_name" : "SetStaticFloatField",
     "field_offset" : 5152,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDfE"
    },
    {
     "field_name" : "SetStaticDoubleField",
     "field_offset" : 5184,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jclassP9_jfieldIDdE"
    },
    {
     "field_name" : "NewString",
     "field_offset" : 5216,
     "referenced_type" : "_ZTIPFP8_jstringP7_JNIEnvPKtiE"
    },
    {
     "field_name" : "GetStringLength",
     "field_offset" : 5248,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jstringE"
    },
    {
     "field_name" : "GetStringChars",
     "field_offset" : 5280,
     "referenced_type" : "_ZTIPFPKtP7_JNIEnvP8_jstringPhE"
    },
    {
     "field_name" : "ReleaseStringChars",
     "field_offset" : 5312,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringPKtE"
    },
    {
     "field_name" : "NewStringUTF",
     "field_offset" : 5344,
     "referenced_type" : "_ZTIPFP8_jstringP7_JNIEnvPKcE"
    },
    {
     "field_name" : "GetStringUTFLength",
     "field_offset" : 5376,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jstringE"
    },
    {
     "field_name" : "GetStringUTFChars",
     "field_offset" : 5408,
     "referenced_type" : "_ZTIPFPKcP7_JNIEnvP8_jstringPhE"
    },
    {
     "field_name" : "ReleaseStringUTFChars",
     "field_offset" : 5440,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringPKcE"
    },
    {
     "field_name" : "GetArrayLength",
     "field_offset" : 5472,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jarrayE"
    },
    {
     "field_name" : "NewObjectArray",
     "field_offset" : 5504,
     "referenced_type" : "_ZTIPFP13_jobjectArrayP7_JNIEnviP7_jclassP8_jobjectE"
    },
    {
     "field_name" : "GetObjectArrayElement",
     "field_offset" : 5536,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvP13_jobjectArrayiE"
    },
    {
     "field_name" : "SetObjectArrayElement",
     "field_offset" : 5568,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jobjectArrayiP8_jobjectE"
    },
    {
     "field_name" : "NewBooleanArray",
     "field_offset" : 5600,
     "referenced_type" : "_ZTIPFP14_jbooleanArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewByteArray",
     "field_offset" : 5632,
     "referenced_type" : "_ZTIPFP11_jbyteArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewCharArray",
     "field_offset" : 5664,
     "referenced_type" : "_ZTIPFP11_jcharArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewShortArray",
     "field_offset" : 5696,
     "referenced_type" : "_ZTIPFP12_jshortArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewIntArray",
     "field_offset" : 5728,
     "referenced_type" : "_ZTIPFP10_jintArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewLongArray",
     "field_offset" : 5760,
     "referenced_type" : "_ZTIPFP11_jlongArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewFloatArray",
     "field_offset" : 5792,
     "referenced_type" : "_ZTIPFP12_jfloatArrayP7_JNIEnviE"
    },
    {
     "field_name" : "NewDoubleArray",
     "field_offset" : 5824,
     "referenced_type" : "_ZTIPFP13_jdoubleArrayP7_JNIEnviE"
    },
    {
     "field_name" : "GetBooleanArrayElements",
     "field_offset" : 5856,
     "referenced_type" : "_ZTIPFPhP7_JNIEnvP14_jbooleanArrayS_E"
    },
    {
     "field_name" : "GetByteArrayElements",
     "field_offset" : 5888,
     "referenced_type" : "_ZTIPFPaP7_JNIEnvP11_jbyteArrayPhE"
    },
    {
     "field_name" : "GetCharArrayElements",
     "field_offset" : 5920,
     "referenced_type" : "_ZTIPFPtP7_JNIEnvP11_jcharArrayPhE"
    },
    {
     "field_name" : "GetShortArrayElements",
     "field_offset" : 5952,
     "referenced_type" : "_ZTIPFPsP7_JNIEnvP12_jshortArrayPhE"
    },
    {
     "field_name" : "GetIntArrayElements",
     "field_offset" : 5984,
     "referenced_type" : "_ZTIPFPiP7_JNIEnvP10_jintArrayPhE"
    },
    {
     "field_name" : "GetLongArrayElements",
     "field_offset" : 6016,
     "referenced_type" : "_ZTIPFPxP7_JNIEnvP11_jlongArrayPhE"
    },
    {
     "field_name" : "GetFloatArrayElements",
     "field_offset" : 6048,
     "referenced_type" : "_ZTIPFPfP7_JNIEnvP12_jfloatArrayPhE"
    },
    {
     "field_name" : "GetDoubleArrayElements",
     "field_offset" : 6080,
     "referenced_type" : "_ZTIPFPdP7_JNIEnvP13_jdoubleArrayPhE"
    },
    {
     "field_name" : "ReleaseBooleanArrayElements",
     "field_offset" : 6112,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP14_jbooleanArrayPhiE"
    },
    {
     "field_name" : "ReleaseByteArrayElements",
     "field_offset" : 6144,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jbyteArrayPaiE"
    },
    {
     "field_name" : "ReleaseCharArrayElements",
     "field_offset" : 6176,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jcharArrayPtiE"
    },
    {
     "field_name" : "ReleaseShortArrayElements",
     "field_offset" : 6208,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jshortArrayPsiE"
    },
    {
     "field_name" : "ReleaseIntArrayElements",
     "field_offset" : 6240,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP10_jintArrayPiiE"
    },
    {
     "field_name" : "ReleaseLongArrayElements",
     "field_offset" : 6272,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jlongArrayPxiE"
    },
    {
     "field_name" : "ReleaseFloatArrayElements",
     "field_offset" : 6304,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jfloatArrayPfiE"
    },
    {
     "field_name" : "ReleaseDoubleArrayElements",
     "field_offset" : 6336,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jdoubleArrayPdiE"
    },
    {
     "field_name" : "GetBooleanArrayRegion",
     "field_offset" : 6368,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP14_jbooleanArrayiiPhE"
    },
    {
     "field_name" : "GetByteArrayRegion",
     "field_offset" : 6400,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jbyteArrayiiPaE"
    },
    {
     "field_name" : "GetCharArrayRegion",
     "field_offset" : 6432,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jcharArrayiiPtE"
    },
    {
     "field_name" : "GetShortArrayRegion",
     "field_offset" : 6464,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jshortArrayiiPsE"
    },
    {
     "field_name" : "GetIntArrayRegion",
     "field_offset" : 6496,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP10_jintArrayiiPiE"
    },
    {
     "field_name" : "GetLongArrayRegion",
     "field_offset" : 6528,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jlongArrayiiPxE"
    },
    {
     "field_name" : "GetFloatArrayRegion",
     "field_offset" : 6560,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jfloatArrayiiPfE"
    },
    {
     "field_name" : "GetDoubleArrayRegion",
     "field_offset" : 6592,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jdoubleArrayiiPdE"
    },
    {
     "field_name" : "SetBooleanArrayRegion",
     "field_offset" : 6624,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP14_jbooleanArrayiiPKhE"
    },
    {
     "field_name" : "SetByteArrayRegion",
     "field_offset" : 6656,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jbyteArrayiiPKaE"
    },
    {
     "field_name" : "SetCharArrayRegion",
     "field_offset" : 6688,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jcharArrayiiPKtE"
    },
    {
     "field_name" : "SetShortArrayRegion",
     "field_offset" : 6720,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jshortArrayiiPKsE"
    },
    {
     "field_name" : "SetIntArrayRegion",
     "field_offset" : 6752,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP10_jintArrayiiPKiE"
    },
    {
     "field_name" : "SetLongArrayRegion",
     "field_offset" : 6784,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP11_jlongArrayiiPKxE"
    },
    {
     "field_name" : "SetFloatArrayRegion",
     "field_offset" : 6816,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP12_jfloatArrayiiPKfE"
    },
    {
     "field_name" : "SetDoubleArrayRegion",
     "field_offset" : 6848,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP13_jdoubleArrayiiPKdE"
    },
    {
     "field_name" : "RegisterNatives",
     "field_offset" : 6880,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassPK15JNINativeMethodiE"
    },
    {
     "field_name" : "UnregisterNatives",
     "field_offset" : 6912,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP7_jclassE"
    },
    {
     "field_name" : "MonitorEnter",
     "field_offset" : 6944,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "MonitorExit",
     "field_offset" : 6976,
     "referenced_type" : "_ZTIPFiP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "GetJavaVM",
     "field_offset" : 7008,
     "referenced_type" : "_ZTIPFiP7_JNIEnvPP7_JavaVME"
    },
    {
     "field_name" : "GetStringRegion",
     "field_offset" : 7040,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringiiPtE"
    },
    {
     "field_name" : "GetStringUTFRegion",
     "field_offset" : 7072,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringiiPcE"
    },
    {
     "field_name" : "GetPrimitiveArrayCritical",
     "field_offset" : 7104,
     "referenced_type" : "_ZTIPFPvP7_JNIEnvP7_jarrayPhE"
    },
    {
     "field_name" : "ReleasePrimitiveArrayCritical",
     "field_offset" : 7136,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP7_jarrayPviE"
    },
    {
     "field_name" : "GetStringCritical",
     "field_offset" : 7168,
     "referenced_type" : "_ZTIPFPKtP7_JNIEnvP8_jstringPhE"
    },
    {
     "field_name" : "ReleaseStringCritical",
     "field_offset" : 7200,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jstringPKtE"
    },
    {
     "field_name" : "NewWeakGlobalRef",
     "field_offset" : 7232,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvS0_E"
    },
    {
     "field_name" : "DeleteWeakGlobalRef",
     "field_offset" : 7264,
     "referenced_type" : "_ZTIPFvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "ExceptionCheck",
     "field_offset" : 7296,
     "referenced_type" : "_ZTIPFhP7_JNIEnvE"
    },
    {
     "field_name" : "NewDirectByteBuffer",
     "field_offset" : 7328,
     "referenced_type" : "_ZTIPFP8_jobjectP7_JNIEnvPvxE"
    },
    {
     "field_name" : "GetDirectBufferAddress",
     "field_offset" : 7360,
     "referenced_type" : "_ZTIPFPvP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "GetDirectBufferCapacity",
     "field_offset" : 7392,
     "referenced_type" : "_ZTIPFxP7_JNIEnvP8_jobjectE"
    },
    {
     "field_name" : "GetObjectRefType",
     "field_offset" : 7424,
     "referenced_type" : "_ZTIPF14jobjectRefTypeP7_JNIEnvP8_jobjectE"
    }
   ],
   "linker_set_key" : "_ZTI18JNINativeInterface",
   "name" : "JNINativeInterface",
   "referenced_type" : "_ZTI18JNINativeInterface",
   "self_type" : "_ZTI18JNINativeInterface",
   "size" : 932,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "z",
     "referenced_type" : "_ZTIh"
    },
    {
     "field_name" : "b",
     "referenced_type" : "_ZTIa"
    },
    {
     "field_name" : "c",
     "referenced_type" : "_ZTIt"
    },
    {
     "field_name" : "s",
     "referenced_type" : "_ZTIs"
    },
    {
     "field_name" : "i",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "j",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "f",
     "referenced_type" : "_ZTIf"
    },
    {
     "field_name" : "d",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "l",
     "referenced_type" : "_ZTIP8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI6jvalue",
   "name" : "jvalue",
   "record_kind" : "union",
   "referenced_type" : "_ZTI6jvalue",
   "self_type" : "_ZTI6jvalue",
   "size" : 8,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "_ZTIPK18JNINativeInterface"
    }
   ],
   "linker_set_key" : "_ZTI7_JNIEnv",
   "name" : "_JNIEnv",
   "referenced_type" : "_ZTI7_JNIEnv",
   "self_type" : "_ZTI7_JNIEnv",
   "size" : 4,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "functions",
     "referenced_type" : "_ZTIPK18JNIInvokeInterface"
    }
   ],
   "linker_set_key" : "_ZTI7_JavaVM",
   "name" : "_JavaVM",
   "referenced_type" : "_ZTI7_JavaVM",
   "self_type" : "_ZTI7_JavaVM",
   "size" : 4,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI7_jarray",
   "name" : "_jarray",
   "record_kind" : "class",
   "referenced_type" : "_ZTI7_jarray",
   "self_type" : "_ZTI7_jarray",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI7_jclass",
   "name" : "_jclass",
   "record_kind" : "class",
   "referenced_type" : "_ZTI7_jclass",
   "self_type" : "_ZTI7_jclass",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTI8_jobject",
   "name" : "_jobject",
   "record_kind" : "class",
   "referenced_type" : "_ZTI8_jobject",
   "self_type" : "_ZTI8_jobject",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  },
  {
   "alignment" : 1,
   "base_specifiers" :
   [
    {
     "referenced_type" : "_ZTI8_jobject"
    }
   ],
   "linker_set_key" : "_ZTI8_jstring",
   "name" : "_jstring",
   "record_kind" : "class",
   "referenced_type" : "_ZTI8_jstring",
   "self_type" : "_ZTI8_jstring",
   "size" : 1,
   "source_file" : "libnativehelper/include_jni/jni.h"
  }
 ],
 "rvalue_reference_types" : []
}
