{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA16_h",
   "name" : "unsigned char [16]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA16_h",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/cipher.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIA2_m",
   "name" : "unsigned long [2]",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIA2_m",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/bn.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA32_h",
   "name" : "unsigned char [32]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA32_h",
   "size" : 32,
   "source_file" : "external/boringssl/src/include/openssl/cipher.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA48_h",
   "name" : "unsigned char [48]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA48_h",
   "size" : 48,
   "source_file" : "external/boringssl/src/include/openssl/base64.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA56_h",
   "name" : "unsigned char [56]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA56_h",
   "size" : 56,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA580_h",
   "name" : "unsigned char [580]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA580_h",
   "size" : 580,
   "source_file" : "external/boringssl/src/include/openssl/aead.h"
  }
 ],

   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "self_type" : "_ZTIPKv",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPP14bn_blinding_st",
   "name" : "bn_blinding_st **",
   "referenced_type" : "_ZTIP14bn_blinding_st",
   "self_type" : "_ZTIPP14bn_blinding_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPKv",
   "name" : "const void **",
   "referenced_type" : "_ZTIPKv",
   "self_type" : "_ZTIPPKv",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPh",
   "name" : "unsigned char **",
   "referenced_type" : "_ZTIPh",
   "self_type" : "_ZTIPPh",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/evp.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPPv",
   "name" : "void **",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIPPv",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPc",
   "name" : "char *",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIPc",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/buf.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPh",
   "name" : "unsigned char *",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIPh",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIPj",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/ec_key.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPm",
   "name" : "unsigned long *",
   "referenced_type" : "_ZTIm",
   "self_type" : "_ZTIPm",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/bn.h"
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  }
 ],
 "qualified_types" :
 [
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK11evp_aead_st",
   "name" : "const evp_aead_st",
   "referenced_type" : "_ZTI11evp_aead_st",
   "self_type" : "_ZTIK11evp_aead_st",
   "source_file" : "external/boringssl/src/include/openssl/aead.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK11evp_pkey_st",
   "name" : "const evp_pkey_st",
   "referenced_type" : "_ZTI11evp_pkey_st",
   "self_type" : "_ZTIK11evp_pkey_st",
   "size" : 24,
   "source_file" : "external/boringssl/src/include/openssl/evp.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK12ASN1_ITEM_st",
   "name" : "const ASN1_ITEM_st",
   "referenced_type" : "_ZTI12ASN1_ITEM_st",
   "self_type" : "_ZTIK12ASN1_ITEM_st",
   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13bio_method_st",
   "name" : "const bio_method_st",
   "referenced_type" : "_ZTI13bio_method_st",
   "self_type" : "_ZTIK13bio_method_st",
   "size" : 80,
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13evp_cipher_st",
   "name" : "const evp_cipher_st",
   "referenced_type" : "_ZTI13evp_cipher_st",
   "self_type" : "_ZTIK13evp_cipher_st",
   "size" : 64,
   "source_file" : "external/boringssl/src/include/openssl/cipher.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK15evp_md_pctx_ops",
   "name" : "const evp_md_pctx_ops",
   "referenced_type" : "_ZTI15evp_md_pctx_ops",
   "self_type" : "_ZTIK15evp_md_pctx_ops",
   "source_file" : "external/boringssl/src/include/openssl/digest.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK23evp_pkey_asn1_method_st",
   "name" : "const evp_pkey_asn1_method_st",
   "referenced_type" : "_ZTI23evp_pkey_asn1_method_st",
   "self_type" : "_ZTIK23evp_pkey_asn1_method_st",
   "source_file" : "external/boringssl/src/include/openssl/evp.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK6rsa_st",
   "name" : "const rsa_st",
   "referenced_type" : "_ZTI6rsa_st",
   "self_type" : "_ZTIK6rsa_st",
   "size" : 240,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK9ec_key_st",
   "name" : "const ec_key_st",
   "referenced_type" : "_ZTI9ec_key_st",
   "self_type" : "_ZTIK9ec_key_st",
   "source_file" : "external/boringssl/src/include/openssl/ec_key.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIK9env_md_st",
   "name" : "const env_md_st",
   "referenced_type" : "_ZTI9env_md_st",
   "self_type" : "_ZTIK9env_md_st",
   "source_file" : "external/boringssl/src/include/openssl/digest.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKh",
   "name" : "const unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIKh",
   "size" : 1,
   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "r",
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "s",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP9bignum_st"
    }
   ],
   "linker_set_key" : "_ZTI10DSA_SIG_st",
   "name" : "DSA_SIG_st",
   "referenced_type" : "_ZTI10DSA_SIG_st",
   "self_type" : "_ZTI10DSA_SIG_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/dsa.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "length",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "max",
     "field_offset" : 128,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI10buf_mem_st",
   "name" : "buf_mem_st",
   "referenced_type" : "_ZTI10buf_mem_st",
   "self_type" : "_ZTI10buf_mem_st",
   "size" : 24,
   "source_file" : "external/boringssl/src/include/openssl/buf.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "arg",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "callback",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPFiiiP11bn_gencb_stE"
    }
   ],
   "linker_set_key" : "_ZTI11bn_gencb_st",
   "name" : "bn_gencb_st",
   "referenced_type" : "_ZTI11bn_gencb_st",
   "self_type" : "_ZTI11bn_gencb_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/bn.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "references",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "type",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "pkey",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN11evp_pkey_stUt_E"
    },
    {
     "field_name" : "ameth",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPK23evp_pkey_asn1_method_st"
    }
   ],
   "linker_set_key" : "_ZTI11evp_pkey_st",
   "name" : "evp_pkey_st",
   "referenced_type" : "_ZTI11evp_pkey_st",
   "self_type" : "_ZTI11evp_pkey_st",
   "size" : 24,
   "source_file" : "external/boringssl/src/include/openssl/evp.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "_ZTI24openssl_method_common_st"
    },
    {
     "field_name" : "app_data",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "init",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiP6rsa_stE"
    },
    {
     "field_name" : "finish",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiP6rsa_stE"
    },
    {
     "field_name" : "size",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFmPK6rsa_stE"
    },
    {
     "field_name" : "sign",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFiiPKhjPhPjPK6rsa_stE"
    },
    {
     "field_name" : "sign_raw",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFiP6rsa_stPmPhmPKhmiE"
    },
    {
     "field_name" : "decrypt",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFiP6rsa_stPmPhmPKhmiE"
    },
    {
     "field_name" : "private_transform",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFiP6rsa_stPhPKhmE"
    },
    {
     "field_name" : "flags",
     "field_offset" : 576,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI11rsa_meth_st",
   "name" : "rsa_meth_st",
   "referenced_type" : "_ZTI11rsa_meth_st",
   "self_type" : "_ZTI11rsa_meth_st",
   "size" : 80,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIN12asn1_type_stUt_E"
    }
   ],
   "linker_set_key" : "_ZTI12asn1_type_st",
   "name" : "asn1_type_st",
   "referenced_type" : "_ZTI12asn1_type_st",
   "self_type" : "_ZTI12asn1_type_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "algorithm",
     "referenced_type" : "_ZTIP14asn1_object_st"
    },
    {
     "field_name" : "parameter",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP12asn1_type_st"
    }
   ],
   "linker_set_key" : "_ZTI13X509_algor_st",
   "name" : "X509_algor_st",
   "referenced_type" : "_ZTI13X509_algor_st",
   "self_type" : "_ZTI13X509_algor_st",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "type",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "name",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "bwrite",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiP6bio_stPKciE"
    },
    {
     "field_name" : "bread",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiP6bio_stPciE"
    },
    {
     "field_name" : "bputs",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiP6bio_stPKcE"
    },
    {
     "field_name" : "bgets",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFiP6bio_stPciE"
    },
    {
     "field_name" : "ctrl",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFlP6bio_stilPvE"
    },
    {
     "field_name" : "create",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFiP6bio_stE"
    },
    {
     "field_name" : "destroy",
     "field_offset" : 512,
     "referenced_type" : "_ZTIPFiP6bio_stE"
    },
    {
     "field_name" : "callback_ctrl",
     "field_offset" : 576,
     "referenced_type" : "_ZTIPFlP6bio_stiPFlS0_iPKcillEE"
    }
   ],
   "linker_set_key" : "_ZTI13bio_method_st",
   "name" : "bio_method_st",
   "referenced_type" : "_ZTI13bio_method_st",
   "self_type" : "_ZTI13bio_method_st",
   "size" : 80,
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "digest",
     "referenced_type" : "_ZTIPK9env_md_st"
    },
    {
     "field_name" : "md_data",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "pctx",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP15evp_pkey_ctx_st"
    },
    {
     "field_name" : "pctx_ops",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPK15evp_md_pctx_ops"
    }
   ],
   "linker_set_key" : "_ZTI13env_md_ctx_st",
   "name" : "env_md_ctx_st",
   "referenced_type" : "_ZTI13env_md_ctx_st",
   "self_type" : "_ZTI13env_md_ctx_st",
   "size" : 32,
   "source_file" : "external/boringssl/src/include/openssl/digest.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "block_size",
     "field_offset" : 32,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "key_len",
     "field_offset" : 64,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "iv_len",
     "field_offset" : 96,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ctx_size",
     "field_offset" : 128,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "flags",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "app_data",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "init",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiP17evp_cipher_ctx_stPKhS2_iE"
    },
    {
     "field_name" : "cipher",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFiP17evp_cipher_ctx_stPhPKhmE"
    },
    {
     "field_name" : "cleanup",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPFvP17evp_cipher_ctx_stE"
    },
    {
     "field_name" : "ctrl",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPFiP17evp_cipher_ctx_stiiPvE"
    }
   ],
   "linker_set_key" : "_ZTI13evp_cipher_st",
   "name" : "evp_cipher_st",
   "referenced_type" : "_ZTI13evp_cipher_st",
   "self_type" : "_ZTI13evp_cipher_st",
   "size" : 64,
   "source_file" : "external/boringssl/src/include/openssl/cipher.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "references",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP20CRYPTO_dynlock_value"
    }
   ],
   "linker_set_key" : "_ZTI14CRYPTO_dynlock",
   "name" : "CRYPTO_dynlock",
   "referenced_type" : "_ZTI14CRYPTO_dynlock",
   "self_type" : "_ZTI14CRYPTO_dynlock",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sn",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "ln",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "nid",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "length",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPKh"
    },
    {
     "field_name" : "flags",
     "field_offset" : 256,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI14asn1_object_st",
   "name" : "asn1_object_st",
   "referenced_type" : "_ZTI14asn1_object_st",
   "self_type" : "_ZTI14asn1_object_st",
   "size" : 40,
   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "length",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "type",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    }
   ],
   "linker_set_key" : "_ZTI14asn1_string_st",
   "name" : "asn1_string_st",
   "referenced_type" : "_ZTI14asn1_string_st",
   "self_type" : "_ZTI14asn1_string_st",
   "size" : 24,
   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "RR",
     "referenced_type" : "_ZTI9bignum_st"
    },
    {
     "field_name" : "N",
     "field_offset" : 192,
     "referenced_type" : "_ZTI9bignum_st"
    },
    {
     "field_name" : "n0",
     "field_offset" : 384,
     "referenced_type" : "_ZTIA2_m"
    }
   ],
   "linker_set_key" : "_ZTI14bn_mont_ctx_st",
   "name" : "bn_mont_ctx_st",
   "referenced_type" : "_ZTI14bn_mont_ctx_st",
   "self_type" : "_ZTI14bn_mont_ctx_st",
   "size" : 64,
   "source_file" : "external/boringssl/src/include/openssl/bn.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "alignment",
     "referenced_type" : "_ZTId"
    },
    {
     "field_name" : "padding",
     "referenced_type" : "_ZTIA56_h"
    }
   ],
   "linker_set_key" : "_ZTI15crypto_mutex_st",
   "name" : "crypto_mutex_st",
   "record_kind" : "union",
   "referenced_type" : "_ZTI15crypto_mutex_st",
   "self_type" : "_ZTI15crypto_mutex_st",
   "size" : 56,
   "source_file" : "external/boringssl/src/include/openssl/thread.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "common",
     "referenced_type" : "_ZTI24openssl_method_common_st"
    },
    {
     "field_name" : "app_data",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "init",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPFiP9ec_key_stE"
    },
    {
     "field_name" : "finish",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPFiP9ec_key_stE"
    },
    {
     "field_name" : "group_order_size",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFmPK9ec_key_stE"
    },
    {
     "field_name" : "sign",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPFiPKhmPhPjP9ec_key_stE"
    },
    {
     "field_name" : "flags",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI15ecdsa_method_st",
   "name" : "ecdsa_method_st",
   "referenced_type" : "_ZTI15ecdsa_method_st",
   "self_type" : "_ZTI15ecdsa_method_st",
   "size" : 56,
   "source_file" : "external/boringssl/src/include/openssl/ec_key.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "aead",
     "referenced_type" : "_ZTIPK11evp_aead_st"
    },
    {
     "field_name" : "state",
     "field_offset" : 64,
     "referenced_type" : "_ZTI21evp_aead_ctx_st_state"
    },
    {
     "field_name" : "tag_len",
     "field_offset" : 4736,
     "referenced_type" : "_ZTIh"
    }
   ],
   "linker_set_key" : "_ZTI15evp_aead_ctx_st",
   "name" : "evp_aead_ctx_st",
   "referenced_type" : "_ZTI15evp_aead_ctx_st",
   "self_type" : "_ZTI15evp_aead_ctx_st",
   "size" : 600,
   "source_file" : "external/boringssl/src/include/openssl/aead.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "enc",
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "len",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "modified",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "alias_only",
     "field_offset" : 160,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "alias_only_on_next_parse",
     "field_offset" : 161,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI16ASN1_ENCODING_st",
   "name" : "ASN1_ENCODING_st",
   "referenced_type" : "_ZTI16ASN1_ENCODING_st",
   "self_type" : "_ZTI16ASN1_ENCODING_st",
   "size" : 24,
   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "comment",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI16EC_builtin_curve",
   "name" : "EC_builtin_curve",
   "referenced_type" : "_ZTI16EC_builtin_curve",
   "self_type" : "_ZTI16EC_builtin_curve",
   "size" : 16,
   "source_file" : "external/boringssl/src/include/openssl/ec.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "sk",
     "referenced_type" : "_ZTIP13stack_st_void"
    }
   ],
   "linker_set_key" : "_ZTI17crypto_ex_data_st",
   "name" : "crypto_ex_data_st",
   "referenced_type" : "_ZTI17crypto_ex_data_st",
   "self_type" : "_ZTI17crypto_ex_data_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/ex_data.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cipher",
     "referenced_type" : "_ZTIPK13evp_cipher_st"
    },
    {
     "field_name" : "app_data",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "cipher_data",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "key_len",
     "field_offset" : 192,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "encrypt",
     "field_offset" : 224,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 256,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "oiv",
     "field_offset" : 288,
     "referenced_type" : "_ZTIA16_h"
    },
    {
     "field_name" : "iv",
     "field_offset" : 416,
     "referenced_type" : "_ZTIA16_h"
    },
    {
     "field_name" : "buf",
     "field_offset" : 544,
     "referenced_type" : "_ZTIA32_h"
    },
    {
     "field_name" : "buf_len",
     "field_offset" : 800,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "num",
     "field_offset" : 832,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "final_used",
     "field_offset" : 864,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "block_mask",
     "field_offset" : 896,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "final",
     "field_offset" : 928,
     "referenced_type" : "_ZTIA32_h"
    }
   ],
   "linker_set_key" : "_ZTI17evp_cipher_ctx_st",
   "name" : "evp_cipher_ctx_st",
   "referenced_type" : "_ZTI17evp_cipher_ctx_st",
   "self_type" : "_ZTI17evp_cipher_ctx_st",
   "size" : 152,
   "source_file" : "external/boringssl/src/include/openssl/cipher.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "data_used",
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "data",
     "field_offset" : 32,
     "referenced_type" : "_ZTIA48_h"
    },
    {
     "field_name" : "eof_seen",
     "field_offset" : 416,
     "referenced_type" : "_ZTIc"
    },
    {
     "field_name" : "error_encountered",
     "field_offset" : 424,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI17evp_encode_ctx_st",
   "name" : "evp_encode_ctx_st",
   "referenced_type" : "_ZTI17evp_encode_ctx_st",
   "self_type" : "_ZTI17evp_encode_ctx_st",
   "size" : 56,
   "source_file" : "external/boringssl/src/include/openssl/base64.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "cipher",
     "referenced_type" : "_ZTIPK13evp_cipher_st"
    },
    {
     "field_name" : "iv",
     "field_offset" : 64,
     "referenced_type" : "_ZTIA16_h"
    }
   ],
   "linker_set_key" : "_ZTI18evp_cipher_info_st",
   "name" : "evp_cipher_info_st",
   "referenced_type" : "_ZTI18evp_cipher_info_st",
   "self_type" : "_ZTI18evp_cipher_info_st",
   "size" : 24,
   "source_file" : "external/boringssl/src/include/openssl/cipher.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "nid",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "minsize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "maxsize",
     "field_offset" : 128,
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "mask",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "flags",
     "field_offset" : 256,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI20asn1_string_table_st",
   "name" : "asn1_string_table_st",
   "referenced_type" : "_ZTI20asn1_string_table_st",
   "self_type" : "_ZTI20asn1_string_table_st",
   "size" : 40,
   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "bitnum",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "lname",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "sname",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    }
   ],
   "linker_set_key" : "_ZTI21BIT_STRING_BITNAME_st",
   "name" : "BIT_STRING_BITNAME_st",
   "referenced_type" : "_ZTI21BIT_STRING_BITNAME_st",
   "self_type" : "_ZTI21BIT_STRING_BITNAME_st",
   "size" : 24,
   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "opaque",
     "referenced_type" : "_ZTIA580_h"
    },
    {
     "field_name" : "alignment",
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI21evp_aead_ctx_st_state",
   "name" : "evp_aead_ctx_st_state",
   "record_kind" : "union",
   "referenced_type" : "_ZTI21evp_aead_ctx_st_state",
   "self_type" : "_ZTI21evp_aead_ctx_st_state",
   "size" : 584,
   "source_file" : "external/boringssl/src/include/openssl/aead.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "references",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "is_static",
     "field_offset" : 32,
     "referenced_type" : "_ZTIc"
    }
   ],
   "linker_set_key" : "_ZTI24openssl_method_common_st",
   "name" : "openssl_method_common_st",
   "referenced_type" : "_ZTI24openssl_method_common_st",
   "self_type" : "_ZTI24openssl_method_common_st",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/engine.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "method",
     "referenced_type" : "_ZTIPK13bio_method_st"
    },
    {
     "field_name" : "init",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "shutdown",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "retry_reason",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "num",
     "field_offset" : 192,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "references",
     "field_offset" : 224,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ptr",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "next_bio",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP6bio_st"
    },
    {
     "field_name" : "num_read",
     "field_offset" : 384,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "num_write",
     "field_offset" : 448,
     "referenced_type" : "_ZTIm"
    }
   ],
   "linker_set_key" : "_ZTI6bio_st",
   "name" : "bio_st",
   "referenced_type" : "_ZTI6bio_st",
   "self_type" : "_ZTI6bio_st",
   "size" : 64,
   "source_file" : "external/boringssl/src/include/openssl/bio.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIl"
    },
    {
     "field_name" : "p",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "q",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "g",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "pub_key",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "priv_key",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "flags",
     "field_offset" : 384,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "method_mont_lock",
     "field_offset" : 448,
     "referenced_type" : "_ZTI15crypto_mutex_st"
    },
    {
     "field_name" : "method_mont_p",
     "field_offset" : 896,
     "referenced_type" : "_ZTIP14bn_mont_ctx_st"
    },
    {
     "field_name" : "method_mont_q",
     "field_offset" : 960,
     "referenced_type" : "_ZTIP14bn_mont_ctx_st"
    },
    {
     "field_name" : "references",
     "field_offset" : 1024,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "ex_data",
     "field_offset" : 1088,
     "referenced_type" : "_ZTI17crypto_ex_data_st"
    }
   ],
   "linker_set_key" : "_ZTI6dsa_st",
   "name" : "dsa_st",
   "referenced_type" : "_ZTI6dsa_st",
   "self_type" : "_ZTI6dsa_st",
   "size" : 144,
   "source_file" : "external/boringssl/src/include/openssl/dsa.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "meth",
     "referenced_type" : "_ZTIP11rsa_meth_st"
    },
    {
     "field_name" : "n",
     "field_offset" : 64,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "e",
     "field_offset" : 128,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "d",
     "field_offset" : 192,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "p",
     "field_offset" : 256,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "q",
     "field_offset" : 320,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "dmp1",
     "field_offset" : 384,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "dmq1",
     "field_offset" : 448,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "iqmp",
     "field_offset" : 512,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "ex_data",
     "field_offset" : 576,
     "referenced_type" : "_ZTI17crypto_ex_data_st"
    },
    {
     "field_name" : "references",
     "field_offset" : 640,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "flags",
     "field_offset" : 672,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "lock",
     "field_offset" : 704,
     "referenced_type" : "_ZTI15crypto_mutex_st"
    },
    {
     "field_name" : "mont_n",
     "field_offset" : 1152,
     "referenced_type" : "_ZTIP14bn_mont_ctx_st"
    },
    {
     "field_name" : "mont_p",
     "field_offset" : 1216,
     "referenced_type" : "_ZTIP14bn_mont_ctx_st"
    },
    {
     "field_name" : "mont_q",
     "field_offset" : 1280,
     "referenced_type" : "_ZTIP14bn_mont_ctx_st"
    },
    {
     "field_name" : "d_fixed",
     "field_offset" : 1344,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "dmp1_fixed",
     "field_offset" : 1408,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "dmq1_fixed",
     "field_offset" : 1472,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "inv_small_mod_large_mont",
     "field_offset" : 1536,
     "referenced_type" : "_ZTIP9bignum_st"
    },
    {
     "field_name" : "num_blindings",
     "field_offset" : 1600,
     "referenced_type" : "_ZTIj"
    },
    {
     "field_name" : "blindings",
     "field_offset" : 1664,
     "referenced_type" : "_ZTIPP14bn_blinding_st"
    },
    {
     "field_name" : "blindings_inuse",
     "field_offset" : 1728,
     "referenced_type" : "_ZTIPh"
    },
    {
     "field_name" : "blinding_fork_generation",
     "field_offset" : 1792,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "private_key_frozen",
     "field_offset" : 1856,
     "referenced_type" : "_ZTIj"
    }
   ],
   "linker_set_key" : "_ZTI6rsa_st",
   "name" : "rsa_st",
   "referenced_type" : "_ZTI6rsa_st",
   "self_type" : "_ZTI6rsa_st",
   "size" : 240,
   "source_file" : "external/boringssl/src/include/openssl/rsa.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "num",
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "data",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPPv"
    },
    {
     "field_name" : "sorted",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "num_alloc",
     "field_offset" : 192,
     "referenced_type" : "_ZTIm"
    },
    {
     "field_name" : "comp",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiPPKvS1_E"
    }
   ],
   "linker_set_key" : "_ZTI8stack_st",
   "name" : "stack_st",
   "referenced_type" : "_ZTI8stack_st",
   "self_type" : "_ZTI8stack_st",
   "size" : 40,
   "source_file" : "external/boringssl/src/include/openssl/stack.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "d",
     "referenced_type" : "_ZTIPm"
    },
    {
     "field_name" : "width",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "dmax",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "neg",
     "field_offset" : 128,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "flags",
     "field_offset" : 160,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI9bignum_st",
   "name" : "bignum_st",
   "referenced_type" : "_ZTI9bignum_st",
   "self_type" : "_ZTI9bignum_st",
   "size" : 24,
   "source_file" : "external/boringssl/src/include/openssl/bn.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ptr",
     "referenced_type" : "_ZTIPv"
    },
    {
     "field_name" : "rsa",
     "referenced_type" : "_ZTIP6rsa_st"
    },
    {
     "field_name" : "dsa",
     "referenced_type" : "_ZTIP6dsa_st"
    },
    {
     "field_name" : "dh",
     "referenced_type" : "_ZTIP5dh_st"
    },
    {
     "field_name" : "ec",
     "referenced_type" : "_ZTIP9ec_key_st"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN11evp_pkey_stUt_E",
   "name" : "evp_pkey_st::(anonymous union at external/boringssl/src/include/openssl/evp.h:1064:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN11evp_pkey_stUt_E",
   "self_type" : "_ZTIN11evp_pkey_stUt_E",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/evp.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "ptr",
     "referenced_type" : "_ZTIPc"
    },
    {
     "field_name" : "boolean",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "asn1_string",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "object",
     "referenced_type" : "_ZTIP14asn1_object_st"
    },
    {
     "field_name" : "integer",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "enumerated",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "bit_string",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "octet_string",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "printablestring",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "t61string",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "ia5string",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "generalstring",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "bmpstring",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "universalstring",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "utctime",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "generalizedtime",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "visiblestring",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "utf8string",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "set",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "sequence",
     "referenced_type" : "_ZTIP14asn1_string_st"
    },
    {
     "field_name" : "asn1_value",
     "referenced_type" : "_ZTIP13ASN1_VALUE_st"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "_ZTIN12asn1_type_stUt_E",
   "name" : "asn1_type_st::(anonymous union at external/boringssl/src/include/openssl/asn1.h:586:3)",
   "record_kind" : "union",
   "referenced_type" : "_ZTIN12asn1_type_stUt_E",
   "self_type" : "_ZTIN12asn1_type_stUt_E",
   "size" : 8,
   "source_file" : "external/boringssl/src/include/openssl/asn1.h"
  }
 ],
 "rvalue_reference_types" : []
}
