#ifndef HIDL_GENERATED_ANDROID_HARDWARE_BLUETOOTH_A2DP_V1_0_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_BLUETOOTH_A2DP_V1_0_TYPES_H

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace bluetooth {
namespace a2dp {
namespace V1_0 {

// Forward declaration for forward reference support:
enum class Status : uint8_t;
enum class CodecType : uint32_t;
enum class SampleRate : uint32_t;
enum class BitsPerSample : uint8_t;
enum class ChannelMode : uint8_t;
struct CodecConfiguration;

enum class Status : uint8_t {
    SUCCESS = 0,
    FAILURE = 1 /* ::android::hardware::bluetooth::a2dp::V1_0::Status.SUCCESS implicitly + 1 */,
    /**
     * codec configuration not supported by the audio platform
     */
    UNSUPPORTED_CODEC_CONFIGURATION = 2 /* ::android::hardware::bluetooth::a2dp::V1_0::Status.FAILURE implicitly + 1 */,
    /**
     * operation is pending
     */
    PENDING = 3 /* ::android::hardware::bluetooth::a2dp::V1_0::Status.UNSUPPORTED_CODEC_CONFIGURATION implicitly + 1 */,
};

enum class CodecType : uint32_t {
    UNKNOWN = 0u /* 0x00 */,
    SBC = 1u /* 0x01 */,
    AAC = 2u /* 0x02 */,
    APTX = 4u /* 0x04 */,
    APTX_HD = 8u /* 0x08 */,
    LDAC = 16u /* 0x10 */,
};

enum class SampleRate : uint32_t {
    RATE_UNKNOWN = 0u /* 0x00 */,
    RATE_44100 = 1u /* 0x01 */,
    RATE_48000 = 2u /* 0x02 */,
    RATE_88200 = 4u /* 0x04 */,
    RATE_96000 = 8u /* 0x08 */,
    RATE_176400 = 16u /* 0x10 */,
    RATE_192000 = 32u /* 0x20 */,
};

enum class BitsPerSample : uint8_t {
    BITS_UNKNOWN = 0 /* 0x00 */,
    BITS_16 = 1 /* 0x01 */,
    BITS_24 = 2 /* 0x02 */,
    BITS_32 = 4 /* 0x04 */,
};

enum class ChannelMode : uint8_t {
    UNKNOWN = 0 /* 0x00 */,
    MONO = 1 /* 0x01 */,
    STEREO = 2 /* 0x02 */,
};

struct CodecConfiguration final {
    // Forward declaration for forward reference support:
    union CodecSpecific;

    union CodecSpecific final {
        // Forward declaration for forward reference support:
        struct SbcData;
        struct LdacData;

        struct SbcData final {
            /**
             * Block length: 4 bits | Subbands: 2 bits | Allocation Method: 2 bits
             */
            uint8_t codecParameters __attribute__ ((aligned(1)));
            /**
             * Minimum bitpool value
             */
            uint8_t minBitpool __attribute__ ((aligned(1)));
            /**
             * Maximum bitpool value
             */
            uint8_t maxBitpool __attribute__ ((aligned(1)));
        };

        static_assert(offsetof(::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration::CodecSpecific::SbcData, codecParameters) == 0, "wrong offset");
        static_assert(offsetof(::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration::CodecSpecific::SbcData, minBitpool) == 1, "wrong offset");
        static_assert(offsetof(::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration::CodecSpecific::SbcData, maxBitpool) == 2, "wrong offset");
        static_assert(sizeof(::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration::CodecSpecific::SbcData) == 3, "wrong size");
        static_assert(__alignof(::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration::CodecSpecific::SbcData) == 1, "wrong alignment");

        struct LdacData final {
            /**
             * LDAC bitrate index value:
             * 0x00 - High
             * 0x01 - Mid
             * 0x02 - Low
             * 0x7F - ABR (Adaptive Bit Rate)
             */
            uint8_t bitrateIndex __attribute__ ((aligned(1)));
        };

        static_assert(offsetof(::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration::CodecSpecific::LdacData, bitrateIndex) == 0, "wrong offset");
        static_assert(sizeof(::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration::CodecSpecific::LdacData) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration::CodecSpecific::LdacData) == 1, "wrong alignment");

        /**
         * SBC Codec specific information
         * Refer to SBC Codec specific information elements in A2DP v1.3
         * Profile Specification.
         */
        ::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration::CodecSpecific::SbcData sbcData __attribute__ ((aligned(1)));
        ::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration::CodecSpecific::LdacData ldacData __attribute__ ((aligned(1)));
    };

    static_assert(offsetof(::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration::CodecSpecific, sbcData) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration::CodecSpecific, ldacData) == 0, "wrong offset");
    static_assert(sizeof(::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration::CodecSpecific) == 3, "wrong size");
    static_assert(__alignof(::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration::CodecSpecific) == 1, "wrong alignment");

    /**
     * Bluetooth A2DP codec
     */
    ::android::hardware::bluetooth::a2dp::V1_0::CodecType codecType __attribute__ ((aligned(4)));
    /**
     * Sampling rate for encoder
     */
    ::android::hardware::bluetooth::a2dp::V1_0::SampleRate sampleRate __attribute__ ((aligned(4)));
    /**
     * Bits per sample for encoder
     */
    ::android::hardware::bluetooth::a2dp::V1_0::BitsPerSample bitsPerSample __attribute__ ((aligned(1)));
    /**
     * Channel mode for encoder
     */
    ::android::hardware::bluetooth::a2dp::V1_0::ChannelMode channelMode __attribute__ ((aligned(1)));
    /**
     * The encoded audio bitrate in bits / second.
     * 0x00000000 - The audio bitrate is not specified / unused
     * 0x00000001 - 0x00FFFFFF - Encoded audio bitrate in bits/second
     * 0x01000000 - 0xFFFFFFFF - Reserved
     */
    uint32_t encodedAudioBitrate __attribute__ ((aligned(4)));
    /**
     * Peer MTU (in octets)
     */
    uint16_t peerMtu __attribute__ ((aligned(2)));
    ::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration::CodecSpecific codecSpecific __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration, codecType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration, sampleRate) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration, bitsPerSample) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration, channelMode) == 9, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration, encodedAudioBitrate) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration, peerMtu) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration, codecSpecific) == 18, "wrong offset");
static_assert(sizeof(::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration) == 24, "wrong size");
static_assert(__alignof(::android::hardware::bluetooth::a2dp::V1_0::CodecConfiguration) == 4, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(uint8_t o);
static inline std::string toString(::android::hardware::bluetooth::a2dp::V1_0::Status o);
static inline void PrintTo(::android::hardware::bluetooth::a2dp::V1_0::Status o, ::std::ostream* os);
constexpr uint8_t operator|(const ::android::hardware::bluetooth::a2dp::V1_0::Status lhs, const ::android::hardware::bluetooth::a2dp::V1_0::Status rhs) {
    return static_cast<uint8_t>(static_cast<uint8_t>(lhs) | static_cast<uint8_t>(rhs));
}
constexpr uint8_t operator|(const uint8_t lhs, const ::android::hardware::bluetooth::a2dp::V1_0::Status rhs) {
    return static_cast<uint8_t>(lhs | static_cast<uint8_t>(rhs));
}
constexpr uint8_t operator|(const ::android::hardware::bluetooth::a2dp::V1_0::Status lhs, const uint8_t rhs) {
