#ifndef HIDL_GENERATED_VENDOR_OPLUS_HARDWARE_BIOMETRICS_FINGERPRINT_V2_1_TYPES_H
#define HIDL_GENERATED_VENDOR_OPLUS_HARDWARE_BIOMETRICS_FINGERPRINT_V2_1_TYPES_H

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace vendor {
namespace oplus {
namespace hardware {
namespace biometrics {
namespace fingerprint {
namespace V2_1 {

// Forward declaration for forward reference support:
enum class RequestStatus : int32_t;
enum class FingerprintError : int32_t;
enum class FingerprintAcquiredInfo : int32_t;
struct FingerprintFingerId;
struct FingerprintEnroll;
struct FingerprintIterator;
struct FingerprintAcquired;
struct FingerprintAuthenticated;
enum class FingerprintMsgType : int32_t;
enum class FingerprintScreenState : int32_t;
enum class FingerprintAuthType : int32_t;

enum class RequestStatus : int32_t {
    SYS_UNKNOWN = 1,
    SYS_OK = 0,
    SYS_ENOENT = -2 /* -2 */,
    SYS_EINTR = -4 /* -4 */,
    SYS_EIO = -5 /* -5 */,
    SYS_EAGAIN = -11 /* -11 */,
    SYS_ENOMEM = -12 /* -12 */,
    SYS_EACCES = -13 /* -13 */,
    SYS_EFAULT = -14 /* -14 */,
    SYS_EBUSY = -16 /* -16 */,
    SYS_EINVAL = -22 /* -22 */,
    SYS_ENOSPC = -28 /* -28 */,
    SYS_ETIMEDOUT = -110 /* -110 */,
};

enum class FingerprintError : int32_t {
    ERROR_NO_ERROR = 0,
    ERROR_HW_UNAVAILABLE = 1,
    ERROR_UNABLE_TO_PROCESS = 2,
    ERROR_TIMEOUT = 3,
    ERROR_NO_SPACE = 4,
    ERROR_CANCELED = 5,
    ERROR_UNABLE_TO_REMOVE = 6,
    ERROR_LOCKOUT = 7,
    ERROR_VENDOR = 8,
};

enum class FingerprintAcquiredInfo : int32_t {
    ACQUIRED_GOOD = 0,
    ACQUIRED_PARTIAL = 1,
    ACQUIRED_INSUFFICIENT = 2,
    ACQUIRED_IMAGER_DIRTY = 3,
    ACQUIRED_TOO_SLOW = 4,
    ACQUIRED_TOO_FAST = 5,
    ACQUIRED_VENDOR = 6,
};

struct FingerprintFingerId final {
    uint32_t gid __attribute__ ((aligned(4)));
    uint32_t fid __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintFingerId, gid) == 0, "wrong offset");
static_assert(offsetof(::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintFingerId, fid) == 4, "wrong offset");
static_assert(sizeof(::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintFingerId) == 8, "wrong size");
static_assert(__alignof(::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintFingerId) == 4, "wrong alignment");

struct FingerprintEnroll final {
    ::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintFingerId finger __attribute__ ((aligned(4)));
    uint32_t samplesRemaining __attribute__ ((aligned(4)));
    uint64_t msg __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintEnroll, finger) == 0, "wrong offset");
static_assert(offsetof(::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintEnroll, samplesRemaining) == 8, "wrong offset");
static_assert(offsetof(::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintEnroll, msg) == 16, "wrong offset");
static_assert(sizeof(::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintEnroll) == 24, "wrong size");
static_assert(__alignof(::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintEnroll) == 8, "wrong alignment");

struct FingerprintIterator final {
    ::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintFingerId finger __attribute__ ((aligned(4)));
    uint32_t remainingTemplates __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintIterator, finger) == 0, "wrong offset");
static_assert(offsetof(::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintIterator, remainingTemplates) == 8, "wrong offset");
static_assert(sizeof(::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintIterator) == 12, "wrong size");
static_assert(__alignof(::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintIterator) == 4, "wrong alignment");

typedef ::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintIterator FingerprintEnumerated;

typedef ::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintIterator FingerprintRemoved;

struct FingerprintAcquired final {
    ::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintAcquiredInfo acquiredInfo __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintAcquired, acquiredInfo) == 0, "wrong offset");
static_assert(sizeof(::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintAcquired) == 4, "wrong size");
static_assert(__alignof(::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintAcquired) == 4, "wrong alignment");

struct FingerprintAuthenticated final {
    ::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintFingerId finger __attribute__ ((aligned(4)));
    ::android::hardware::hidl_array<uint8_t, 69> hat __attribute__ ((aligned(1)));
};

static_assert(offsetof(::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintAuthenticated, finger) == 0, "wrong offset");
static_assert(offsetof(::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintAuthenticated, hat) == 8, "wrong offset");
static_assert(sizeof(::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintAuthenticated) == 80, "wrong size");
static_assert(__alignof(::vendor::oplus::hardware::biometrics::fingerprint::V2_1::FingerprintAuthenticated) == 4, "wrong alignment");

enum class FingerprintMsgType : int32_t {
    ERROR = -1 /* -1 */,
    ACQUIRED = 1,
    TEMPLATE_ENROLLING = 3,
    TEMPLATE_REMOVED = 4,
    AUTHENTICATED = 5,
    TEMPLATE_ENUMERATING = 6,
};

enum class FingerprintScreenState : int32_t {
    FINGERPRINT_SCREEN_OFF = 0,
    FINGERPRINT_SCREEN_ON = 1,
};

enum class FingerprintAuthType : int32_t {
    TYPE_KEYGUARD = 1,
    TYPE_PAY = 2,
    TYPE_OTHER = 3,
};

//
// type declarations for package
//

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::vendor::oplus::hardware::biometrics::fingerprint::V2_1::RequestStatus o);
static inline void PrintTo(::vendor::oplus::hardware::biometrics::fingerprint::V2_1::RequestStatus o, ::std::ostream* os);
